[
    {
        "name": " C5 Hydrocarbon Resin",
        "cas_no": "64742-16-1",
        "cins_no": " 265-116-8",
        "molecular_formula": "",
        "discription": "C5 hydrocarbon resin, also known as petroleum resin, is a non -toxic substance in granular form, with a color close to light yellow. It isn't a high polymer but a low polymer with the molecular weight between 300-3000. Featured by acid value, easy mutual solubility, resistant to water, resistant to ethanol and chemicals. It has the chemical stabilizing property to acid and alkaline, viscosity adjusting and thermal stabilizing. C5 resins are mainly used as tackifiers in adhesives (e.g. hot melt, pressure-sensitive adhesives, etc.), and also in road marking paints and rubber products, coating(especially traffic paint), printing ink, paper, etc.  ",
        "typical_properties": "Insoluble in water, ketone solvents, and glycol solutions, but it has very good solubility in aromatic hydrocarbons, esters, and chlorinated solvents such as chloroform. It benefits from excellent flexibility and adhesion properties. C5 petroleum resin belongs to the category of aliphatic resins with low molecular weight, capable of providing good chemical stability in acidic and alkaline environments, and can be blended with C9 petroleum resin.  Appearance  Light yellow granular  Softening point (℃)  98-102  Color number(Ga)  4 ~ 6  Acid value (%)  0.5 max  Iodine value (mg BR/100g)  20~45  Insolubles acuities(%)  0.1 max  Ash(%)  0.1 max  Bromine value (g Br/100g)  70 max  Viscosity (190 ℃,MPa. S）  1500~3000  Fire Point （℃）  260",
        "packing": "In 25 kgs kraft paper bags, 500 kgs or 1,000 kgs jumbo bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Adhesives: Used as a tackifier in hot melt adhesives, pressure-sensitive adhesives, and solvent-based adhesives.  Coatings: Used in the production of coatings for automotive, construction, and industrial applications, due to its excellent adhesion and compatibility with other materials.  Rubber: Used as a processing aid and tackifier in the production of rubber products, such as tires, hoses, and belts.  Printing inks: Used as a resin in the production of printing inks, due to its excellent compatibility with pigments and other additives."
    },
    {
        "name": "Chloroprene Rubber CR 232",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A xanthogen or dodecyl mercaptan modified polychloroprene rubber with medium crystallization rate. The density is 1.23. It has good heat resistance andhigh temperature stability. It is similar to Denka’s M-40 and Du Pont’s neoprene W.  ",
        "typical_properties": "White or grey chips,with talcum as a release agent,no mechanical impurities.  Properties  Specification    Mooney viscosity (ML)  CR 2321  CR 2322  CR2323 30~45  46~55  70-130(customized) Mooney burning,Mst5,Min ≥  11  Tensile Strength,Mpa ≥  12  500% Stress at Definite Elongation,Mpa  1~5  Elongation at Failure,%≥  750  Volatile matter,%≤  1.5  Ash,%≤  1.0",
        "packing": "In 25kg kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used for manufacture of light-colored rubber products such as seals, dust cover, rubber covered roller, lining, rubber dams and hose outer sheath and etc.  "
    },
    {
        "name": "Chloroprene Rubber CR 244  ",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A xanthogen-modified polychloroprene rubber with fast crystallization rate,high cohesioin force and adhesion strength at normal temperature. Fast crystallization rate, density 1.23, milky or light brown block, non-polluting. Its molecular structure is regular, its cohesion is high, and its adhesive strength is high at room temperature.   Used maily for production of adhesives. It is similar to Du Pont's neoprene type AD-20 and Denka A-90.  ",
        "typical_properties": "CR Series    Brookfield  Viscosity In 5%   toluene solution (mPa.s at 23℃)  Brookfield  Viscosity In 15% toluene solution (mPa.s at 23℃)  Crystallization  Ash  Content%  ≤  Volatiles  Content%  ≤  Peeling  Strengthen/Cm  ≥  CR-2441  25-34  1000-2000  High  1.0  1.5  90  CR-2442  35-53  2000-3000      CR-2443  54-75  3000-5000      CR-2444  76-115  5000-7000      CR-244A  116-140  7000-9000      CR-244B  ≥140  ≥9000     \\",
        "packing": "In 25kg kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is the main substrate for neoprene adhesives. Widely used for self-adhesion or mutual adhesion of rubber, leather, fiber, metal, wood, cement products, etc.  "
    },
    {
        "name": "Dark color C9 Hydrocarbon Resin",
        "cas_no": "  64742-16-1  ",
        "cins_no": "265-116-8",
        "molecular_formula": "",
        "discription": "Dark Color C9 petroleum resin,also known as Dark Color C9 Hydrocarbon Resin is a petroleum by-product of ethylene made of C9 fraction which is produced by pre-treatment, polymerization and distillation processes. It is not a high polymer but a low polymer molecular weight between 300-3000. It has the characteristics of low acid value, good miscibility, water,ethanol and chemical resistance, the chemical stability against acid, the good adjustment of viscosity and thermal stability. Generally, 9 petroleum resin is not used alone, but as promoters, regulators, modifiers used with other resin.It is mainly used in coatings, rubber additives, paper additives, inks, adhesives and other fields, and has a large market demand.  ",
        "typical_properties": "Soluble in acetone, methyl ethyl ketone, cyclohexane, ethylene dichloride, ethyl acetate, toluene, gasoline, etc. Insoluble in ethanol and water.  Item  Dark color C9 hydrocarbon resin  Softening point( R & B, ℃)  100  110  120  Gardner Color No. series (Resin:  toluene=1:1)  15 - 18 #  15 - 18 #  15 - 18 #  Acid Value (mgKOH/g  0.5 max  Ash Content %  0.1 max  ",
        "packing": "In 25 kgs kraft paper bags, 500 kgs or 1,000 kgs jumbo bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1.Paints Industry:  In paint industry mainly use the high softening point of C9 petroleum resin which can increase the gloss of paint and improve the adhesion, the hardness and the resistance ability of ac id and alkali.    2.Tire and Rubber Industry:  In tire and rubber industry, low softening point of C9 petroleum resin is mainly used which has a good miscibility with natural rubber particles, and little affect on rubber vulcanization. Adding in rubber and tires, petroleum resin can increase the adhesion and the reinforcement and can also play as softener.    3. Adhesives Industry:  C9 petroleum resin having good adhesion, added in the process of producing adhesives and pressure-sensitive adhesives can improve the adhesive bond strength, acid resistance, alkali resistance and water resistance, and also can reduce production costs effectively.    4.Ink Industry:  In ink industry mainly use the high softening point of C9 petroleum resin which can reach the effect of show color, quick-drying and brightening and improve printing performance, etc.    5.Others petroleum resin having certain characteristic of unsaturated, can be used as paper glue, plastic modifier etc."
    },
    {
        "name": "Chloroprene Rubber DCR 114",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A sulfur-modified copolymer made by copolymerization of chloroprene and dichloro -butadiene,a product that has excellent crystallization resistance and good molding adhesion,Used mainly for manufacture of dynamic products with high strength such as conveyer ,synchronous belt,etc.  It ls similar to Do Pont’t neoprene type GRT and Denka’s PS-40.",
        "typical_properties": "Properties  Specification  Mooney viscosity (ML)  DCR 1141  DCR 1142  30~45  46~60  Mooney burning,Mst5,Min ≥  25  Tensile Strength,Mpa ≥  20  500% Stress at Definite Elongation,Mpa  1~5  Elongation at Failure,%≥  800  Volatile matter,%≤  1.5  Ash,%≤  1.5",
        "packing": "In 25kg kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used to manufacture belts, timing belts, multi-coupling belts and so on.  "
    },
    {
        "name": "Chloroprene Rubber DCR 213  ",
        "cas_no": " 9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A xanthogen-modified copolymer with excellent stability, crystallizing and cold resistance. Has excellent anti-crystallization   properties.   Mainly   used   for   dust   cover,   bridge   damping   pads, sealing strips and soon. It’s similar to Do Pont’s Neoprene type WRT and Denka’s S-40.  ",
        "typical_properties": "Properties  Specification  Mooney viscosity (ML)  DCR 2131  DCR 2132  30~45  46~55  Mooney burning,Mst5,Min ≥  14  Tensile Strength,Mpa ≥  12  500% Stress at Definite Elongation,Mpa  1~5  Elongation at Failure,%≥  700  Volatile matter,%≤  1.5  Ash,%≤  1.5",
        "packing": "In 25kg kraft paper bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in low-temperature products, anti-corrosive liners, such as vehicle sealing parts, rotating protective covers, hold-in belts, rubber fittings in recorders, vibration absorber for bridges etc."
    },
    {
        "name": "Ethylene Thiourea",
        "cas_no": " 96-45-7",
        "cins_no": "   202-506-9",
        "molecular_formula": "C3H6N2S",
        "discription": "Rubber accelerator ETU is an ultra-accelerator for polychloroprene rubber. It is also used in latex as a primary accelerator.   It is active even at low temperatures.   ETU can be used without zinc oxide for transportation articles.   It is an antioxidant in adhesive systems.  ",
        "typical_properties": "White powder. Little bitter. Density is 1.42-1.43. Soluble in water，alcohol, ethylene glycol and pyridine, do not dissolve ether, benzene, chloroform and petroleum ether.   No pollution to final products. Stabilization storage  Item  Powder  Oil-filled Powder  Granule Appearance  White Initial M.P. ℃≥  193.0  193.0  193.0 Loss on Drying %≤  0.40  0.40  0.40 Ash %≤  0.30  0.30  0.30 Residues (150μm) %≤  0.10  0.10  -- Residues (63μm) %≤  0.50  0.50  -- Oil Content%  --  1.0-2.0  -- Hardness   N  --  --  1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "The product can be used to chloroprene rubber, Epichlorohydrin rubber, chlorinated polyethylene, etc., are particularly suited to non-curing system of the chlorine-butylamine Hopewell accelerator. Can often 100-500 ℃, with the right selection system can be the best rapid curing, and the whole parade security. Its products vulcanized high tensile strength, permanent deformation small for W (54-1 type polychloroprene), a non-curing system into effect significantly. It usually with zinc oxide and magnesium oxide together with the use, mainly for industrial products, and coating lines, shoes and other clothing chloroprene rubber products.  "
    },
    {
        "name": " Fumed silica",
        "cas_no": " 112945-52-5",
        "cins_no": " 231-545-4",
        "molecular_formula": " O2Si",
        "discription": "Fumed silica is composed of submicron-sized spheres, which are 40-60% fused into short chains, very highly branched, 0.1-0.2 microns long. The spheres are quite uniform in size for a given product, but the chain lengths are quite variable, 10 to 30 units in length. The surface area, which varies with the particle size, gives a good approximation of the sphere diameter. The smaller the particles, the larger the estimated surface area.   ",
        "typical_properties": "White, non-toxic, tasteless, odorless, non-polluting non-metallic oxide. Small particle size, large specific surface area, high surface activity.  Appearance  White powder  Whiteness  98 min  SiO2 content(%)  99.99 min  pH value  3.5-4.5  Average particle value um  14 nm  Bulk density g/L  40-50  Heating loss (105 for 2h,%)  0.5-1.0  Ignition loss (1,000 for 2h,%)  1.0-1.5  BET specific surface area m2/g  200±25  Whiteness  98 min",
        "packing": "In 10/20 kgs net plastic bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Paint and coating, unsaturated polyester resins, laminating resins and gel coat, HTV and RTV-2K silicon rubber, adhesive and fluid sealant, printing ink, cable rubber, plant protection, food and cosmetics, reinforce silicon rubber, improve the quality of the powder, and improve the liquidity and anti-blocking characteristic.  "
    },
    {
        "name": "  Gum Rosin",
        "cas_no": "8050-09-07",
        "cins_no": "232-475-7",
        "molecular_formula": "C19H29COOH",
        "discription": "Gum rosin is the transparent light yellow or transparent yellow solid, it's derived from pine trees and some other plants, primarily conifers. It is produced by heating fresh liquid resin, which causes the volatile terpene components to evaporate. Rosin is brittle at room temperature but melts at relatively low temperatures, such as those achieved on a stove. Its primary chemical components are resin acids, especially abietic acid.. It is a kind of natural resin, mainly composed of various kinds of resin acids; it can be dissolved easily in many organic solvents, and has special chemical activity.   ",
        "typical_properties": "Transparent light yellow or transparent yellow solid, soluble in alcohol, benzene, ether. Insoluble in water.  ",
        "packing": "In 225kgs galvanized iron drum  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is an important raw material for the production of paper, coatings, inks, rubber, soaps, electronic industrial products, food grade ester gum, rosin ester resins etc.  "
    },
    {
        "name": "C9 Hydrocarbon Resin",
        "cas_no": "64742-16-1",
        "cins_no": "265-116-8",
        "molecular_formula": "",
        "discription": "Light color C9 petroleum resin,also known as light color C9 Hydrocarbon Resin,is a petroleum by-product of ethylene made by C9 fraction which is produced by pre-treatment, polymerization and distillation processes. It is not a high polymer but a low polymer molecular weight between 300-3000. It has the characteristics of low acid value, good miscibility, water,ethanol and chemical resistance, the chemical stability against acid, the good adjustment of viscosity and thermal stability. Generally, 9 petroleum resin is not used alone, but as promoters, regulators, modifiers used with other resin. It is mainly used in coatings, rubber additives, paper additives, inks, adhesives and other fields, and has a large market demand.  ",
        "typical_properties": "Light yellow to light brown granules, transparent and shiny, soluble in acetone, methyl ethyl ketone, cyclohexane, ethylene dichloride, ethyl acetate, toluene, gasoline, etc. Insoluble in ethanol and water. Items  Light color C9 hydrocarbon resin  Softening point( R & B) ℃  100  110  120  130  140  Gardner Color No. series (Resin: toluene =1:1)   4 - 7 #   4 - 7 #   4 - 7 #   4 - 7 #   4 - 7 #  Acid Value (mgKOH/g )  0.5 max ",
        "packing": "In 25 kgs kraft paper bags, 500 kgs or 1,000 kgs jumbo bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1.Paints Industry:  In paint industry mainly use the high softening point of C9 petroleum resin which can increase the gloss of paint and improve the adhesion, the hardness and the resistance ability of ac id and alkali.    2.Tire and Rubber Industry:  In tire and rubber industry, low softening point of C9 petroleum resin is mainly used which has a good miscibility with natural rubber particles, and little affect on rubber vulcanization. Adding in rubber and tires, petroleum resin can increase the adhesion and the reinforcement and can also play as softener.    3. Adhesives Industry:  C9 petroleum resin having good adhesion, added in the process of producing adhesives and pressure-sensitive adhesives can improve the adhesive bond strength, acid resistance, alkali resistance and water resistance, and also can reduce production costs effectively.    4.Ink Industry:  In ink industry mainly use the high softening point of C9 petroleum resin which can reach the effect of show color, quick-drying and brightening and improve printing performance, etc.    5.Others petroleum resin having certain characteristic of unsaturated, can be used as paper glue, plastic modifier etc"
    },
    {
        "name": "Phenolic Resin 2402  ",
        "cas_no": "115-77-5",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Phenolic resin 2402 is a 100% fat-soluble phenolic resin. It is used as a rubber vulcanizer for butyl rubber, natural rubber, styrene-butadiene rubber (SBR), silicone, and is particularly suitable for vulcanizing butyl rubber.Tertiary butyl phenol and methanal polycondensation under the action of alkaline medium, to get oily pure phenolic resin. Soluble in butyl,acetate, xylene, vegetable oil.Phenolic Resin 2402 is mainly used in adhesive foe bonding leather,rubber-to-rubber,or rubber-to-metal surfaces.It is ideally suited for this because it has very good binding qualities and has a particular tackiness for the surface of leather and rubber.  ",
        "typical_properties": "Appearance  Light yellow to amber white transparent lumpish solid  Softening Point(R&B),℃  85~120  Methylol Content,%  9~15  Lipid Solubility(1:2Tung oil,240℃）  Total Soluble  Free Phenol,%,max  1  Water Content,%  1  Ash Content,wt.%,max  0.3",
        "packing": "In 25kgs karft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. This product is a rubber vulcanizer for butyl rubber, natural rubber, styrene-butadiene rubber, silicone rubber, etc. It is especially used for the vulcanization of butyl rubber to improve the heat resistance of butyl rubber. It has excellent properties such as small deformation, good heat resistance, high tensile strength, and low elongation. It is used to manufacture heat-resistant butyl rubber products. The reference dosage is 5-10 parts.    2. In the production of chloroprene rubber adhesives, this resin is compatible with chloroprene rubber. The formulated chloroprene rubber adhesive can increase the heat resistance temperature of the adhesive and increase adhesion.    3. In the coating industry, it can be used to produce external magnetic paint, floor paint, ship paint, anti-rust paint, water-based ink and thin-layer anti-rust oil products. The nitro paint made by heating with drying oil has good gloss in the paint film, and has the characteristics of water resistance, weather resistance, UV resistance, chemical corrosion resistance and electrical insulation.    4. It can be used as a vulcanizer, reinforcing agent, and tackifier in the production of polyester insulating tape, oil pipe anticorrosive tape, etc. to improve product performance and life. This product also has broad development prospects in other industrial products.  2402 resin is especially effective when mixed with terpene resin."
    },
    {
        "name": "Polyvinyl Alcohol  （PVA）",
        "cas_no": "9002-89-5",
        "cins_no": " 209-183-3",
        "molecular_formula": "C2H4O",
        "discription": "Polyvinyl alcohol (PVOH, PVA, or PVAl) is a water-soluble synthetic polymer. It has the idealized formula [CH2CH(OH)]n, with properties between those of plastics and rubber. It is used in papermaking, textile warp sizing, as a thickener and emulsion stabilizer in polyvinyl acetate (PVAc) adhesive formulations, in a variety of coatings, and 3D printing. It is colourless (white) and odorless. It is commonly supplied as beads or as solutions in water.Without an externally added crosslinking agent, PVA solution can be gelled through repeated freezing-thawing, yielding highly strong, ultrapure, biocompatible hydrogels which have been used for a variety of applications such as vascular stents, cartilages, contact lenses, etc.   ",
        "typical_properties": "White flake, flocculent or powdery solid, odorless. Soluble in water (above 95°C), slightly soluble in dimethyl sulfoxide, insoluble in gasoline, kerosene, vegetable oil, benzene, toluene, ethylene dichloride, carbon tetrachloride, acetone, ethyl acetate, methanol, ethylene glycol, etc.  Appearance  White granular  Purity(%)  93.5 min  Viscosity ( mpa.s )  44.0-56.0  Alcoholysis Degree [%(mol/mol)]  86.0 - 89.0  Moisture(%)  5.0 max  Ash(%)  0.5 max  PH Value  5.0-7.0",
        "packing": "In 25 kgs kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Poly Vinyl Alcohol is a tough, whitish polymer that can be formed into strong films, tubes, and fibers that are highly resistant to hydrocarbon solvents. Mainly used in the textile industry, as the raw materials of warp pulp, Fabric finishing agent, Vinylon Fiber; Interior and exterior wall paint of the building, adhesives; Chemical industry use it as a polymerization emulsifier, Dispersant and polyvinyl formal, Acetal, Butyrate Aldehyde Resin; Paper industry use it as a paper binder; Agriculture use it as soil improvers, pesticide adhesion synergist and polyvinyl alcohol film; It can also be used for daily cosmetics and high-frequency quenching agent and so on.  "
    },
    {
        "name": "Chloroprene Rubber SN232",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Chloroprene rubber SN232 is a general purpose, it is obtained by mercaptan modified and choroprene monomer by emulsion polymerization with medium rate of crystallization, for using a Nairit recipe and process technology. It can be seen as an equivalent to Dupont W of the Unite States.    SN232, which   has good   properties of physical   mechanics   and   plastication, compared with   CR232,   is   superior   in   processability,   can   be   mixed   without mastication, the surface of sheet is flat and smooth and non-stick to the mill rolls, is used in the form   of a blend with many type of chloroprene rubber, has very   lower    compression   set   and   excellent    elasticity,   has    the   same processability   as   Dupont   W   of   the   Unite   State.   It   exhibits   resistant   to   oil, chemical, sunlight, abrasion, as well as extension of the fine is not flammable and better storage stability, is widely used in general rubber products.",
        "typical_properties": " Item  Standard  Mooney viscosity ML 100℃  1   4  42~54  Mooney scorch MSt5,min ≥  12  Tensile strength elongation,Mpa ≥  13  Modulus at 500%,Mpa  2~5  Ultimate elongation,% ≥  700  Mass fraction of volatiles,wt.% ≤  0.8  Mass fraction of ash,wt.% ≤  1.0",
        "packing": "In 25kg kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Mainly used for producing the conveyor belts, extruded bars, a variety of hosetapes and adhesive, rubber seal, as well as wire and cable jackets, etc."
    },
    {
        "name": "Chloroprene Rubber SN238  ",
        "cas_no": " 9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Chlorprene rubber SN238 is a general purpose,it is obtained by mercaptan modified and Chloroprene monomer by emulsion polymerization with medium rate of crystallization,for using a Narit recipe and process technology.It can be seen as an equivalent to Dupont WHV-100 of the United States.    Chloroprene rubber SN 238 is ,which has the same properties as SN231 and SN 232 except for its higher Mooney viscosity. An outstanding characteristic of this grade has excellent cohesion,in the production,vulcanizate maintains its good physical properties when a large amount of fillers and oil are added.It has a medium rate of crystallization and good solubility,can regulate the adhesion tack to keep a time and improve heat resistance.It has the same processability as Dupont WHV-100 of the United States.  ",
        "typical_properties": "Item  Standard Mooney viscosity ML  90~110 Mooney scorch MSt5,min ≥  12 Tensile strength elongation,Mpa ≥  13 Modulus at 500%,Mpa  4~8 Ultimate elongation,% ≥  650 Brookfield solution viscosity (mpa.s,5% toluene solution at 25℃）  30-65 Mass fraction of volatiles,wt.% ≤  0.8 Mass fraction of ash,wt.% ≤  1.0",
        "packing": "In 25kg kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "SN238,which is mainly suitable for production goods of highly loading,is used in the form of a blend with the grades of adhesive to preparing cement.Production things of extruded bars,a variety of hoses,tapes,rubber seals,as well as hard goods and wire and cable jackets.  "
    },
    {
        "name": "Chloroprene Rubber SN242  ",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "SN-242 is a mercaptan modified chloroprene rubber with excellent adhesive strength and produced using a Nairit recipe  and process technology. SN-242 has a high crystallization rate and can be seen as an equivalent to the AD-20 grade  from DuPont.    SN-242 grade polychloroprene has a fast rate of crystallization, stronger cohesion, and good storage stability. Of the SN-24 series,this grade has a medium viscosity and has a much better solubility and uniformity than CR-244. SN-242 can be dissolved in tolueneor mixed solvents. Preparing adhesive cements by SN-242 is light in color and high bonding strength, quick good grips, easy handling,the adhesion layer to keep a long time. It exhibits the good resistant to ozone, weather, oil, chemical corrosion and fire. SN-242 canbe divided into SN-242A and SN-242B; SN-242A is closer to A-90 and can be used as applicable grade of preparing grafted adhesive;SN242B is closer to AD-20, mainly preparing decoration adhesive and so on.",
        "typical_properties": "Item  Standard  Broodfield solution viscosity(MPa.s,5% toluene solution at 25℃）  SN242A  SN242B  34~40  41~52  Mass fraction of volatiles,wt.% ≤  1.3  Mass fraction of ash,wt.% ≤  1.0",
        "packing": "In 25kg kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "SN242,which is a basic raw material of preparing adhesive cements,can be used alone or combination with other types,is the most typical grade of preparing adhesive.Adhesive is suitable for bonding of the shoe industry,rubber leather,wood,metal and construction materials."
    },
    {
        "name": "Terpene phenolic resin 803L  ",
        "cas_no": " 9003-74-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Terpene phenolic resin 803L is derived from rosin, resin from pine trees. Used as tackifier, It is applicable to various kinds of graft-modified neoprene, Neoprene, SBR rubber and other solvent adhesives. It is especially suitable for the bonding of PVC artificial leather and various shoe sole adhesives. It's can be applied to coatings, inks, printed circuits, plastic modification, rubber products, etc.  ",
        "typical_properties": "Good compatability with chloroprene. High softening point & high thermal stability. Can be react with metal oxide. Good Initial tacky & long Opening time. Light color & good transparency.  Appearance  Pale yellow flake Color Gardner  7 max Acid Value(MgKOH/g)  45~60 Softening Point(℃)  145~160",
        "packing": "In 25Kgs kraft paper bag  ",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Adhesive  1) hot melt adhesive: EVA hot melt adhesive, hot melt adhesive, wood adhesive, hot melt adhesive bookbinding bags etc.  2) pressure sensitive adhesives: medical pressure sensitive adhesive, hot melt  pressure sensitive adhesive, sanitary products, pressure sensitive adhesive, medical adhesive tape, pressure sensitive adhesive, etc.  3) Acrylate adhesive materials: acrylic resin adhesive, resin type adhesive, thermoplastic resin adhesive, etc.  4) adhesive adhesive: coated glue, glue paste box, stickers, slow dry glue;  5) glue adhesive: repair adhesive, sealant, sealant, shoe glue etc.;  6) other adhesives: high temperature adhesive tape, warning tape, electronic tape, special adhesive, etc.  2. Rubber adhesives, rubber resin adhesive, rubber tire repair agent, neoprene adhesive etc.  3. Plastic materials: plastic products, plastic pipe, special plastic, PET plastic, etc.  4. Industrial coatings: resin coatings, architectural coatings, decorative paint, wall paint, etc.  5. Oily ink: Carton ink, paper with ink, resin type ink, etc.  6. Other fine chemicals: cutting fluid, punching oil, wire cutting fluid, photosensitive resin materials, etc."
    }
]