[
    {
        "name": "Benzaldehyde",
        "cas_no": "100-52-7",
        "cins_no": "202-860-4",
        "molecular_formula": "C7H6O",
        "discription": "Benzaldehyde is the simplest representative of the aromatic aldehydes. It is a colorless liquid aldehyde with a characteristic almond odor. It is the first step in the synthesis for fragrances. It undergoes simultaneous oxidation and reduction with alcoholic potassium hydroxide, giving potassium benzoate and benzyl alcohol. It is converted to benzoin with alcoholic potassium cyanide, with anhydrous sodium acetate and acetic anhydride, giving cinnamic acid.  ",
        "typical_properties": "Colorless to yellow liquid with bitter almonds odor. Boiling point:179℃, Freezing point:-26℃. It is poorly soluble in water, but soluble in a variety of organic solvents like benzene, ethyl alcohol, ethylether and chlorofom. Benzaldehyde is flammable when near heat, open flame or oxidant.   Spec\u0001Tech grade\u0001Perfumery grade Color(Hazen)\u000150 max\u000150 max Purity(%)\u000199.0 min\u000199.9 min Acidity( as Benzoic Acid,%)\u00011.0 max\u00010.5 max Specific gravity(20℃,g/cm3)\u00011.044-1.049\u00011.044-1.049 Moisture(%)\u00010.1 max\u00010.1 max ",
        "packing": "In 200kg/drum, ISO tank, IBC drum.",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Benzaldehyde is a colorless liquid with a bitter almond-like aroma. It is an important raw material for the pharmaceutical, dye, fragrance and resin industries. It is mainly used to make lauric aldehyde, lauric acid, lauric green, etc. It can also be used as a solvent, plasticizer and low-temperature lubricant. In the flavor industry, it is mainly used to prepare edible flavors, and a small amount is used in daily chemical flavors and tobacco flavors. Benzaldehyde is an organic compound formed when the hydrogen of benzene is replaced by an aldehyde group. Benzaldehyde is the simplest and most commonly used aromatic aldehyde in industry. It is a colorless or light yellow liquid at room temperature. Benzaldehyde is the main component of bitter almond oil extract, and can also be extracted from apricots, cherries, laurel leaves, and peach pits. The compound also exists in kernels and nuts in the form of glycosides (amygdalin). It can be used as a raw material for organic synthesis to make cinnamaldehyde, cinnamic acid and its esters, and can also be used to prepare a mixture of benzyl alcohol and benzoic acid and herbicides; it is also an intermediate for the synthesis of chloramphenicol, DL-phenylglycine, and 2-nitrobenzaldehyde."
    },
    {
        "name": "Benzoic acid",
        "cas_no": "65-85-0",
        "cins_no": "200-618-2",
        "molecular_formula": "C7H6O2",
        "discription": "Benzoic acid is an aromatic acid organic compound and the simplest aromatic acid. Benzoic acid is widely present in nature in the form of free acid, ester or its derivatives. It is mainly used to prepare sodium benzoate preservatives, and is used in the synthesis of drugs and dyes. It is also used in the preparation of plasticizers, mordants, fungicides and fragrances.",
        "typical_properties": "White crystalline powder, soluble in ethanol, slightly soluble in water, has a benzoic smell, and can sublime when heated. Tech grade  Food/Pharm grade  Appearance  White flakes  Ir/retention time/benzoate  Positive  Purity(%)  99 min ( 99.8 min )  Assay  99.5-100.5  Phthalic acid(%)  0.5 max  Moisture  0.7 max  Chloride(%)  0.3 max  Residue on ignition  0.05 max  Ash(%)  0.1 max  Heavy metals( as Pb,ppm )  2 max  Melting point(℃)  121-123  Readily carbonizate substance  Passed    Readily oxidizable substance(ml)  0.5 max    Congealing temperature(℃)  121-123",
        "packing": "In 25kgs/bag,500kg/bag,1000kg/bag, polyethylene plastic bag, coating bag, super sack  Tech grade  Food/Pharm grade  Appearance  White flakes  Ir/retention time/benzoate  Positive  Purity(%)  99 min ( 99.8 min )  Assay  99.5-100.5  Phthalic acid(%)  0.5 max  Moisture  0.7 max  Chloride(%)  0.3 max  Residue on ignition  0.05 max  Ash(%)  0.1 max  Heavy metals( as Pb,ppm )  2 max  Melting point(℃)  121-123  Readily carbonizate substance  Passed    Readily oxidizable substance(ml)  0.5 max    Congealing temperature(℃)  121-123",
        "food_idustry": "Used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco, feed, etc. Benzoic acid has the effect of sterilization and inhibition of bacterial growth. The change of pH value has a great influence on its effect. The effect is best when the pH value is 2.5-4.5, and it is significantly reduced in alkaline medium. It is widely used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco, and feed.",
        "pharmaceutical_industry": null,
        "other_industries": "It can improve the gloss, viscosity, strength and chemical corrosion resistance of various alkyd resin coatings, terminate the chain growth of alkyd resins, and change the crystallinity of products. 3. It can be used as a carrier of dyes when hydrophobic polyester fibers are colored. 4.It is used as a raw material for synthesizing benzoyl chloride and various plasticizers."
    },
    {
        "name": "Benzyl alcohol",
        "cas_no": "100-51-6",
        "cins_no": "202-859-9",
        "molecular_formula": "C7H8O",
        "discription": "Benzyl alcohol used as a general solvent for inks, paints, lacquers, and epoxy resin coatings. It is also a precursor to a variety of esters, used in the soap, perfume, and flavor industries. It is often added to intravenous medication solutions as a preservative. It is also used as a photographic developer; as a general solvent for inks, paints, lacquers, and epoxy resin coatings; a precursor to a variety of esters, used in the soap, perfume, and flavor industries.",
        "typical_properties": "Transparent liquid with slight fragrance smell. If long time exposure, it will be oxidized into benzaldehyde and benzyl acid, so it smells like the bitter almond. Boiling point: 205.4℃, Freezing point:-15.3℃. It is soluble in water with ratio 1:30 and easily soluble in alcohol, ether and chloroform.",
        "packing": "In 210kg/iron drum, IBC drum, ISO tank, Flexitank",
        "food_idustry": "Benzyl alcohol can also be used as a food additive to improve the taste of food and make it taste better, thereby promoting appetite and enhancing appetite to a certain extent.",
        "pharmaceutical_industry": "Benzyl alcohol can also be used in medicine, cosmetics, pesticides, etc., and can play a role in decontamination.",
        "other_industries": "4. Dyes  Benzyl alcohol can also be used to prepare dyes, which can make the color of dyes more uniform, and can also play an  antibacterial role, which can play an antibacterial role to a certain extent.    5. Industry  Benzyl alcohol can also be used in industry, which can make paints, pigments, preservatives and other substances widely used."
    },
    {
        "name": "Benzyl benzoate",
        "cas_no": "120-51-4",
        "cins_no": "204-402-9",
        "molecular_formula": "C14H12O2",
        "discription": "Benzyl benzoate is used in flavor spice, pharmacy, and plasticizer. In textile auxiliaries, Benzyl Benzoate is used as lead agent, leveler and repair agent. With constant development of textile industry in worldwide, especially in dyeing, the difficulty of coloring and uniformity, becomes the main problem, while Benzyl Benzoate has a good plasticizer performance, it can treat and draw away the fiber to facilitate dye, because Benzyl Benzoate is a good solvent itself to dissolve easily and disperse dye evenly. Relative products of same property to Benzyl Benzoate, are Methylnaphthalene, Dimethylnaphthalene, Methyl Salicylate, etc. Among of them, Benzyl Benzoate is more precise, thanks to its better overall-performance.",
        "typical_properties": "Colorless or light yellow transparent liquid; Boiling point: 324℃，Freezing point: 18℃. It's insoluble in water, but soluble in a variety of organic solvents like ethyl alcohol, ethyl ether and oils.                      Spec        Tech grade        Perfumery grade Appearance        Light-yellow transparent liquid        Colorless Fragrance        -        Very light scent of florae Purity(%)        99.0 min        99.8 min Acidity(mg/g)        0.2 max        0.2 max Specific gravity(20℃)        1.118-1.122        1.118-1.122 Refractive index(ND 20℃)        1.568-1.570        1.568-1.570 Ash(%)        0.1 max        0.1 max Freezing point(℃)        17 min        17 min Water(%)        0.2 max        0.2 max ",
        "packing": "In 220kgs/drum, 225kgs/drum,1100kgs/IBC drum, plastic drum, iron drum  ",
        "food_idustry": null,
        "pharmaceutical_industry": "Benzyl benzoate is used as a solvent and carrier for drugs in the pharmaceutical field. It can help drugs dissolve, stabilize and deliver, and is commonly found in oral drugs, injections and topical ointments.",
        "other_industries": "1. Dye and pigment industry: Benzyl benzoate can be used as a solvent, diluent and plasticizer for dyes and pigments. It can provide  good solubility and stability, helping dyes and pigments to be evenly dispersed in products such as coatings, inks and plastics.    2. Flavor and fragrance industry: Benzyl benzoate has a fragrant and mild fragrance, so it is widely used in fragrance products such  as perfumes, soaps, shampoos and cosmetics to add fragrance to them.    3. Plastic industry: Benzyl benzoate is a commonly used plasticizer that can be used in the production process of polyvinyl chloride  (PVC) and other plastics to improve the flexibility, plasticity and durability of plastics."
    },
    {
        "name": "Benzyl chloride",
        "cas_no": "100-44-7",
        "cins_no": "202-853-6",
        "molecular_formula": "C7H7Cl",
        "discription": "Benzyl chloride is widely used as an intermediate for manufacturing organic compounds including benzyl alcohol, Benzyl Cyanide and other benzyl compounds. It is used in fuel as a gum inhibitor.Its oxidation reaction with an alkali produces Benzaldehyde, alpha-Chlorinated Toluenes, used in the end applications of perfumery, dyes, pharmaceuticals, synthetic resins, photographic chemicals, warfare chemicals, Penicillins, quaternary ammonium compounds, plasticizer and esters.  ",
        "typical_properties": "Clear liquid with unpleasant pungent smell.Boiling point:179.6℃, Freezing point:-39.2℃. It is not soluble in water, but soluble in benzene, ethanol, ether, choloroform and other organic solvents. Benzyl Chloride is flammable when near heat, open flame or oxidant.  Spec\u0001Qualified grade\u0001Superior grade Color(Hazen)\u000130 max\u000120 max Purity(%)\u000199.0 min\u000199.5 min Water(%)\u00010.03 max\u00010.03 max Benzylidene Chloride(%)\u0001-\u00010.25 max Toluene(%)\u0001-\u00010.05 max Chlorotoluene(%)\u0001-\u00010.15 max Acidity(as HCl%)\u00010.03 max\u00010.03 max",
        "packing": "In 200kgs plastic drum, ISO tank, IBC drum.  ",
        "food_idustry": null,
        "pharmaceutical_industry": "Benzyl chloride is an important chemical and pharmaceutical intermediate, used as a dye intermediate and in the synthesis of tannins, spices, and medicines.  In the pharmaceutical and pesticide industries, benzyl chloride can be used to synthesize benzyl nitrile, phenylacetic acid, etc.",
        "other_industries": null
    },
    {
        "name": "Methyl benzoate",
        "cas_no": "93-58-3",
        "cins_no": "202-259-7",
        "molecular_formula": "C8H8O2",
        "discription": "Methyl benzoate is an organic compound belonging to the ester class, which is used to prepare flavors and artificial essential oils, and is also used as an organic solvent and pesticide to attract insects.  Methyl benzoate can be used as a food additive. It can not only be used to prepare flavors such as pineapple, strawberry, and cherry, but can also be used as a raw material and widely used in organic synthesis and as a solvent.  ",
        "typical_properties": "Colorless oily liquid with a fruity aroma, soluble in methanol, ether, etc., but insoluble in water and glycerin.  Appearance\u0001 Colorless oily liquid with fruity aroma  Purity(%)  99 min  Water(%)  0.1 max  Acidity（as NaOH,mg/g）\u0001 1.0 max",
        "packing": "In 200kgs/drum  ",
        "food_idustry": "1. Used as a spice, with a strong aroma of wintergreen oil and cananga oil, used to prepare artificial ylang-ylang oil and moonflower oil for soap and cosmetics.  2. Edible flavors, used to prepare strawberry, pineapple, cherry, rum and other flavors. 4. Used in baked foods, frozen dairy products, and puddings.  5. Used in the spice industry and as a solvent.",
        "pharmaceutical_industry": null,
        "other_industries": "Used to prepare rose-type, geranium-type and other flavors, and also used as a solvent for cellulose esters, cellulose ethers, resins, rubber, etc."
    },
    {
        "name": " 4-Tert-Butybenzoic acid",
        "cas_no": " 98-73-7",
        "cins_no": " 202-696-3",
        "molecular_formula": "C11H14O2",
        "discription": "4-Tert-butylbenzoic acid is is an important organic synthesis intermediate, used in polypropylene nucleating agent, PVC heat stabilizer, additives for metal processing cutting and lubricating oil, antioxidants, alkyd resin modifiers, flux and dyes, etc. Among them, polyvinyl chloride is divided into soft and hard, and its stabilizers are divided into powder and liquid. PTBBA is mainly used for barium-zinc and calcium-zinc liquid stabilizers suitable for soft polyvinyl chloride, and can also be used for barium-cadmium-zinc stabilizers. The performance is far better than benzoic acid, with good thermal stability, transparency and weathering resistance, etc., suitable for advanced stabilizers (or polyvinyl chloride) and other products.  ",
        "typical_properties": "Colorless needle-shaped crystals or crystalline powder. Melting point 164-166℃, relative density 1.142 (20/4℃). Soluble in alcohol and benzene, insoluble in water. This product has moderate toxicity.   Appearance        White crystalline powder Assay(%)        99 min Ash(%)        0.01max Moisture(%)        0.1 max Acidity(mg KOH/g)        312.0-315.0 Melting point(℃)        164.0-166.0 Fe(ppm)        3 max Color(Hazen)        20 max",
        "packing": "In 25kgs/bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "1. Used as an improver in the production of alkyd resins  2. Used as a cutting oil and lubricant additive;  3. Used as a polypropylene nucleating agent;  4. Its barium salt, sodium salt, zinc salt, etc. can be used as a stabilizer for polyvinyl chloride;  5. Used as a food preservative;  6. A regulator for polyester polymerization, etc."
    },
    {
        "name": "p-Toluic Acid",
        "cas_no": "99-94-5",
        "cins_no": " 202-803-3",
        "molecular_formula": "C8H8O2 ",
        "discription": "p-Toluic Acid is used as an intermediate for polymer stabilizers, pesticides, light sensitive compounds, animal feed supplements and other organic chemicals (pharmaceuticals, pigments and dyestuff). They are also used as intermediates for the manufacture of a variety of target compounds. The almost infinite esters provide a wide range of viscosity, specific gravity, vapor pressure, and other physical and chemical properties for the proper application selections.  ",
        "typical_properties": "White or light yellow crystalline powder. Melting point 179-182°C. Boiling point 274-275°C. Soluble in methanol and ether, insoluble in hot water, can evaporate with water vapor; oxidized to phthalic acid.   Appearance\u0001 White to off-white crystalline powder  Assay(%)  99 min  Ash(%)  0.05 max  Moisture(%)  0.2 max  Melting point(°C)  178 - 182",
        "packing": "In 25kgs/bag, 25kgs/drum  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Mainly used in the manufacture of hemostatic aromatic acid, p-methyl nitrile, p-toluoyl chloride, photosensitive materials, etc. It is used as an intermediate in organic synthesis, in the preparation of fungicide phosphamide in the pesticide industry, and can also be used in spices and film.  "
    },
    {
        "name": "   Potassium benzoate",
        "cas_no": "582-25-2",
        "cins_no": "209-481-3",
        "molecular_formula": "C7H5KO2",
        "discription": "Potassium Benzoate is an alternative to sodium benzoate. Potassium Benzoate replaces Sodium Benzoate where low sodium content is required. A preservative is an additive for foods, pharmaceuticals, personal care products, cosmetics and other industrial products to reduce spoilage that air, fungi, bacteria, or yeast can cause. Members of common preservative for foods, pharmaceuticals, personal care products and cosmetics. Mainly used in fruit juice, carbonated drinks, margarine, artificial cream and wine.  ",
        "typical_properties": "White granules, flakes or crystalline powder. Odorless, melting point 121.5-123.5℃, easily soluble in water, soluble in ethanol. Appearance\u0001 White crystalline powder  Assay(%)  99-100.5  Alkalinity（as KOH,%）  0.06 max  Moisture(%)  1.5 max  Organic compounds(%)  0.05 max  Heavy metals(as Pb,ppm)  10 max  As(ppm)\u0001 3 max",
        "packing": "In 25kgs/bag",
        "food_idustry": " Food preservative; antimicrobial agent. Mainly used in margarine and wine.  ",
        "pharmaceutical_industry": null,
        "other_industries": "2. Analytical reagent. 3. Can be used as a pyrotechnic material whistle agent."
    },
    {
        "name": " Sodium benzoate",
        "cas_no": "532-32-1",
        "cins_no": "   208-534-8",
        "molecular_formula": "C7H5NaO2",
        "discription": "Sodium Benzoate is an important acid food preservative. It is naturally in cranberries, prunes, cinnamon, cloves, can be used for frozen fish sticks, fish fillets, fish paste products, but not for meat products.When used, it is converted into an effective form of Benzoic Acid. In addition, it can also be used as a preservative for feed. Also used in the pharmaceutical industry, a mordant in the dye industry, a plasticizer in the plastic industry, and also as an intermediate in organic synthesis such as spices, as Co-solvent for serum bilirubin test, Fungicide, Preservative, Dye intermediates, Polymer additives, etc.  ",
        "typical_properties": "White crystalline (powder/ granular/column), easily soluble in water, the aqueous solution is weakly alkaline, pH 8, slightly soluble in ethanol.  Appearance\u0001 White power/granular/column  Content(As dried basis,%)  99-100.5  Loss on drying(%)  1.5 max  Acidity or alkalinity  Pass test  Heavy metals( As Pb,ppm)  10 max  Ionised chlorine(ppm)  200 max  Total chlorine(ppm)  300 max  Transparancy and colour  In conformity the regulations",
        "packing": "In 25kgs/bag,500kg/bag,1000kg/bag, PP open bag with PE inner, super sack  ",
        "food_idustry": null,
        "pharmaceutical_industry": "Sodium benzoate can also be used to make various drugs to treat arthritis, abscesses, bronchitis, skin diseases, etc.",
        "other_industries": "Sodium benzoate has the effect of sterilization and inhibiting bacterial growth. The change of pH value has a great influence on its effect. The effect is best when the pH value is 2.5-4.5, and it is significantly reduced in alkaline medium. It is widely used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco leaves, and feed.    2.Sodium benzoate has a good effect on rust and corrosion prevention in automobile cooling systems. It can also be used in packaging pulp, latex coatings, paints, cutting oils and machines to prevent metal corrosion."
    }
]