[
    {
    "name": "Hydroxypropyl Methyl Cellulose - HPMC",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "Hydroxypropyl methyl cellulose (HPMC) is a non-ionic water-soluble cellulose ether made from refined cotton, which is a widely distributed natural polymer material. The refined cotton is treated with liquid caustic soda to produce an alkaline cellulose. During the etherification stage, the hydroxyl groups of cellulose are replaced by substituents such as methyl and hydroxypropyl groups, rendering the cellulose ether water-soluble. It is described as almost odorless, tasteless, and non-toxic.",
    "typical_properties": "Appearance: White or slight off-white granular powder, odorless. Methoxy content: 19-33%. Hydroxypropoxy content: 7-12%. Viscosity: 400-200000cps (measured in 2% aqueous solution at 20°C by NDJ-1 viscometer). Moisture content: ≤5%. Ash content: ≤5%. pH Value: 5-8. Degree of Fineness: >99. Water-insoluble: <0.5. Key characteristics include: water retention, thickening ability (dissolves in hot or cold water to form a transparent, high-viscosity solution), adhesive ability, anti-slip ability, easy construction via extended open time, and surface activity (acts as a protective colloid, emulsion stabilizer, film-forming agent, and dispersant).",
    "packing": "Polyethylene (PE) film bag enclosed in composite film bag waterproof. 25kg/bag. Loading: 24 tons (960 bags) in 1*20' FCL, 25 tons (1000 bags) in 1*40' HQ.",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Widely used in construction materials such as: Masonry Mortar, Dry Mix Mortar, Wall Putty, Repair Mortar, Self-leveling compounds, Tile Grout, Tile Adhesive, Skim Coat, Gypsum Base. Other applications include their use in Tile Cement/Bond Coat, Cement Mortar, Brick Mortar, Cement Based Plaster Render, Water Proof Mortar, Gypsum Render, and EIFS (Exterior Insulation and Finish Systems)."
    },
    {
    "name": "Hydroxyethyl Methyl Cellulose - MHEC/HEMC",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "Hydroxyethyl Methyl cellulose (MHEC) is a non-ionic cellulose ether made from refined cotton after alkalization treatment through a series of reactions. It can be dissolved in cold and hot water to form a clear viscous solution. MHEC exhibits thermal gelation: when the product aqueous solution is heated to a certain temperature, it becomes opaque, gels, and forms a precipitate; however, during continuous cooling, it returns to the original solution state. It has surface activity and can be used as a colloidal protectant, emulsifier, and dispersant. It also possesses good operability, hydrophilicity, and high viscosity in its aqueous solution, making it an efficient water retention agent.",
    "typical_properties": "Appearance: White or yellowish powder. Viscosity: 50000-200000 cps. Moisture Content %: 5.0MAX. Ash Content %: 5MAX. Particle size: 99% pass 80 mesh. PH (1% Solution): 5.0-8.0. Characteristics: Thermal gelation, Surface activity (colloidal protectant, emulsifier, dispersant), Good operability, Thickener, Film forming agent, Adhesive, Lubricant, Suspension aid, Protective colloid, Emulsifier, Efficient water retention agent.",
    "packing": "Polyethylene (PE) film bag enclosed in composite film bag waterproof. 25kg/bag. Loading: 24 tons (960 bags) in 1*20' FCL, 25 tons (1000 bags) in 1*40' HQ.",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Widely used in construction materials. It is used as a thickening agent, stabilizer, emulsifier, film coat, and suspension aid. Specific applications include: Dry Mortar, Tile Adhesive, Joint Filler, Gypsum Plaster, ETICS, Paint."
    },
    {
    "name": "Hydroxy Ethyl Cellulose - HEC",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "HEC Hydroxyethyl cellulose is an odorless, tasteless, non-toxic, white or light yellow powder. It can dissolve in cold or hot water and forms a transparent viscous solution without precipitation even at high temperatures or boiling, exhibiting a wide range of solubility and viscosity and a non-thermal gel type. It is non-ionic and can coexist with a wide range of other water-soluble polymers, surfactants, and salts, making it an excellent colloidal thickener for solutions with high electrolyte concentrations. Its water retention is twice higher than methyl cellulose, and it offers better flow regulation. The adhesive is stable, anti-mildew, improves paint's opening effect, and provides better leveling performance during construction. The products are mainly used as rheology modifiers, thickeners, water retention agents, suspending agents, binders, stabilizers, and protective colloids.",
    "typical_properties": "Appearance: White or yellowish powder. Viscosity: 4000-100000mpa.s. Moisture Content %: 7. Ash Content %: 5. Particle size: 99% pass 80 mesh. PH (1% Solution): 6.0-8.5. Can be dissolved in hot or cold water. Non-ionic. Excellent colloidal thickener. Higher water retention than methyl cellulose. Better flow regulation. Stable and anti-mildew adhesive.",
    "packing": "Polyethylene (PE) film bag enclosed in composite film bag waterproof. 25kg/bag. Loading: 24 tons (960 bags) in 1*20' FCL, 25 tons (1000 bags) in 1*40' HQ.",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Latex Paint, Putty Powder, Detergent, Stone Paint, Coating, Printing Ink."
    },
    {
    "name": "Redispersible Polymer Powder - RDP/VAE",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "Re-dispersible polymer powder (RDP) is a water-soluble re-dispersible powder, made from ethylene/vinyl acetate copolymer spray-dried powder binder, with polyvinyl alcohol as the protective colloid. This powder can be quickly re-dispersed into an emulsion after contact with water, and has the same effect as the original emulsion, making it very widely used.",
    "typical_properties": "Appearance: White or off-white powder. Solid content (%): ≥99.0. Ash content (%): 12±2. Bulk density (g/l): 450 – 600. Average particle size (µm): ~80. PH value: 5~9. MFFT (Minimum film-forming temperature) (°C): 0 ~ -5. Characteristics include: High flexibility (improves flexibility and waterproofness of wall putty), High weather resistance (improves weatherability of mortar), High adhesion (improves tile adhesive property after water resistance), Deformability (improves workability), Great durability/abrasion resistance (improves building life).",
    "packing": "Polyethylene (PE) film bag enclosed in composite film bag waterproof. 25kg/bag. Loading: 24 tons (960 bags) in 1*20' FCL, 25 tons (1000 bags) in 1*40' HQ.",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Tile adhesive, Interior putty, EIFS installation, Repair mortar, Construction grout, Gypsum plaster."
    },
    {
    "name": "Polyvinyl Alcohol - PVA",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "Polyvinyl alcohol (PVA) is an organic compound, appearing as a white flake, flocculent or powdered solid, and is odorless. It is soluble in water but insoluble in gasoline, kerosene, vegetable oil, benzene, toluene, dichloromethane, carbon tetrachloride, acetone, ethyl acetate, methanol, ethylene glycol, etc., and slightly soluble in dimethyl sulfoxide. PVA is an important chemical raw material. PVA powder can be dissolved in water. It softens when heated (thermal stability) and is almost unaffected by weak acids, weak bases, or organic solvents, exhibiting high oil resistance (chemical resistance). Due to high adhesion between PVA molecules, it easily forms a colorless, transparent film with good mechanical strength, a smooth non-sticky surface, and good solubility. This molecular film offers good light transmittance, high moisture transmittance, is non-electric, non-absorbent to dust, and has good printability.",
    "typical_properties": "Appearance: White or yellowish powder. Viscosity: 3-70. PH value: 4.5-6.5. Degree of alcoholysis: 85-90. Ash content(%): ≤0.5. Acid value: ≤3.0. Dry weight loss: ≤5.0. Solubility in water. Softens when heated. High oil resistance. Excellent film-forming properties: colorless, transparent film with good mechanical strength, smooth surface, good light transmittance, high moisture transmittance, non-electricity, non-absorbent dust, and good printability.",
    "packing": "Polyethylene (PE) film bag enclosed in composite film bag waterproof. 25kg/bag. Loading: 24 tons (960 bags) in 1*20' FCL, 25 tons (1000 bags) in 1*40' HQ.",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in the manufacture of polyvinyl acetals, gasoline-resistant pipes and vinylon synthetic fibers, fabric treatment agents, emulsifiers, paper coatings, adhesives, glues. Specific applications include: Tile Adhesive, Construction Coating, Textile, Paper-Making, Tile Joint Filler, Bonding Mortars."
    }
]