[
  {
    "name": "Ethylene Glycol (MEG)",
    "cas_no": "107-21-1",
    "cins_no": "",
    "molecular_formula": "C2H6O2",
    "discription": "Ethylene Glycol is an organic compound, a colorless, odorless, sweet-tasting, viscous liquid. It is primarily used as a raw material in the manufacture of polyester fibers and for antifreeze formulations.",
    "typical_properties": "Formula Weight: 62.07, Flash Point: 111°C, Boiling point: 197.5°C, Density (20°C): 1.11 g/cm³, Refractive Index (25°C): 1.431, Surface Tension (25°C): Not specified in column, Physical Properties: Transparent viscous liquid.",
    "packing": "215/220 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Limited direct pharmaceutical use due to toxicity if ingested. Can be found as a solvent in some external preparations or as an intermediate in synthesis. Propylene glycol is often preferred for safety.",
    "other_industries": "Antifreeze in cooling and heating systems, precursor to polyester resins and fibers (e.g., PET), hydraulic fluids, deicing fluid, heat transfer fluid, solvent."
  },
  {
    "name": "Diethylene Glycol (DEG)",
    "cas_no": "111-46-6",
    "cins_no": "",
    "molecular_formula": "C4H10O3",
    "discription": "Diethylene Glycol is an organic compound, a colorless, practically odorless, poisonous, and hygroscopic liquid with a sweetish taste. It is miscible with water, alcohol, ether, acetone, and ethylene glycol.",
    "typical_properties": "Formula Weight: 106.12, Flash Point: 143°C, Boiling point: 245°C, Density (20°C): 1.118 g/cm³, Refractive Index (25°C): 1.446, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless, odorless, transparent, sticky liquid with hygroscopic properties.",
    "packing": "220 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a solvent and plasticizer in some topical pharmaceutical formulations. Its use is restricted due to toxicity concerns (can cause fatal poisoning if ingested, even in small amounts). Often replaced by safer alternatives.",
    "other_industries": "Solvent for resins, dyes, oils, and nitrocellulose; humectant for tobacco; component of brake fluids, antifreeze, lubricants, and wallpaper strippers; intermediate for organic synthesis (e.g., polyester resins, polyurethanes, morpholine)."
  },
  {
    "name": "Triethylene Glycol (TEG)",
    "cas_no": "112-27-6",
    "cins_no": "",
    "molecular_formula": "C6H14O4",
    "discription": "Triethylene Glycol is a colorless, odorless, viscous liquid. It is used as a plasticizer for vinyl polymers as well as an air disinfectant and a liquid desiccant for natural gas.",
    "typical_properties": "Formula Weight: 150.17, Flash Point: 176.7°C, Boiling point: 285°C, Density (20°C): 1.1215 g/cm³, Refractive Index (25°C): 1.451, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless transparent or slightly yellow liquid.",
    "packing": "225 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a solvent, humectant, and plasticizer in certain pharmaceutical and cosmetic preparations. Its lower toxicity compared to DEG makes it more suitable for some applications. Used as an air sanitizer.",
    "other_industries": "Dehydrating agent for natural gas; solvent in inks and dyes; plasticizer for polymers; humectant; component of hydraulic fluids and brake fluids; air disinfectant."
  },
  {
    "name": "Glycofurol",
    "cas_no": "112-60-7",
    "cins_no": "",
    "molecular_formula": "C8H18O5",
    "discription": "The CAS 112-60-7 corresponds to Triethylene Glycol (TEG), but the listed properties (MF, FW, BP) differ significantly. True Glycofurol is often CAS 31692-85-0 or 9004-76-6, a derivative of tetrahydrofurfuryl alcohol PEG ether. This entry's data for 'Glycofurol' with CAS 112-60-7 suggests a mislabeling or data error. Glycofurol (pharmaceutical grade) is used as a solvent for parenteral formulations.",
    "typical_properties": "Formula Weight: 194.23, Flash Point: 182°C, Boiling point: 100°C (this BP is exceptionally low for the FW and likely an error), Density (20°C): 1.09 g/cm³, Refractive Index (25°C): 1.455, Surface Tension (25°C): Not specified in column, Physical Properties: Atransparent, colorless, andtastelessliquid.",
    "packing": "235 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "If referring to pharmaceutical grade Glycofurol (e.g., Glycofurol 75, CAS 31692-85-0), it is used as a non-aqueous solvent and co-solvent in parenteral (injectable) and oral drug formulations to enhance the solubility of poorly water-soluble drugs.",
    "other_industries": "If Glycofurol 75: solvent for some industrial applications requiring high solvency and low toxicity."
  },
  {
    "name": "2-Methoxyethanol (EM)",
    "cas_no": "109-86-4",
    "cins_no": "",
    "molecular_formula": "C3H8O2",
    "discription": "2-Methoxyethanol, also known as Methyl Cellosolve, is a glycol ether solvent. It is a colorless liquid with a mild ether-like odor. Its use is restricted due to reproductive toxicity.",
    "typical_properties": "Formula Weight: 76.094, Flash Point: 40°C, Boiling point: 124-125°C, Density (20°C): 0.97 g/cm³, Refractive Index (25°C): 1.402, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Historically used as a solvent in some pharmaceutical processes, but its use has been largely phased out or heavily restricted due to toxicity concerns (reproductive and developmental toxicant).",
    "other_industries": "Solvent for resins, lacquers, dyes, and inks; anti-icing additive in jet fuels; formerly in nail polish removers and quick-drying varnishes. Use is declining due to health concerns."
  },
  {
    "name": "2-(2-Methoxyethoxy)Ethanol (DEM)",
    "cas_no": "111-77-3",
    "cins_no": "",
    "molecular_formula": "C5H12O3",
    "discription": "2-(2-Methoxyethoxy)ethanol, also known as Diethylene Glycol Monomethyl Ether (DEGME) or Methyl Carbitol, is a colorless liquid solvent with a mild, pleasant odor. It has good solvency for various substances.",
    "typical_properties": "Formula Weight: 120.1, Flash Point: 91°C, Boiling point: 194°C, Density (20°C): 1.02 g/cm³, Refractive Index (25°C): 1.427, Surface Tension (25°C): Not specified in column, Physical Properties: A colorless liquid witha slightly aromatic odoranda slightly bitter taste.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a solvent in some pharmaceutical formulations and manufacturing processes. Also considered for restriction in some regions due to potential toxicity similar to other glycol ethers.",
    "other_industries": "Solvent for resins, dyes, oils, fats, waxes, and nitrocellulose; component of brake fluids; anti-icing additive for jet fuel; textile dyeing assistant; solvent in wood stains and printing inks."
  },
  {
    "name": "Triethylene Glycol Monomethyl Ether (TEM)",
    "cas_no": "112-35-6",
    "cins_no": "",
    "molecular_formula": "C7H16O4",
    "discription": "Triethylene Glycol Monomethyl Ether is a colorless, high-boiling liquid with a mild odor. It is used as a solvent and chemical intermediate.",
    "typical_properties": "Formula Weight: 164.19, Flash Point: 110°C, Boiling point: 248°C, Density (20°C): 1.026 g/cm³, Refractive Index (25°C): 1.439, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless, smelly, sticky liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "May be used as a solvent or intermediate in pharmaceutical applications requiring a high-boiling, polar solvent.",
    "other_industries": "Solvent for resins, dyes, and inks; component of hydraulic fluids and brake fluids; chemical intermediate for ester production; coalescing agent in coatings."
  },
  {
    "name": "2,5,8,11-Tetraoxatridecan-13-ol (MTEG)",
    "cas_no": "23783-42-8",
    "cins_no": "",
    "molecular_formula": "C9H20O5",
    "discription": "This compound is Triethylene Glycol Monoethyl Ether (as per CAS and structure) or sometimes referred to more generally as Methyl Tri (ethylene glycol) when MTEG refers to the methyl ether. Given the name and MF, it seems like Triethylene Glycol Monopropyl Ether or Methyl Tetraethylene Glycol could fit if the 'M' in MTEG meant Methyl. If MTEG is meant as Methyl Triethylene Glycol (Triethylene Glycol Monomethyl Ether) that is CAS 112-35-6. The CAS 23783-42-8 is for Triethylene Glycol Monoethyl Ether.",
    "typical_properties": "Formula Weight: 208.252, Flash Point: 113°C, Boiling point: 125°C (This BP seems too low for this FW; Triethylene Glycol Monoethyl Ether BP is ~256°C. This might be a typo or data for a different substance). Density (20°C): 1.045 g/cm³, Refractive Index (25°C): 1.444, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "If Triethylene Glycol Monoethyl Ether: Used as a solvent in specialized pharmaceutical formulations and synthesis.",
    "other_industries": "If Triethylene Glycol Monoethyl Ether: Solvent for coatings, inks, and cleaning agents; chemical intermediate."
  },
  {
    "name": "2-Ethoxyethanol (ECS)",
    "cas_no": "110-80-5",
    "cins_no": "",
    "molecular_formula": "C4H10O2",
    "discription": "2-Ethoxyethanol, also known as Ethyl Cellosolve, is a glycol ether solvent. It is a colorless liquid with a mild, sweet odor. Its use is highly restricted due to reproductive toxicity.",
    "typical_properties": "Formula Weight: 90.1, Flash Point: 42°C, Boiling point: 135°C, Density (20°C): 0.93 g/cm³, Refractive Index (25°C): 1.407, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "195 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Largely phased out or heavily restricted in pharmaceutical applications due to significant reproductive and developmental toxicity concerns.",
    "other_industries": "Formerly used as a solvent for lacquers, resins, dyes, and inks; deicing agent; chemical intermediate. Use significantly declined due to health hazards."
  },
  {
    "name": "2-(2-Ethoxyethoxy)ethanol (DE)",
    "cas_no": "111-90-0",
    "cins_no": "",
    "molecular_formula": "C6H14O3",
    "discription": "2-(2-Ethoxyethoxy)ethanol, also known as Diethylene Glycol Monoethyl Ether or Carbitol, is a colorless, hygroscopic liquid with a mild, pleasant odor. It is a versatile solvent.",
    "typical_properties": "Formula Weight: 134.1, Flash Point: 91°C, Boiling point: 198°C, Density (20°C): 0.99 g/cm³, Refractive Index (25°C): 1.4273, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "Limited use, mainly as a solvent for food-contact surface sanitizers (with restrictions).",
    "pharmaceutical_industry": "Used as a solvent and co-solvent in pharmaceutical formulations, especially topical and transdermal preparations, to enhance drug solubility and penetration. Its use may be reviewed due to glycol ether concerns.",
    "other_industries": "Solvent for resins, dyes, oils, fats, waxes, and nitrocellulose; component of lacquers, varnishes, enamels, and wood stains; textile printing and dyeing; brake fluids; industrial cleaners."
  },
  {
    "name": "2-Ethoxyethyl acetate (CAC)",
    "cas_no": "111-15-9",
    "cins_no": "",
    "molecular_formula": "C6H12O3",
    "discription": "2-Ethoxyethyl acetate, also known as Ethyl Cellosolve Acetate, is the acetate ester of 2-Ethoxyethanol. It is a colorless liquid solvent with a mild, fruity odor. Its use is restricted due to toxicity.",
    "typical_properties": "Formula Weight: 132.18, Flash Point: 43°C, Boiling point: 154°C, Density (20°C): 0.97 g/cm³, Refractive Index (25°C): 1.41, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Use in pharmaceutical applications is heavily restricted or phased out due to reproductive toxicity associated with its parent alcohol, 2-Ethoxyethanol.",
    "other_industries": "Formerly used as a solvent for nitrocellulose, cellulose acetate, resins, lacquers, and enamels; photographic films. Use significantly declined due to health concerns."
  },
  {
    "name": "Carbitol Acetate (DCAC)",
    "cas_no": "112-15-2",
    "cins_no": "",
    "molecular_formula": "C8H16O4",
    "discription": "Carbitol Acetate, also known as Diethylene Glycol Monoethyl Ether Acetate (DEGEEA), is a high-boiling, slow-evaporating solvent with excellent solvency characteristics.",
    "typical_properties": "Formula Weight: 176.21, Flash Point: 100°C, Boiling point: 218°C, Density (20°C): 1.011 g/cm³, Refractive Index (25°C): 1.4213, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "May be used as a specialty solvent in pharmaceutical synthesis or formulations where slow evaporation and high solvency are required.",
    "other_industries": "Solvent for coatings (automotive, industrial), printing inks, resins; coalescing agent in latex paints; textile printing; plasticizer."
  },
  {
    "name": "2-Butoxy ethanol (BCS)",
    "cas_no": "111-76-2",
    "cins_no": "",
    "molecular_formula": "C6H14O2",
    "discription": "2-Butoxyethanol, also known as Ethylene Glycol Monobutyl Ether or Butyl Cellosolve, is a colorless liquid with a mild ether-like odor. It is a versatile solvent and coupling agent.",
    "typical_properties": "Formula Weight: 118.2, Flash Point: 67°C, Boiling point: 171°C, Density (20°C): 0.901 g/cm³, Refractive Index (25°C): 1.419, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "180/185/186 kg",
    "food_idustry": "Indirect food additive (e.g., component of sanitizers, cleaners for food processing equipment, boiler water additive) with restrictions.",
    "pharmaceutical_industry": "Used as a solvent and co-solvent in some pharmaceutical formulations, particularly topical and transdermal products, to improve drug solubility and skin penetration.",
    "other_industries": "Widely used as a solvent in paints, coatings, lacquers, enamels, varnishes, and inks; component of household and industrial cleaners, degreasers; hydraulic fluids; herbicide formulations; dispersant for oil spills."
  },
  {
    "name": "Triethylene Glycol Monobutyl Ether (BTG)",
    "cas_no": "143-22-6",
    "cins_no": "",
    "molecular_formula": "C10H22O4",
    "discription": "Triethylene Glycol Monobutyl Ether is a high-boiling, low-volatility solvent with excellent solvency for a wide range of substances. It is a colorless liquid.",
    "typical_properties": "Formula Weight: 206.3, Flash Point: 131°C, Boiling point: 278°C, Density (20°C): 0.989 g/cm³, Refractive Index (25°C): 1.441, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a solvent or coupling agent in specialized pharmaceutical applications that require very low volatility and high solvency.",
    "other_industries": "Solvent in heavy-duty cleaners, inks, and coatings; component of hydraulic fluids and brake fluids; coalescing agent; chemical intermediate for ester production."
  },
  {
    "name": "3,6,9,12-Tetraoxahexadecan-1-ol",
    "cas_no": "1559-34-8",
    "cins_no": "",
    "molecular_formula": "C12H26O5",
    "discription": "This compound is Tetraethylene Glycol Monobutyl Ether. It is a very high-boiling, low-volatility solvent with good solvency characteristics.",
    "typical_properties": "Formula Weight: 250.332, Flash Point: 156.2°C, Boiling point: 328°C, Density (20°C): 1.003 g/cm³, Refractive Index (25°C): 1.442, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "May be used as a high-boiling solvent or plasticizer in specific pharmaceutical contexts.",
    "other_industries": "Solvent for industrial cleaners, inks, and specialty coatings; plasticizer; chemical intermediate."
  },
  {
    "name": "2-(2-Butoxyethoxy)ethanol (DB)",
    "cas_no": "112-34-5",
    "cins_no": "",
    "molecular_formula": "C8H18O3",
    "discription": "2-(2-Butoxyethoxy)ethanol, also known as Diethylene Glycol Monobutyl Ether (DEGMBE) or Butyl Carbitol, is a colorless liquid with a mild odor. It is a high-boiling, slow-evaporating solvent with good coupling properties.",
    "typical_properties": "Formula Weight: 162.2, Flash Point: 114°C, Boiling point: 230°C, Density (20°C): 0.951 g/cm³, Refractive Index (25°C): 1.432, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "193/200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a solvent, co-solvent, and coalescing agent in some pharmaceutical formulations, especially topical preparations, to enhance solubility and penetration.",
    "other_industries": "Solvent for paints, coatings, lacquers, enamels, inks, and cleaners; coalescing agent in latex paints; component of brake fluids and hydraulic fluids; textile dyeing; degreasing agent."
  },
  {
    "name": "2-Butoxyethyl Acetate (BGA)",
    "cas_no": "112-07-2",
    "cins_no": "",
    "molecular_formula": "C8H16O3",
    "discription": "2-Butoxyethyl Acetate, also known as Ethylene Glycol Monobutyl Ether Acetate (EGBEA) or Butyl Cellosolve Acetate, is a colorless liquid solvent with a mild, fruity odor.",
    "typical_properties": "Formula Weight: 160.2, Flash Point: 78°C, Boiling point: 190°C, Density (20°C): 0.941 g/cm³, Refractive Index (25°C): 1.414, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "190 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a solvent in some pharmaceutical manufacturing processes or in specific formulations where its solvency and evaporation characteristics are desired.",
    "other_industries": "Solvent for coatings (automotive, industrial, coil), printing inks, resins (nitrocellulose, acrylics, epoxies, urethanes); coalescing agent in latex paints; component in cleaners."
  },
  {
    "name": "Diethylene Glycol Butylether Acetate (DBGA)",
    "cas_no": "124-17-4",
    "cins_no": "",
    "molecular_formula": "C10H20O4",
    "discription": "Diethylene Glycol Butylether Acetate, also known as Diethylene Glycol Monobutyl Ether Acetate (DEGBA) or Butyl Carbitol Acetate, is a high-boiling, slow-evaporating solvent with excellent solvency for many resins.",
    "typical_properties": "Formula Weight: 201.3, Flash Point: 105°C, Boiling point: 245°C, Density (20°C): 0.977 g/cm³, Refractive Index (25°C): 1.426, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "204.12 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "May be used as a specialty solvent in pharmaceutical processes or formulations that require very slow evaporation and strong solvency.",
    "other_industries": "Solvent for coatings (high-bake enamels, specialty coatings), printing inks, resins; coalescing agent; plasticizer; component in cleaners and paint strippers."
  },
  {
    "name": "Ethylenglycol-mono-tert-butyl ether (ETB)",
    "cas_no": "7580-85-0",
    "cins_no": "",
    "molecular_formula": "C6H14O2",
    "discription": "Ethylene Glycol mono-tert-Butyl Ether is a glycol ether solvent with a branched alkyl group, offering different solvency characteristics compared to linear butyl ethers.",
    "typical_properties": "Formula Weight: 118.18, Flash Point: 55°C, Boiling point: 148°C, Density (20°C): 0.898 g/cm³, Refractive Index (25°C): 1.417, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless transparent.",
    "packing": "180 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Could be used as a solvent in specific pharmaceutical applications where its unique properties are advantageous.",
    "other_industries": "Solvent for coatings, inks, and cleaners; chemical intermediate."
  },
  {
    "name": "Diethyl glycol tert-butyl ether (DETB)",
    "cas_no": "112-73-2",
    "cins_no": "",
    "molecular_formula": "C7H16O3",
    "discription": "Diethylene Glycol tert-Butyl Ether is a glycol ether solvent with a branched alkyl group, providing specific solvency and coupling properties.",
    "typical_properties": "Formula Weight: 190.3 (MF: C7H16O3 is incorrect for this FW; Diethylene Glycol tert-Butyl Ether should be C8H18O3, FW 162.24. This row data has inconsistencies between MF/FW and name, or it is a different, less common compound.), Flash Point: 93°C, Boiling point: 208-218°C, Density (20°C): 0.908 g/cm³, Refractive Index (25°C): 1.4316, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless transparent liquid.",
    "packing": "190 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Potentially used as a specialty solvent if its properties fit a specific formulation need. (Note: Data discrepancy for MF/FW needs clarification for precise application identification).",
    "other_industries": "Solvent for coatings, inks, cleaners; chemical intermediate. (Note: Data discrepancy impacts full profile)."
  },
  {
    "name": "Ethylene Glycol Monopropyl Ether (PRCS)",
    "cas_no": "2807-30-9",
    "cins_no": "",
    "molecular_formula": "C5H12O2",
    "discription": "Ethylene Glycol Monopropyl Ether is a colorless liquid solvent with a mild odor, used in coatings, inks, and cleaning products.",
    "typical_properties": "Formula Weight: 104.1, Flash Point: 51°C, Boiling point: 147°C, Density (20°C): 0.911 g/cm³, Refractive Index (25°C): 1.413, Surface Tension (25°C): Not specified in column, Physical Properties: Oil colorless liquid (likely typo, should be 'Colorless liquid' or 'Oily liquid').",
    "packing": "190.51 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a solvent in some pharmaceutical processes or formulations.",
    "other_industries": "Solvent for paints, coatings, resins, dyes, inks, and cleaners; coupling agent; chemical intermediate."
  },
  {
    "name": "2-Phenoxyethanol (EPH)",
    "cas_no": "122-99-6",
    "cins_no": "",
    "molecular_formula": "C8H10O2",
    "discription": "2-Phenoxyethanol is an oily, slightly viscous liquid with a faint rose-like odor. It is a glycol ether widely used as a preservative in cosmetics and pharmaceuticals, and as a solvent.",
    "typical_properties": "Formula Weight: 138.2, Flash Point: 126°C, Boiling point: 244°C, Density (20°C): 1.109 g/cm³, Refractive Index (25°C): 1.539, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless viscous liquid.",
    "packing": "220/200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Widely used as an antimicrobial preservative in topical pharmaceutical preparations (creams, lotions, ointments), vaccines, and some ophthalmic solutions. Also used as a solvent and fixative.",
    "other_industries": "Preservative in cosmetics and personal care products; solvent for inks, resins, and fragrances; fixative in perfumes; insect repellent; fish anesthetic."
  },
  {
    "name": "2-hexyloxyethanol (HCS)",
    "cas_no": "112-25-4",
    "cins_no": "",
    "molecular_formula": "C8H18O2",
    "discription": "2-Hexyloxyethanol (Ethylene Glycol Monohexyl Ether) is a colorless liquid with a mild odor, used as a solvent and coalescing agent.",
    "typical_properties": "Formula Weight: 146.2, Flash Point: 98°C, Boiling point: 200°C, Density (20°C): 0.890 g/cm³, Refractive Index (25°C): 1.431, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "183.71 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "May be used as a solvent or coupling agent in specific pharmaceutical formulations.",
    "other_industries": "Solvent for coatings, inks, and cleaners; coalescing agent in latex paints; component in hydraulic fluids."
  },
  {
    "name": "Diethylene Glycol Monohexyl Ether (HECB)",
    "cas_no": "112-59-4",
    "cins_no": "",
    "molecular_formula": "C10H22O3",
    "discription": "Diethylene Glycol Monohexyl Ether is a high-boiling, low-volatility solvent with good solvency properties. It's a colorless liquid.",
    "typical_properties": "Formula Weight: 190.3, Flash Point: 126°C, Boiling point: 2591°C (BP is clearly an error, should be around 259-260°C). Density (20°C): 0.931 g/cm³, Refractive Index (25°C): 1.438, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "195.95 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Can be used as a specialty solvent in pharmaceutical applications requiring very slow evaporation and high solvency.",
    "other_industries": "Solvent for coatings, inks, and heavy-duty cleaners; coalescing agent; component in brake fluids."
  },
  {
    "name": "2,2,4-Trimethyl-1,3-pentanediol monoisobutyrate (C-12)",
    "cas_no": "25265-77-4",
    "cins_no": "",
    "molecular_formula": "C12H24O3",
    "discription": "2,2,4-Trimethyl-1,3-pentanediol monoisobutyrate (Texanol ester alcohol) is a premier coalescing agent for latex paints. It's a colorless liquid with a mild characteristic odor.",
    "typical_properties": "Formula Weight: 216.3, Flash Point: 120°C, Boiling point: 255°C, Density (20°C): 0.955 g/cm³, Refractive Index (25°C): 1.4423, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Not a primary pharmaceutical ingredient, but may be found in coatings used on pharmaceutical packaging or equipment.",
    "other_industries": "Primary coalescing aid in latex paints and coatings; solvent in printing inks, floor polishes, and coil coatings; chemical intermediate for producing plasticizers."
  },
  {
    "name": "2,2,4-Trimethyl-1,3-pentanediol diisobutyrate (C-16)",
    "cas_no": "6846-50-0",
    "cins_no": "",
    "molecular_formula": "C16H30O4",
    "discription": "2,2,4-Trimethyl-1,3-pentanediol diisobutyrate is a non-phthalate plasticizer known for its efficiency and compatibility with various polymers. It is a colorless liquid.",
    "typical_properties": "Formula Weight: 286.4, Flash Point: 136°C, Boiling point: 281°C, Density (20°C): 0.948 g/cm³, Refractive Index (25°C): 1.4345, Surface Tension (25°C): Not specified in column, Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Can be used as a plasticizer in pharmaceutical packaging materials or medical devices (e.g., tubing), subject to regulatory approval for such applications.",
    "other_industries": "Primary plasticizer for PVC and other vinyl resins; used in adhesives, coatings, caulks, sealants, and resilient flooring; solvent."
  }
]