[
  {
    "name": "1,4-Butanediol dimethacrylate (1,4-BDDMA)",
    "cas_no": "2082-81-7",
    "cins_no": "",
    "molecular_formula": "C12H18O4",
    "discription": "1,4-Butanediol dimethacrylate is a difunctional methacrylate monomer used as a crosslinking agent in polymerization to improve mechanical properties and solvent resistance. (Note: Table provided CAS 148390-75-4 which is incorrect; corrected to 2082-81-7 based on compound name, MF, and FW).",
    "typical_properties": "Formula Weight: 226.2689. Physical Properties: Colorless or light yellow liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used in dental composites, adhesives, and other biomedical polymer applications as a crosslinker.",
    "other_industries": "Crosslinking agent in free-radical polymerization; used in adhesives, coatings, elastomers, anaerobic sealants, and dental resins to enhance thermal stability, strength, and chemical resistance."
  },
  {
    "name": "1,3-Butanediol dimethacrylate (1,3-BDDMA)",
    "cas_no": "1189-08-8",
    "cins_no": "",
    "molecular_formula": "C12H18O4",
    "discription": "1,3-Butanediol dimethacrylate is a difunctional methacrylate monomer used as a crosslinking agent in polymer systems.",
    "typical_properties": "Formula Weight: 226.2689. Physical Properties: Colorless or light yellow liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used in dental materials, adhesives, and other biomedical polymer applications as a crosslinker.",
    "other_industries": "Crosslinking agent for anaerobic adhesives, sealants, coatings, and in dental restorative materials; imparts hardness and chemical resistance."
  },
  {
    "name": "Ethylene dimethacrylate (EGDMA)",
    "cas_no": "97-90-5",
    "cins_no": "",
    "molecular_formula": "C10H14O4",
    "discription": "Ethylene glycol dimethacrylate is a difunctional methacrylate monomer commonly used as a crosslinking agent in the production of polymers, providing network structures.",
    "typical_properties": "Formula Weight: 198.216. Physical Properties: Colorless liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Widely used as a crosslinker in dental resins, bone cements, hydrogels for contact lenses and drug delivery systems, and in chromatography column packings.",
    "other_industries": "Crosslinking agent for acrylic resins, adhesives, coatings, ion-exchange resins, and elastomers; improves hardness, solvent resistance, and thermal stability."
  },
  {
    "name": "Allyl Methacrylate (AMA)",
    "cas_no": "96-05-9",
    "cins_no": "",
    "molecular_formula": "C7H10O2",
    "discription": "Allyl Methacrylate is a bifunctional monomer containing both a methacrylate group and an allyl group, allowing for two distinct modes of polymerization or post-polymerization modification.",
    "typical_properties": "Formula Weight: 126.153. Physical Properties: Colorless liquid.",
    "packing": "180 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used in specialty polymers for dental applications and other biomedical materials where controlled crosslinking or grafting is desired.",
    "other_industries": "Crosslinking agent and comonomer for producing impact-resistant plastics, coatings, adhesives, and optical resins; allows for air-drying or peroxide curing mechanisms through the allyl group."
  },
  {
    "name": "Poly(ethylene glycol) dimethacrylate (PEG200DMA)",
    "cas_no": "25852-47-5",
    "cins_no": "",
    "molecular_formula": "C10H14O4",
    "discription": "Poly(ethylene glycol) dimethacrylate (PEGDM or PEGDMA) is a crosslinking agent where the length of the polyethylene glycol chain can vary. The CAS is general for these polymers. The provided MF and FW (C10H14O4, FW 198.215) correspond to the n=1 version, Ethylene glycol dimethacrylate (EGDMA). The 'PEG-2000' in the original table name entry might be part of a product series or indicate a different specific grade not reflected in the given MF/FW for this row.",
    "typical_properties": "Formula Weight: 198.215. Physical Properties: Colorless or light yellow liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "PEG dimethacrylates (varying PEG chain lengths) are extensively used to form hydrogels for drug delivery, tissue engineering scaffolds, contact lenses, and dental applications due to their biocompatibility and tunable properties.",
    "other_industries": "Crosslinking agent in adhesives, coatings, inks, and photopolymer resins; used to modify properties like flexibility, hydrophilicity, and swelling characteristics of polymers."
  },
  {
    "name": "Tri(propylene glycol) diacrylate (TPGDA)",
    "cas_no": "42978-66-5",
    "cins_no": "",
    "molecular_formula": "C15H24O6",
    "discription": "Tri(propylene glycol) diacrylate is a difunctional acrylate monomer commonly used as a reactive diluent and crosslinker in UV/EB curable formulations.",
    "typical_properties": "Formula Weight: 300.3475. Physical Properties: Colorless or light yellow clear oily liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "May be used in specific formulations for medical adhesives or coatings if biocompatibility requirements are met.",
    "other_industries": "Reactive diluent and crosslinker in UV/EB curable coatings, inks, adhesives, and photoresists; provides flexibility, good adhesion, and fast cure speed."
  },
  {
    "name": "Di(propylene glycol) diacrylate (DPGDA)",
    "cas_no": "57472-68-1",
    "cins_no": "",
    "molecular_formula": "C12H18O5",
    "discription": "Di(propylene glycol) diacrylate is a difunctional acrylate monomer used as a reactive diluent to reduce viscosity and as a crosslinker to improve properties of cured polymers. (Original table name 'n-Lauryl acrylate' inconsistent with CAS, Abbr., MF, FW).",
    "typical_properties": "Formula Weight: 242.2683. Physical Properties: Colorless or light yellow liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Reactive diluent and crosslinker for UV/EB curable coatings, inks, and adhesives; improves flexibility and adhesion; used in photopolymer printing plates."
  },
  {
    "name": "1,4-Butanediol diacrylate (1,4-BDDA)",
    "cas_no": "1070-70-8",
    "cins_no": "",
    "molecular_formula": "C12H20O6",
    "discription": "1,4-Butanediol diacrylate is a difunctional acrylate monomer used as a crosslinking agent. (Note: The CAS 1070-70-8 is for standard BDDA C10H14O4 (FW~198). The MF C12H20O6 and FW 260.2836 provided in the table suggest a modified or extended form of BDDA for this specific entry.)",
    "typical_properties": "Formula Weight: 260.2836. Physical Properties: Colorless or light yellow liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Crosslinking agent and reactive diluent in UV/EB curable coatings, inks, adhesives, and resins; provides fast cure response and good hardness."
  },
  {
    "name": "1,6-hexanediol diacrylate (HDDA)",
    "cas_no": "13048-33-4",
    "cins_no": "",
    "molecular_formula": "C12H18O4",
    "discription": "1,6-Hexanediol diacrylate is a low-viscosity, difunctional acrylate monomer widely used as a reactive diluent and crosslinker in radiation-curable systems.",
    "typical_properties": "Formula Weight: 226.27. Physical Properties: Colorless or light yellow liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Reactive diluent and crosslinker for UV/EB curable coatings, inks, adhesives, and plastics; improves flexibility, adhesion, and weather resistance; common in overprint varnishes and wood coatings."
  },
  {
    "name": "Trimethylolpropane Trimethacrylate (TMPTMA)",
    "cas_no": "3290-92-4",
    "cins_no": "",
    "molecular_formula": "C18H26O6",
    "discription": "Trimethylolpropane Trimethacrylate is a trifunctional methacrylate monomer used as a crosslinking agent to create highly crosslinked polymer networks with excellent hardness, chemical resistance, and thermal stability.",
    "typical_properties": "Formula Weight: 338.395. Physical Properties: Colorless or light yellow clear liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a crosslinker in dental composites and sealants, and in other biomedical polymer applications requiring high mechanical strength.",
    "other_industries": "Crosslinking agent for anaerobic adhesives, sealants, engineering plastics, rubber modification, coatings (UV/EB curable), and composites; imparts high hardness, scratch resistance, and solvent resistance."
  },
  {
    "name": "1,1,1-Trimethylolpropane triacrylate (TMPTA)",
    "cas_no": "15625-89-5",
    "cins_no": "",
    "molecular_formula": "C15H20O6",
    "discription": "1,1,1-Trimethylolpropane triacrylate is a trifunctional acrylate monomer that serves as an efficient crosslinking agent, providing fast cure speeds and high crosslink density.",
    "typical_properties": "Formula Weight: 296.316. Physical Properties: Colorless or light yellow clear liquid.",
    "packing": "200 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "May be used in dental materials or specialized biomedical coatings where high crosslink density is desired.",
    "other_industries": "Crosslinking agent and reactive diluent in UV/EB curable coatings, inks, adhesives, and photoresists; enhances cure speed, hardness, scratch resistance, and chemical resistance of polymers."
  }
]