[
  {
    "name": "Sodium Carbonate",
    "cas_no": "497-19-8",
    "cins_no": "",
    "molecular_formula": "Na2CO3",
    "discription": "Sodium Carbonate (soda ash, washing soda) is an inorganic chemical compound. It is a white, odorless powder or granular material.",
    "typical_properties": "Formula Weight: 105.99. Physical Properties: White odorless powder or particles (at room temperature).",
    "packing": "25 kg",
    "food_idustry": "Used as a food additive (E500i) as a pH regulator, anti-caking agent, raising agent, and stabilizer. Used in the production of some foods and beverages.",
    "pharmaceutical_industry": "Used as an alkalizing agent, in effervescent tablet formulations, and as a pH adjuster in various pharmaceutical preparations.",
    "other_industries": "(Industrial grade) Manufacturing of glass, detergents, soaps, paper, and chemicals; water softening; pH regulation in various industrial processes; textile industry; metallurgy."
  },
  {
    "name": "ammonium Chloride",
    "cas_no": "12125-02-9",
    "cins_no": "",
    "molecular_formula": "NH4Cl",
    "discription": "Ammonium Chloride (sal ammoniac) is an inorganic compound, a white crystalline salt that is highly soluble in water.",
    "typical_properties": "Formula Weight: 53.49. Physical Properties: The white knot is solid (for industrial/agricultural grade); White crystal solid (for agricultural grade).",
    "packing": "25 kg",
    "food_idustry": "Used as a food additive (E510) as a yeast nutrient in breadmaking, an acidifier, and a flavoring agent (e.g., in licorice).",
    "pharmaceutical_industry": "Used as an expectorant in cough medicines, as a systemic acidifying agent, and in some diuretic therapies.",
    "other_industries": "(Industrial/Agricultural grade) Fertilizer (source of nitrogen); flux in metal soldering and tinning; dry cell batteries; textile printing and dyeing; leather tanning; production of other ammonium compounds; laboratory reagent."
  },
  {
    "name": "Sodium bicarbonate",
    "cas_no": "144-55-8",
    "cins_no": "",
    "molecular_formula": "CHNaO3",
    "discription": "Sodium Bicarbonate (baking soda) is a chemical compound, a white solid that is crystalline but often appears as a fine powder.",
    "typical_properties": "Formula Weight: 84.007. Physical Properties: White powder or super flash spot crystals.",
    "packing": "25 kg",
    "food_idustry": "(Food grade) Widely used as a leavening agent in baking (baking soda); pH buffering agent; component of effervescent drinks and powders.",
    "pharmaceutical_industry": "Used as an antacid to relieve heartburn and acid indigestion; alkalinizing agent for treating metabolic acidosis; component of effervescent formulations.",
    "other_industries": "Cleaning agent; fire extinguishers; pH buffering in swimming pools; flue gas desulfurization; textile processing."
  },
  {
    "name": "sodium sulfate",
    "cas_no": "7757-82-6",
    "cins_no": "",
    "molecular_formula": "Na2O4S",
    "discription": "Sodium Sulfate (Glauber's salt - decahydrate form) is an inorganic compound. Anhydrous form is a white crystalline solid.",
    "typical_properties": "Formula Weight: 142.042. Physical Properties: White, crystalline powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a laxative (osmotic effect). Component of some bowel cleansing preparations before colonoscopy.",
    "other_industries": "(Industrial grade) Manufacturing of detergents (as a filler), paper (Kraft process), glass, and textiles (dyeing); chemical intermediate."
  },
  {
    "name": "Sodium thiosulfate",
    "cas_no": "7772-98-7",
    "cins_no": "",
    "molecular_formula": "Na2O3S2",
    "discription": "Sodium Thiosulfate is an inorganic compound, typically available as the pentahydrate. It is a colorless crystalline solid, also known as sodium hyposulfite or 'hypo'.",
    "typical_properties": "Formula Weight: 158.108. Physical Properties: Colorless crystals or white powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as an antidote for cyanide poisoning and cisplatin toxicity; antifungal agent in some topical preparations; used in some analytical procedures.",
    "other_industries": "(Industrial grade) Photographic fixer; dechlorinating agent in water treatment; analytical reagent (iodometry); gold extraction; leather tanning; bleaching agent in paper and textile industries."
  },
  {
    "name": "urea",
    "cas_no": "57-13-6",
    "cins_no": "",
    "molecular_formula": "CH4N2O",
    "discription": "Urea is an organic compound, a colorless, crystalline substance. It is the main nitrogen-containing compound in the urine of mammals.",
    "typical_properties": "Formula Weight: 60.055. Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used topically as a moisturizer and keratolytic agent (for dry skin, psoriasis, eczema); osmotic diuretic; used to reduce intracranial and intraocular pressure.",
    "other_industries": "(Agricultural grade) Widely used as a nitrogen-release fertilizer; raw material for manufacturing urea-formaldehyde resins and melamine; animal feed supplement; deicing agent."
  },
  {
    "name": "Sodium metasiIicate pentahydrate",
    "cas_no": "10213-79-3",
    "cins_no": "",
    "molecular_formula": "H10Na2O8Si",
    "discription": "Sodium Metasilicate Pentahydrate is an inorganic chemical, a hydrated form of sodium metasilicate. It is a white, granular or crystalline powder.",
    "typical_properties": "Formula Weight: 212.140. Physical Properties: White square pattern of crystalline or spherical particles (for particle grade); White crystal powder (for powder grade).",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Component of detergents, soaps, and cleaning compounds (alkalinity, buffering, emulsification); cement and construction materials; paper deinking; textile processing (bleaching aid); metal cleaning; corrosion inhibitor."
  },
  {
    "name": "Sodium metasilicate",
    "cas_no": "6834-92-0",
    "cins_no": "",
    "molecular_formula": "Na2SiO3",
    "discription": "Sodium Metasilicate (anhydrous) is an inorganic compound. It is a white powder or granular material that is soluble in water, producing alkaline solutions.",
    "typical_properties": "Formula Weight: 122.063. Physical Properties: White particles.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Key ingredient in detergents, soaps, and cleaning agents; cement and concrete admixture; adhesive for paper and cardboard; pulp and paper industry (deinking, bleaching stabilizer); textile processing; ceramics."
  },
  {
    "name": "Aluminum chlorohydrate",
    "cas_no": "1327-41-9",
    "cins_no": "",
    "molecular_formula": "AlClH2O",
    "discription": "Aluminum Chlorohydrate is a group of specific aluminum salts. It is used in deodorants and antiperspirants and as a flocculant in water purification.",
    "typical_properties": "Formula Weight: 80.4498 (Formula listed as AlClH2O is simplified; actual structure is complex [Aln(OH)mCl(3n-m)]x). Physical Properties: Brown-red powder, or crystal particles.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Active ingredient in antiperspirants to reduce sweating.",
    "other_industries": "(Industrial grade, e.g., Polyaluminum Chloride) Coagulant and flocculant in water and wastewater treatment; paper sizing agent."
  },
  {
    "name": "Sodium tripolyphosphate",
    "cas_no": "7758-29-4",
    "cins_no": "",
    "molecular_formula": "Na5O10P3",
    "discription": "Sodium Tripolyphosphate (STPP) is an inorganic compound, the sodium salt of the polyphosphate penta-anion. It is a white powder or granular material.",
    "typical_properties": "Formula Weight: 367.864. Physical Properties: White crystals or in powder form.",
    "packing": "25 kg",
    "food_idustry": "(Food grade) Used as a preservative (E451i), emulsifier, and sequestrant in processed foods, particularly seafood, meats, and poultry to retain moisture and improve texture.",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Major component of synthetic detergents (water softener, builder); water treatment; ceramics; leather tanning; textile dyeing; food processing aid."
  },
  {
    "name": "Sodium Metaphosphate",
    "cas_no": "10124-56-8",
    "cins_no": "",
    "molecular_formula": "Na6O18P6",
    "discription": "Sodium Metaphosphate, often referring to Sodium Hexametaphosphate (SHMP), is a salt of composition (NaPO3)n. It is usually a white powder or glassy solid.",
    "typical_properties": "Formula Weight: 611.77. Physical Properties: White powder crystallization, or colorless transparent glass sheet or block solid.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, often as SHMP, E452i) Used as an emulsifier, sequestrant, texturizer, and moisture retainer in various food products like processed cheese, dairy products, meats, and beverages.",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Water softener and sequestrant in industrial water treatment and detergents; dispersing agent for clays and pigments; textile processing; food processing aid."
  },
  {
    "name": "Tetrasodium pyrophosphate",
    "cas_no": "7722-88-5",
    "cins_no": "",
    "molecular_formula": "Na4O7P2",
    "discription": "Tetrasodium Pyrophosphate (TSPP), also known as sodium pyrophosphate, is an inorganic compound. It is a white, water-soluble solid.",
    "typical_properties": "Formula Weight: 265.902. Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E450iii) Used as an emulsifier, buffering agent, sequestrant, and thickening agent in processed foods such as meats, poultry, seafood, puddings, and dairy products.",
    "pharmaceutical_industry": "Used as a buffering agent and dispersing agent in some dental products like toothpaste.",
    "other_industries": "(Industrial grade) Component of detergents and cleaning compounds; water softener; dispersing agent for pigments and clays; metal cleaning; textile processing."
  },
  {
    "name": "trisodium phosphate",
    "cas_no": "7601-54-9",
    "cins_no": "",
    "molecular_formula": "H24Na3O16P (Formula given seems to be for a hydrated form; commonly Na3PO4 for anhydrous, or Na3PO4·12H2O for dodecahydrate)",
    "discription": "Trisodium Phosphate (TSP) is an inorganic compound, a white, granular or crystalline solid, highly soluble in water, producing an alkaline solution.",
    "typical_properties": "Formula Weight: 380.124 (likely for dodecahydrate). Physical Properties: White crystal powder (for industrial grade 98%); Colorless or white crystals (for industrial grade 93%, 96%); White crystal powder (for anhydrous food grade 99%).",
    "packing": "25 kg",
    "food_idustry": "(Food grade, anhydrous, E339iii) Used as an acidity regulator, emulsifier, sequestrant, and thickening agent in processed foods, dairy products, meats, and beverages.",
    "pharmaceutical_industry": "Used as a buffering agent and pH adjuster in some pharmaceutical formulations. Sometimes used as a laxative.",
    "other_industries": "(Industrial grade) Heavy-duty cleaning agent, degreaser, stain remover; water softener; paint preparation (cleaning surfaces); flux for soldering."
  },
  {
    "name": "sodium dihydrogenphosphate",
    "cas_no": "7558-80-7",
    "cins_no": "",
    "molecular_formula": "H2Na16O4P (Typo in MF, likely H2NaPO4)",
    "discription": "Sodium Dihydrogen Phosphate, also known as Monosodium Phosphate (MSP), is an inorganic compound of sodium with a dihydrogen phosphate anion. It is usually available as a white powder or granules.",
    "typical_properties": "Formula Weight: 119.959 (for NaH2PO4). Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E339i) Used as an acidity regulator, sequestrant, emulsifier, and buffering agent in processed foods, baked goods, dairy products, and beverages.",
    "pharmaceutical_industry": "Used as a buffering agent in pharmaceutical solutions; component of some laxatives and enemas.",
    "other_industries": "(Industrial grade) pH control in water treatment; boiler water treatment; component of metal cleaning and phosphating solutions; dyeing auxiliary."
  },
  {
    "name": "Disodium hydrogenorthophosphate",
    "cas_no": "7558-79-4",
    "cins_no": "",
    "molecular_formula": "HNa2O4P",
    "discription": "Disodium Hydrogenorthophosphate, also known as Disodium Phosphate (DSP), is an inorganic compound of sodium with a hydrogen phosphate anion. It is typically a white, hygroscopic powder.",
    "typical_properties": "Formula Weight: 141.959. Physical Properties: White powder, sheet, or granular.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E339ii) Used as an acidity regulator, sequestrant, emulsifier, stabilizer, and texturizer in processed foods, cheese, dairy products, meats, and beverages.",
    "pharmaceutical_industry": "Used as a buffering agent in pharmaceutical preparations; component of some laxatives and enemas.",
    "other_industries": "(Industrial grade) Water treatment (corrosion control, pH adjustment); component of detergents; dyeing auxiliary; ceramic glazes."
  },
  {
    "name": "Ammonium dihydrogen phosphate",
    "cas_no": "7722-76-1",
    "cins_no": "",
    "molecular_formula": "H6NO4P",
    "discription": "Ammonium Dihydrogen Phosphate, also known as Monoammonium Phosphate (MAP), is an inorganic compound formed when ammonia reacts with phosphoric acid. It is a white crystalline solid.",
    "typical_properties": "Formula Weight: 115.026. Physical Properties: Colorless transparent testoidal crystal.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Ammonium dihydrogen phosphate) Major component of fertilizers (source of nitrogen and phosphorus); fire retardant (in dry chemical fire extinguishers and for treating materials); yeast nutrient in winemaking and brewing; buffering agent."
  },
  {
    "name": "diammonium phosphonate",
    "cas_no": "7783-28-0",
    "cins_no": "",
    "molecular_formula": "(NH4)2HPO4",
    "discription": "Diammonium Phosphate (DAP) is one of a series of water-soluble ammonium phosphate salts that can be produced when ammonia reacts with phosphoric acid.",
    "typical_properties": "Formula Weight: 0 (Incorrect FW). Physical Properties: Greyish-white or dark gray particles.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Diammonium phosphate) Widely used as a fertilizer (provides nitrogen and phosphorus); fire retardant (used in firefighting and for treating materials); yeast nutrient in winemaking and brewing; metal finishing."
  },
  {
    "name": "Monopotassium phosphate",
    "cas_no": "7778-77-0",
    "cins_no": "",
    "molecular_formula": "KH2PO4",
    "discription": "Monopotassium Phosphate (MKP), also known as potassium dihydrogen phosphate, is a soluble salt of potassium and the dihydrogen phosphate ion.",
    "typical_properties": "Formula Weight: 136.085. Physical Properties: Colorless square crystal or white crystalline powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E340i) Used as a buffering agent, sequestrant, emulsifier, and yeast nutrient in food products. Common in sports drinks and processed foods.",
    "pharmaceutical_industry": "Used as a buffering agent in pharmaceutical solutions and formulations. Source of potassium and phosphate.",
    "other_industries": "(Industrial grade) Component of fertilizers (soluble source of phosphorus and potassium); buffering agent in various applications; nutrient in culture media."
  },
  {
    "name": "Sodium Gluconate",
    "cas_no": "527-07-1",
    "cins_no": "",
    "molecular_formula": "C6H11NaO7",
    "discription": "Sodium Gluconate is the sodium salt of gluconic acid. It is a white, crystalline powder that is very soluble in water.",
    "typical_properties": "Formula Weight: 218.137. Physical Properties: White or pale yellow crystalline powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E576) Used as a sequestrant, chelating agent, and pH regulator in food products. Helps prevent bitterness and improves texture.",
    "pharmaceutical_industry": "Used as a chelating agent to bind metal ions; component in some intravenous solutions; used to stabilize pharmaceutical formulations.",
    "other_industries": "(Industrial grade) Chelating agent in industrial cleaners, detergents, and concrete admixtures (retarder, water reducer); metal surface treatment; textile dyeing; bottle washing."
  },
  {
    "name": "D(+)-Glucose",
    "cas_no": "50-99-7",
    "cins_no": "",
    "molecular_formula": "C6H12O6",
    "discription": "D(+)-Glucose, commonly known as dextrose, is a simple sugar (monosaccharide) and an important carbohydrate in biology.",
    "typical_properties": "Formula Weight: 180.156. Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade) Widely used as a sweetener, humectant, texture modifier, and fermentation substrate in a vast range of food and beverage products. Source of energy.",
    "pharmaceutical_industry": "Used in intravenous solutions (dextrose solutions) for fluid and nutrient replenishment; sweetening agent in oral medications; excipient in tablets and powders.",
    "other_industries": "(Industrial grade) Raw material for fermentation processes (e.g., production of ethanol, citric acid); reducing agent; chemical intermediate."
  },
  {
    "name": "D-Gluconic acid",
    "cas_no": "526-95-4",
    "cins_no": "",
    "molecular_formula": "C6H12O7",
    "discription": "D-Gluconic acid is an organic compound, a mild organic acid. It is typically produced by the oxidation of glucose. Often supplied as an aqueous solution.",
    "typical_properties": "Formula Weight: 196.155. Physical Properties: Yellow to brown in the liquid.",
    "packing": "25 kg",
    "food_idustry": "(Often as glucono delta-lactone (GDL), E575, which hydrolyzes to gluconic acid) Used as an acidulant, sequestrant, leavening agent, and curing agent in processed foods.",
    "pharmaceutical_industry": "Used as a chelating agent; its salts (e.g., calcium gluconate, iron gluconate) are used as mineral supplements.",
    "other_industries": "Metal cleaning and pickling; concrete admixture (retarder); component of industrial and household cleaners; rust remover."
  },
  {
    "name": "Defoamer",
    "cas_no": "P60, P70, P80 (industrial grade)",
    "cins_no": "",
    "molecular_formula": "7681-57-4 (Sodium Metabisulfite mentioned just below might be relevant for some defoamer uses, but 'Defoamer' itself is a functional name, not a single chemical)",
    "discription": "Defoamers (or anti-foaming agents) are chemical additives that reduce and hinder the formation of foam in industrial process liquids. The P60, P70, P80 likely refer to specific product grades.",
    "typical_properties": "Formula Weight: Not specified for generic 'Defoamer'. Physical Properties: White viscous emulsion.",
    "packing": "25 kg",
    "food_idustry": "Specific food-grade defoamers (e.g., silicones, sorbitan esters) are used in food processing to control foam during production (e.g., brewing, fermentation, frying).",
    "pharmaceutical_industry": "Used in pharmaceutical manufacturing processes (e.g., fermentation, mixing) to control foam formation.",
    "other_industries": "(Industrial grade) Widely used in pulp and paper industry, paints and coatings, wastewater treatment, oil and gas processing, textiles, food processing, and chemical manufacturing to prevent or break down foam."
  },
  {
    "name": "Sodium metabisulfite",
    "cas_no": "7681-57-4",
    "cins_no": "",
    "molecular_formula": "Na2O5S2",
    "discription": "Sodium Metabisulfite (SMBS) is an inorganic compound, a white crystalline or powder solid with a slight sulfur dioxide odor.",
    "typical_properties": "Formula Weight: 190.107. Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E223) Used as a preservative, antioxidant, and bleaching agent in foods and beverages (e.g., dried fruits, wine, beer, potato products) to prevent spoilage and discoloration.",
    "pharmaceutical_industry": "Used as an antioxidant and preservative in some pharmaceutical formulations, particularly injectables and ophthalmic solutions. Reducing agent.",
    "other_industries": "Water treatment (dechlorination, oxygen scavenger); preservative in photography developing solutions; bleaching agent for pulp, paper, and textiles; reducing agent in chemical synthesis; food preservative; leather tanning."
  },
  {
    "name": "ammonium sulphate",
    "cas_no": "7783-20-2",
    "cins_no": "",
    "molecular_formula": "H8N2O4S",
    "discription": "Ammonium Sulfate is an inorganic salt with a number of commercial uses, most commonly as a soil fertilizer. It contains 21% nitrogen and 24% sulfur.",
    "typical_properties": "Formula Weight: 132.139. Physical Properties: Pure product is colorless transparent orthorhombic crystal crystal odorless.",
    "packing": "25 kg",
    "food_idustry": "Used as a dough conditioner and yeast nutrient in baking (food grade, E517). Acidity regulator.",
    "pharmaceutical_industry": "Used in protein purification (precipitation by 'salting out'); component of some vaccines; adjuvant.",
    "other_industries": "(Agricultural grade) Major nitrogen and sulfur fertilizer; flame retardant compositions; chemical intermediate; production of other ammonium salts; tanning; food additive."
  },
  {
    "name": "Oxalic acid",
    "cas_no": "144-62-7",
    "cins_no": "",
    "molecular_formula": "C2H2O4",
    "discription": "Oxalic Acid is an organic compound, a dicarboxylic acid. It is a white crystalline solid that forms a colorless solution in water.",
    "typical_properties": "Formula Weight: 90.035. Physical Properties: Colorless monoclinic tablets, white powder.",
    "packing": "25 kg",
    "food_idustry": "Present naturally in many foods. Used in small amounts in some food processing applications (e.g., clarifying agent), but generally limited due to toxicity at higher concentrations.",
    "pharmaceutical_industry": "Used as a reagent in pharmaceutical synthesis; its salts (oxalates) can be intermediates. Limited direct therapeutic use.",
    "other_industries": "(Industrial grade) Bleaching agent for wood and textiles; rust remover and metal cleaner; mordant in dyeing processes; reducing agent; marble polishing; production of other chemicals (e.g., oxalates)."
  },
  {
    "name": "Sodium lignosulfonate",
    "cas_no": "8061-51-6",
    "cins_no": "",
    "molecular_formula": "C20H24Na2O10S2",
    "discription": "Sodium Lignosulfonate is a water-soluble anionic polyelectrolyte polymer, a byproduct of the sulfite pulping process. It is a brown amorphous powder.",
    "typical_properties": "Formula Weight: 534.508. Physical Properties: Brown powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Dispersing agent, binder, and emulsifier. Used in concrete admixtures (water reducer, retarder), animal feed pellet binders, dust suppressants, agricultural chemicals (dispersant for pesticides), dye dispersant, gypsum board production, leather tanning."
  },
  {
    "name": "Calcium chloride",
    "cas_no": "10043-52-4",
    "cins_no": "",
    "molecular_formula": "CaCl2",
    "discription": "Calcium Chloride is an inorganic compound, a salt of calcium and chlorine. It is a white crystalline solid at room temperature, highly soluble in water, and hygroscopic.",
    "typical_properties": "Formula Weight: 110.984. Physical Properties: White or off-white solid (granular, massive, or pink).",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E509) Used as a firming agent (e.g., in canned vegetables, tofu), sequestrant, electrolyte in sports drinks, and to adjust mineral content in brewing. Also used in cheese making.",
    "pharmaceutical_industry": "Used in electrolyte solutions for treating hypocalcemia; source of calcium ions. Desiccant.",
    "other_industries": "(Industrial grade 74% -95%) Deicing agent for roads; dust control; desiccant (drying agent); brine for refrigeration plants; concrete accelerator; oil and gas drilling fluids; water treatment."
  },
  {
    "name": "Sodium sulfite",
    "cas_no": "7757-83-7",
    "cins_no": "",
    "molecular_formula": "Na2O3S",
    "discription": "Sodium Sulfite is an inorganic compound, a soluble sodium salt of sulfurous acid. It is a white, odorless powder.",
    "typical_properties": "Formula Weight: 126.043. Physical Properties: White as a crystal or as a powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E221) Used as a preservative and antioxidant in some foods and beverages (e.g., dried fruits, wine) to prevent spoilage and discoloration. Also used as a dough conditioner.",
    "pharmaceutical_industry": "Used as an antioxidant and preservative in some pharmaceutical formulations, particularly injectables.",
    "other_industries": "(Industrial grade 93% -96%) Oxygen scavenger in water treatment (boiler water); photographic developing solutions; reducing agent; dechlorinating agent; pulp and paper manufacturing; textile industry (bleaching, dechlorinating)."
  },
  {
    "name": "Citric acid monohydrate",
    "cas_no": "5949-29-1",
    "cins_no": "",
    "molecular_formula": "C6H10O8",
    "discription": "Citric Acid Monohydrate is a tricarboxylic acid found naturally in citrus fruits. It is a white crystalline powder containing one molecule of water per molecule of citric acid.",
    "typical_properties": "Formula Weight: 210.139. Physical Properties: White as a crystal or as a powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E330) Widely used as an acidulant, flavoring agent, preservative, and sequestrant in foods and beverages (e.g., soft drinks, jams, candies, dairy products).",
    "pharmaceutical_industry": "Used as an acidulant, pH adjuster, buffering agent, antioxidant, and chelating agent in pharmaceutical formulations. Component of effervescent tablets.",
    "other_industries": "Cleaning agent (descaler, rust remover); metal chelator; cosmetics (pH adjustment, antioxidant); food and beverage industry; biodegradable plastics."
  },
  {
    "name": "Citric acid",
    "cas_no": "77-92-9",
    "cins_no": "",
    "molecular_formula": "C6H8O7",
    "discription": "Anhydrous Citric Acid is a tricarboxylic acid. It is a white crystalline powder and a common, weak organic acid.",
    "typical_properties": "Formula Weight: 192.124. Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E330) Same applications as monohydrate: acidulant, flavoring agent, preservative, sequestrant in foods and beverages.",
    "pharmaceutical_industry": "Same applications as monohydrate: acidulant, pH adjuster, buffering agent, antioxidant, chelating agent in pharmaceutical formulations. Used when water content needs to be minimized.",
    "other_industries": "Same applications as monohydrate: cleaning agent, metal chelator, cosmetics, food and beverage industry."
  },
  {
    "name": "Ammonium citrate tribasic",
    "cas_no": "3458-72-8",
    "cins_no": "",
    "molecular_formula": "C6H17N3O7",
    "discription": "Ammonium Citrate Tribasic, also known as Triammonium Citrate, is the ammonium salt of citric acid. It is a white crystalline powder.",
    "typical_properties": "Formula Weight: 243.215. Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "Used as a food additive (E380) as an acidity regulator, emulsifier, and sequestrant.",
    "pharmaceutical_industry": "Buffering agent; analytical reagent.",
    "other_industries": "Buffering agent; analytical reagent in determination of phosphate in fertilizers; metal cleaning."
  },
  {
    "name": "Potassium pyrophosphate",
    "cas_no": "7320-34-5",
    "cins_no": "",
    "molecular_formula": "K4O7P2",
    "discription": "Potassium Pyrophosphate (TKPP) is an inorganic compound, the potassium salt of pyrophosphoric acid. It is a white powder or granular material, soluble in water.",
    "typical_properties": "Formula Weight: 330.336. Physical Properties: White powder or block shape.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E450v) Used as an emulsifier, sequestrant, stabilizer, and texturizer in processed foods like meats, poultry, seafood, and dairy products.",
    "pharmaceutical_industry": "Component in some dental care products (e.g., toothpaste) to prevent calculus formation.",
    "other_industries": "(Industrial grade) Builder in liquid detergents and soaps; dispersing agent for pigments; metal cleaning and electroplating; water treatment; oil drilling muds."
  },
  {
    "name": "Sodium C14-16 olefin sulfonate",
    "cas_no": "68439-57-6",
    "cins_no": "",
    "molecular_formula": "C14H27NaO3S (Represents one component, actual product is a mixture)",
    "discription": "Sodium C14-16 Olefin Sulfonate (AOS) is an anionic surfactant. It is a mixture of long-chain sulfonate salts prepared by the sulfonation of C14-16 alpha olefins.",
    "typical_properties": "Formula Weight: 298.417 (for C14 version). Physical Properties: White pink (likely white or pinkish powder/flakes).",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Primary surfactant in a wide range of personal care products (shampoos, body washes, liquid soaps), household detergents, and industrial cleaners due to its excellent foaming, cleaning, and emulsifying properties, and mildness.",
    "name_en": "Sulfonic acids, C14-16-alkane hydroxy and C14-16-alkene, sodium salts"
  },
  {
    "name": "benzoic acid",
    "cas_no": "65-85-0",
    "cins_no": "",
    "molecular_formula": "C7H6O2",
    "discription": "Benzoic Acid is a simple aromatic carboxylic acid. It is a white, crystalline solid.",
    "typical_properties": "Formula Weight: 122.12. Physical Properties: White as a crystal or as a powder.",
    "packing": "25 kg",
    "food_idustry": "Used as a food preservative (E210) and its salts (e.g., sodium benzoate E211, potassium benzoate E212) are more commonly used. Effective against yeasts, molds, and some bacteria in acidic foods.",
    "pharmaceutical_industry": "Used as an antiseptic and preservative in some topical pharmaceutical preparations (e.g., antifungal ointments). Intermediate in the synthesis of various drugs.",
    "other_industries": "Preservative in cosmetics and personal care products; intermediate for production of plasticizers (benzoate esters), phenol, caprolactam, and dyes; rubber industry (activator, retarder)."
  },
  {
    "name": "L-(+)-Tartaric acid",
    "cas_no": "526-83-0 (L-(+) tartaric acid from natural sources is typically CAS 87-69-4. CAS 526-83-0 may be for specific forms or less common. Assuming common L-(+)-tartaric acid.)",
    "cins_no": "",
    "molecular_formula": "C4H6O6",
    "discription": "L-(+)-Tartaric Acid is a white, crystalline organic acid that occurs naturally in many plants, particularly grapes. It is one of the main acids found in wine.",
    "typical_properties": "Formula Weight: 150.087. Physical Properties: White crystallization.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E334) Used as an acidulant, antioxidant, flavoring agent, and sequestrant in foods and beverages (e.g., wine, soft drinks, jams, candies, baking powder).",
    "pharmaceutical_industry": "Used as an excipient (acidulant, buffering agent) in pharmaceutical formulations; component of effervescent tablets; resolving agent for chiral separations.",
    "other_industries": "(Industrial grade) Metal cleaning and polishing; mordant in dyeing; photographic industry; electroplating; ceramics."
  },
  {
    "name": "Potassium sodium tartrate",
    "cas_no": "304-59-6",
    "cins_no": "",
    "molecular_formula": "C4H12KNaO10 (likely for tetrahydrate: KNaC4H4O6·4H2O)",
    "discription": "Potassium Sodium Tartrate, also known as Rochelle Salt, is a double salt of tartaric acid. It is a colorless crystalline solid.",
    "typical_properties": "Formula Weight: 282.22 (for tetrahydrate). Physical Properties: Colorless trapezius crystal or white crystal powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E337) Used as an emulsifier, sequestrant, and stabilizer in food products, particularly cheese and processed meats.",
    "pharmaceutical_industry": "Used as a mild laxative; component in Fehling's solution (analytical reagent); buffering agent.",
    "other_industries": "Piezoelectric material (e.g., in microphones, phonograph pickups historically); electroplating; silvering mirrors; analytical chemistry."
  },
  {
    "name": "sodium chloride",
    "cas_no": "7647-14-5",
    "cins_no": "",
    "molecular_formula": "ClNa",
    "discription": "Sodium Chloride, commonly known as salt, is an ionic compound. It is a white crystalline solid essential for life.",
    "typical_properties": "Formula Weight: 58.443. Physical Properties: Colorless crystals or white powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade) Widely used as a flavoring agent, preservative, and texture enhancer in nearly all types of food products.",
    "pharmaceutical_industry": "Key component of saline solutions (intravenous, ophthalmic, nasal); used to adjust tonicity of pharmaceutical formulations; electrolyte replenisher.",
    "other_industries": "(Industrial grade) Raw material for production of chlorine and sodium hydroxide (chlor-alkali process); deicing roads; water softening; food processing; chemical manufacturing; leather tanning."
  },
  {
    "name": "magnesium sulfate",
    "cas_no": "7487-88-9 (anhydrous); 10034-99-8 (heptahydrate - Epsom salt)",
    "cins_no": "",
    "molecular_formula": "MgO4S",
    "discription": "Magnesium Sulfate is an inorganic salt containing magnesium, sulfur, and oxygen. It is often encountered as the heptahydrate sulfate mineral epsomite (Epsom salt).",
    "typical_properties": "Formula Weight: 120.368 (anhydrous). Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "Used as a firming agent, flavor enhancer, brewing salt (to adjust mineral content of water), and nutrient supplement in food production.",
    "pharmaceutical_industry": "Used as a laxative (Epsom salt); anticonvulsant (e.g., for eclampsia); to treat magnesium deficiency; in bath salts for muscle relaxation.",
    "other_industries": "(Industrial/Anhydrous grade) Drying agent in organic synthesis; fertilizer (source of magnesium and sulfur); coagulant for tofu; dyeing auxiliary in textile industry."
  },
  {
    "name": "Acrylamide",
    "cas_no": "9003-5-8 (This CAS is for Styrene-Acrylonitrile Copolymers. Acrylamide monomer is CAS 79-06-1. Assuming this is for Polyacrylamide from the 'Yang, non-ionic'.)",
    "cins_no": "",
    "molecular_formula": "C3H5NO (This MF is for acrylamide monomer, not polyacrylamide).",
    "discription": "If referring to Polyacrylamide (based on potential context), it is a polymer formed from acrylamide monomers. The 'Yang, non-ionic' suggests non-ionic polyacrylamide. (Note: Significant discrepancy between listed CAS/MF and typical Polyacrylamide details).",
    "typical_properties": "Formula Weight: 71.078 (for acrylamide monomer). Physical Properties: White to pale yellow particles.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Polyacrylamide is used in electrophoresis gels (PAGE); some derivatives used in drug delivery or as thickeners in topical formulations.",
    "other_industries": "Non-ionic Polyacrylamide: Flocculant in water and wastewater treatment; soil conditioner; paper making (retention and drainage aid); mining; oil recovery."
  },
  {
    "name": "Sodium acrylate",
    "cas_no": "9003-4-7 (This CAS is for poly(acrylic acid), sodium salt, if 'Sodium polyacrylate'. Sodium acrylate monomer is CAS 7446-81-3).",
    "cins_no": "",
    "molecular_formula": "C3H3NaO2 (This MF is for sodium acrylate monomer).",
    "discription": "If referring to Sodium Polyacrylate (based on typical usage for 'food grade' polymer), it is the sodium salt of polyacrylic acid. It is a superabsorbent polymer. (Note: Discrepancy if CAS refers to polymer but MF is for monomer).",
    "typical_properties": "Formula Weight: 94.045 (for sodium acrylate monomer). Physical Properties: Light gray crystalline solid.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, often as Polyacrylate) Used as a thickener, stabilizer, and emulsifier in some food products. Superabsorbent used in food packaging.",
    "pharmaceutical_industry": "Sodium Polyacrylate used in superabsorbent applications like disposable diapers and wound dressings. Thickening agent in some formulations.",
    "other_industries": "Superabsorbent polymer (SAP) for diapers, adult incontinence products, agricultural soil amendment; thickener; dispersing agent; flocculant in water treatment."
  },
  {
    "name": "Sodium 3,4-dimethylbenzenesulfonate",
    "cas_no": "1300-72-7",
    "cins_no": "",
    "molecular_formula": "C8H9NaO3S",
    "discription": "Sodium Xylenesulfonate (Sodium 3,4-dimethylbenzenesulfonate is one isomer) is an anionic surfactant used as a hydrotrope, solubilizer, and coupling agent.",
    "typical_properties": "Formula Weight: 208.21. Physical Properties: White powder or yellow liquid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Hydrotrope in detergents, cleaners, and personal care products to increase the solubility of other surfactants and components; solubilizer; coupling agent; viscosity reducer."
  },
  {
    "name": "sodium acetate trihydrate",
    "cas_no": "6131-90-4",
    "cins_no": "",
    "molecular_formula": "C2H9NaO5",
    "discription": "Sodium Acetate Trihydrate is the sodium salt of acetic acid, containing three molecules of water of crystallization. It is a colorless crystalline solid.",
    "typical_properties": "Formula Weight: 136.08. Physical Properties: Colorless transparent crystal or a white solid.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E262i) Used as a seasoning (salt and vinegar flavor), buffering agent, and preservative in food products.",
    "pharmaceutical_industry": "Used as an electrolyte replenisher (in dialysis solutions); buffering agent; component of heat packs (utilizing its exothermic crystallization).",
    "other_industries": "Buffering agent in textile dyeing and leather tanning; photographic industry; production of other acetates."
  },
  {
    "name": "Sodium acetate",
    "cas_no": "127-09-3",
    "cins_no": "",
    "molecular_formula": "C2H3NaO2",
    "discription": "Sodium Acetate Anhydrous is the sodium salt of acetic acid. It is a white, hygroscopic powder.",
    "typical_properties": "Formula Weight: 82.034. Physical Properties: White powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E262i) Same applications as trihydrate: seasoning, buffering agent, preservative.",
    "pharmaceutical_industry": "Same applications as trihydrate: electrolyte replenisher, buffering agent, used when water content must be low.",
    "other_industries": "Same applications as trihydrate, but preferred where absence of water is critical (e.g., certain organic reactions)."
  },
  {
    "name": "Ammonium Bicarbonate",
    "cas_no": "1066-33-7",
    "cins_no": "",
    "molecular_formula": "CH5NO3",
    "discription": "Ammonium Bicarbonate is an inorganic compound, a white crystalline powder with a faint ammoniacal odor. It decomposes to ammonia, carbon dioxide, and water upon heating.",
    "typical_properties": "Formula Weight: 79.055. Physical Properties: Colourless, orthorhombic crystals or monoclinic crystals, or white crystalline powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E503ii) Used as a leavening agent in baking (e.g., cookies, crackers), producing a crisp texture. Also a pH control agent.",
    "pharmaceutical_industry": "Used in some expectorant formulations; buffering agent.",
    "other_industries": "(Agricultural, food grade) Leavening agent; source of ammonia; production of other ammonium salts; fire extinguishers; textile processing; ceramics; chrome leather tanning."
  },
  {
    "name": "potassium chloride",
    "cas_no": "7447-40-7",
    "cins_no": "",
    "molecular_formula": "ClK",
    "discription": "Potassium Chloride (KCl) is a metal halide salt composed of potassium and chlorine. It is an odorless white or colorless vitreous crystal.",
    "typical_properties": "Formula Weight: 74.551. Physical Properties: white crystal.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E508) Used as a salt substitute, flavor enhancer, gelling agent, and nutrient supplement (source of potassium) in food products.",
    "pharmaceutical_industry": "Used to treat or prevent potassium deficiency (hypokalemia); electrolyte in intravenous solutions; component of oral rehydration salts.",
    "other_industries": "(Agricultural grade) Major potassium fertilizer; raw material for manufacturing other potassium compounds; deicing agent; component of drilling fluids; water softener."
  },
  {
    "name": "sodium dodecyl sulfate",
    "cas_no": "751-21-3 (This CAS appears incorrect for SDS, which is 151-21-3. C12H25NaO4S formula matches SDS).",
    "cins_no": "",
    "molecular_formula": "C12H25NaO4S",
    "discription": "Sodium Dodecyl Sulfate (SDS), also known as Sodium Lauryl Sulfate (SLS), is an anionic surfactant used in many cleaning and hygiene products. (Note: CAS in table appears to be a typo, should be 151-21-3 for SDS).",
    "typical_properties": "Formula Weight: 288.379. Physical Properties: Clear to yellow in liquid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as an emulsifier, wetting agent, and solubilizer in pharmaceutical formulations (e.g., tablets, topical preparations). Denaturing agent in protein electrophoresis (SDS-PAGE).",
    "other_industries": "(K12) Widely used surfactant in detergents, shampoos, toothpastes, and other personal care and cleaning products for its foaming and cleaning properties; laboratory reagent."
  },
  {
    "name": "Lacticacid",
    "cas_no": "50-21-5",
    "cins_no": "",
    "molecular_formula": "C3H6O3",
    "discription": "Lactic Acid is an organic acid. It is a chiral molecule, and the DL- form (racemic mixture) is often supplied. It is a colorless to yellowish syrupy liquid.",
    "typical_properties": "Formula Weight: 90.078. Physical Properties: Colorless to yellow liquid.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E270) Used as an acidulant, flavoring agent, and preservative in foods and beverages (e.g., dairy products, pickled vegetables, soft drinks).",
    "pharmaceutical_industry": "Used in topical preparations for its exfoliating and moisturizing properties; pH adjuster; component of some intravenous solutions (e.g., Ringer's lactate).",
    "other_industries": "(80% - 88% (GY-SP HEDP, solid, liquid) INDUSTRIAL grade) - Note: 'HEDP' reference seems out of place for lactic acid. Industrial uses include leather tanning, textile dyeing, descaling agent, biodegradable solvent, raw material for polylactic acid (PLA) bioplastics."
  },
  {
    "name": "Etidronic acid",
    "cas_no": "2809-21-4",
    "cins_no": "",
    "molecular_formula": "C2H8O7P2",
    "discription": "Etidronic Acid (HEDP - 1-Hydroxyethane 1,1-Diphosphonic Acid) is a bisphosphonate used as a sequestrant, water treatment agent, and in detergents.",
    "typical_properties": "Formula Weight: 206.028. Physical Properties: Colless, amorphous crystals.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used in the treatment of osteoporosis and Paget's disease of bone (to inhibit bone resorption). Component in some dental care products to prevent tartar formation.",
    "other_industries": "(Industrial grade, HEDP-2 sodium, 4 sodium) Sequestrant and chelating agent in water treatment (scale and corrosion inhibitor); component of detergents and cleaning agents; stabilizer in peroxide solutions; cosmetics."
  },
  {
    "name": "Aminotrimethylene phosphonic acid",
    "cas_no": "6419-19-8",
    "cins_no": "",
    "molecular_formula": "C3H12NO9P3",
    "discription": "Aminotrimethylene Phosphonic Acid (ATMP) is a phosphonate chelating agent. It has excellent scale inhibition and corrosion inhibition properties.",
    "typical_properties": "Formula Weight: 299.05. Physical Properties: Colorless or pale yellow transparent liquid, or white granular solid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Widely used as a scale inhibitor and corrosion inhibitor in industrial water treatment systems (cooling water, boiler water); chelating agent in textile industry and detergents; oilfield applications."
  },
  {
    "name": "Polyacrylic acid",
    "cas_no": "9003-1-4 (Typo, Polyacrylic acid is typically CAS 9003-01-4. CAS 9003-1-4 is for Polypropylene)",
    "cins_no": "",
    "molecular_formula": "(C3H4O2)n",
    "discription": "Polyacrylic Acid (PAA, Carbomer) is a polymer of acrylic acid. It is a weak anionic polyelectrolyte. (Note: CAS in table 9003-1-4 is for Polypropylene, likely a typo; PAA is 9003-01-4).",
    "typical_properties": "Formula Weight: 72.0627 (monomer unit). Physical Properties: Colorless viscous liquid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "(as Carbomer) Widely used as a thickening agent, suspending agent, emulsifier, gelling agent, and bioadhesive in pharmaceutical formulations (e.g., topical gels, oral suspensions, tablets).",
    "other_industries": "(PPA) liquid: Thickener, dispersant, flocculant. Used in detergents, water treatment, cosmetics, paints, adhesives, and superabsorbent polymers (crosslinked form)."
  },
  {
    "name": "(±)-Malic Acid",
    "cas_no": "6915-15-7",
    "cins_no": "",
    "molecular_formula": "C4H6O5",
    "discription": "DL-Malic Acid (racemic mixture) is an organic dicarboxylic acid that contributes to the pleasantly sour taste of fruits. It is a white crystalline powder.",
    "typical_properties": "Formula Weight: 134.087. Physical Properties: Colorless crystalline or white crystalline powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E296) Used as an acidulant, flavoring agent, and pH adjuster in foods and beverages (e.g., soft drinks, candies, fruit products).",
    "pharmaceutical_industry": "Used as an acidulant and pH adjuster in pharmaceutical formulations. Chelating agent.",
    "other_industries": "Metal cleaning; dyeing; chemical intermediate."
  },
  {
    "name": "AMMONIUM MOLYBDATE",
    "cas_no": "13106-76-8",
    "cins_no": "",
    "molecular_formula": "H8MoN2O4",
    "discription": "Ammonium Molybdate, often referring to Ammonium Heptamolybdate Tetrahydrate ((NH4)6Mo7O24·4H2O, CAS 12054-85-2), is a source of molybdenum. The simple formula H8MoN2O4 refers to Ammonium Dimolybdate.",
    "typical_properties": "Formula Weight: 196.014 (for (NH4)2MoO4). Physical Properties: White powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Analytical reagent for phosphate, silicate, and lead determination; catalyst in chemical reactions; corrosion inhibitor; component of fertilizers (molybdenum source); production of molybdenum metal and alloys; pigments."
  },
  {
    "name": "Sodiummolybdate",
    "cas_no": "7631-95-0",
    "cins_no": "",
    "molecular_formula": "MoNa2O4",
    "discription": "Sodium Molybdate (typically as dihydrate, Na2MoO4·2H2O) is an inorganic compound, a source of molybdenum.",
    "typical_properties": "Formula Weight: 205.917 (anhydrous). Physical Properties: White powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Corrosion inhibitor in water treatment systems; micronutrient in fertilizers; catalyst in chemical and petrochemical industries; pigment production; analytical reagent."
  },
  {
    "name": "Phenyltriazole (industrial grade)",
    "cas_no": "/",
    "cins_no": "",
    "molecular_formula": "/",
    "discription": "Phenyltriazole refers to a class of heterocyclic organic compounds containing a phenyl group attached to a triazole ring. The specific isomer (e.g., 1-phenyl-1H-1,2,3-triazole, 1-phenyl-1H-1,2,4-triazole) is not specified.",
    "typical_properties": "Formula Weight: /. Physical Properties: Not specified clearly beyond being a liquid in some context (see other entries).",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Some phenyltriazole derivatives are investigated or used as APIs (e.g., antifungals).",
    "other_industries": "Corrosion inhibitors for copper and its alloys; intermediates for agrochemicals, dyes, and photographic chemicals; ligands in coordination chemistry."
  },
  {
    "name": "JFC",
    "cas_no": "/",
    "cins_no": "",
    "molecular_formula": "/",
    "discription": "JFC (Osmocolant JFC) is likely a trade name for a specific chemical or mixture, probably a surfactant or emulsifier type used as an 'osmocolant' (which is not a standard chemical term, possibly relates to osmotic properties or a misinterpretation).",
    "typical_properties": "Formula Weight: /. Physical Properties: Colorless liquid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Specific uses depend on its actual chemical nature, but likely functions as a surfactant, emulsifier, dispersing agent, or wetting agent in various industrial formulations."
  },
  {
    "name": "Casson preservative!",
    "cas_no": "/",
    "cins_no": "",
    "molecular_formula": "/",
    "discription": "Casson preservative likely refers to a branded preservative product, often a mixture of isothiazolinones like Methylisothiazolinone (MIT) and Methylchloroisothiazolinone (CMIT), or similar biocides.",
    "typical_properties": "Formula Weight: /. Physical Properties: Colorless liquid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Broad-spectrum biocide and preservative used in water-based products like paints, coatings, adhesives, detergents, metalworking fluids, and cooling water systems to prevent microbial growth.",
    "name_en": "Cassone (Industrial grade)"
  },
  {
    "name": "Ferrous sulfat",
    "cas_no": "7782-63-0 (typically refers to heptahydrate FeSO4·7H2O)",
    "cins_no": "",
    "molecular_formula": "FeSO4·7H2O",
    "discription": "Ferrous Sulfate (Iron(II) Sulfate) is an inorganic compound. The heptahydrate is the most common form, appearing as blue-green or teal crystals or granules.",
    "typical_properties": "Formula Weight: 278.015 (heptahydrate). Physical Properties: Blue al monoclinic series crystals or particles.",
    "packing": "25 kg",
    "food_idustry": "Used for iron fortification in some foods and as a color fixative (food grade).",
    "pharmaceutical_industry": "Used to treat and prevent iron deficiency anemia.",
    "other_industries": "(Industrial grade) Reducing agent; mordant in dyeing; coagulant in water and wastewater treatment; production of iron pigments; catalyst; moss killer in horticulture."
  },
  {
    "name": "Compound Alkali",
    "cas_no": "1305-78-8 (This CAS is for Calcium Oxide. Compound Alkali is a mixture.)",
    "cins_no": "",
    "molecular_formula": "Ca(OH)2 (This MF is for Calcium Hydroxide. Compound Alkali is a mixture.)",
    "discription": "Compound Alkali refers to a blended alkaline product, typically a mixture of strong bases like sodium hydroxide, potassium hydroxide, or carbonates, designed for specific industrial applications needing high alkalinity.",
    "typical_properties": "Formula Weight: /. Physical Properties: Not specified for mixture beyond its alkaline nature.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Used for pH adjustment, neutralization, cleaning, and in various chemical processes where a strong alkaline source is required. Specific composition depends on the intended use."
  },
  {
    "name": "Water glass 40% liquid (Industrial grade)",
    "cas_no": "(Sodium Silicate solution usually CAS 1344-09-8 for generic, or more specific ones)",
    "cins_no": "",
    "molecular_formula": "(Na2O)x·SiO2 (general formula)",
    "discription": "Water Glass (Sodium Silicate solution) is an aqueous solution of sodium silicates. It is a viscous, clear or opalescent liquid.",
    "typical_properties": "Formula Weight: /. Physical Properties: Viscous liquid (implied).",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Adhesive for paper, cardboard, and glass; binder in cements, refractories, and foundry molds; detergent builder; corrosion inhibitor; water treatment (coagulant aid); soil stabilization; silica gel production; fireproofing textiles."
  },
  {
    "name": "Cupric sulfate",
    "cas_no": "7758-98-7 (anhydrous); 7758-99-8 (pentahydrate)",
    "cins_no": "",
    "molecular_formula": "CuO4S",
    "discription": "Cupric Sulfate (Copper(II) Sulfate) is an inorganic compound. The pentahydrate (CuSO4·5H2O) is the most common form, a bright blue crystalline solid.",
    "typical_properties": "Formula Weight: 249.685 (pentahydrate). Physical Properties: Colour or grey-white orthorhombic crystals.",
    "packing": "25 kg",
    "food_idustry": "Used as a fungicide and to control algae in water (with restrictions). Mineral supplement in animal feed.",
    "pharmaceutical_industry": "Used topically as an astringent and antiseptic in some preparations. Emetic (historically).",
    "other_industries": "(Industrial grade) Fungicide and algaecide in agriculture and water treatment; mordant in dyeing; electroplating; catalyst; precursor for other copper compounds; component of Fehling's solution and Benedict's solution."
  },
  {
    "name": "Sifamic acic",
    "cas_no": "6329-14-2 (Typo; Sulfamic acid is CAS 5329-14-6).",
    "cins_no": "",
    "molecular_formula": "H3NO3S",
    "discription": "Sulfamic Acid (Amidosulfonic acid) is a molecular compound. It is a white, crystalline solid that is stable and non-hygroscopic. (Note: Name appears to be a typo for Sulfamic acid, CAS 5329-14-6).",
    "typical_properties": "Formula Weight: 97.094. Physical Properties: White crystal solid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Descaling agent for cleaning boilers, heat exchangers, and cooling systems; metal and ceramic cleaning; catalyst in esterification processes; dye and pigment manufacturing; pH adjuster; component in fire retardants."
  },
  {
    "name": "Phenol",
    "cas_no": "108-95-2",
    "cins_no": "",
    "molecular_formula": "C6H6O",
    "discription": "Phenol (carbolic acid) is an aromatic organic compound. It is a white crystalline solid that is volatile. It has a distinctive sweet and tarry odor.",
    "typical_properties": "Formula Weight: 94.111. Physical Properties: Transparent crystalline solid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as an antiseptic and disinfectant (e.g., in throat lozenges, mouthwashes, antiseptic solutions). Preservative in some vaccines. Intermediate in the synthesis of various drugs (e.g., aspirin, paracetamol derivatives).",
    "other_industries": "(Industrial grade) Major commodity chemical used as a precursor to plastics and related materials, notably phenolic resins (e.g., Bakelite), bisphenol A (for polycarbonate and epoxy resins), caprolactam (for nylon), and alkylphenols."
  },
  {
    "name": "3-NITROBENZENESULFONIC ACID",
    "cas_no": "98-47-5",
    "cins_no": "",
    "molecular_formula": "C6H5NO5S",
    "discription": "3-Nitrobenzenesulfonic acid is an organic compound often used as its sodium salt. It is an intermediate in dye synthesis and a mild oxidizing agent.",
    "typical_properties": "Formula Weight: 203.17. Physical Properties: (Not clearly described for the acid itself, often used as sodium salt).",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial, plating grade) Oxidizing agent in vat dyeing processes (resist agent or discharge printing agent); intermediate for synthesis of dyes and optical brighteners; component in electroplating baths."
  },
  {
    "name": "ammonium persulfate",
    "cas_no": "7727-54-0",
    "cins_no": "",
    "molecular_formula": "H8N2O8S2",
    "discription": "Ammonium Persulfate (APS) is an inorganic compound. It is a strong oxidizing agent and a radical initiator for polymerization.",
    "typical_properties": "Formula Weight: 228.202. Physical Properties: Gray-white crystalline powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Polymerization initiator (e.g., for emulsion polymerization of acrylics, vinyl acetate); etchant for printed circuit boards; bleaching agent for textiles and paper; soil conditioner; hair bleaching; oxidizing agent in chemical synthesis."
  },
  {
    "name": "sodium persulfate",
    "cas_no": "7775-27-1",
    "cins_no": "",
    "molecular_formula": "Na2O8S3 (Typo, Na2S2O8 is Sodium Persulfate)",
    "discription": "Sodium Persulfate is an inorganic compound, the sodium salt of peroxydisulfuric acid. It is a strong oxidizing agent.",
    "typical_properties": "Formula Weight: 238.105 (for Na2S2O8). Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Polymerization initiator (similar to APS); etchant for printed circuit boards; oxidizing agent in chemical synthesis; bleaching agent; cosmetics (hair bleaching); soil remediation."
  },
  {
    "name": "potassium persulfate",
    "cas_no": "7727-21-1",
    "cins_no": "",
    "molecular_formula": "K2O8S2",
    "discription": "Potassium Persulfate is an inorganic compound, a strong oxidizing agent. It is a white, crystalline solid.",
    "typical_properties": "Formula Weight: 270.322. Physical Properties: Colorless and odorless crystals or white powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Polymerization initiator for emulsion polymerization; oxidizing agent; bleaching agent for textiles, paper, and soaps; hair bleaching formulations; etchant in electronics."
  },
  {
    "name": "Sodium nitrite",
    "cas_no": "7632-00-0",
    "cins_no": "",
    "molecular_formula": "NNaO2",
    "discription": "Sodium Nitrite is an inorganic compound, a white to slightly yellowish crystalline powder. It is an oxidizing agent and also used as a food preservative.",
    "typical_properties": "Formula Weight: 68.995. Physical Properties: White to off-white powder.",
    "packing": "25 kg",
    "food_idustry": "Used as a food preservative and color fixative (E250), particularly in cured meats (e.g., bacon, ham, hot dogs) to prevent botulism and maintain red color.",
    "pharmaceutical_industry": "Used as an antidote for cyanide poisoning (forms methemoglobin). Vasodilator.",
    "other_industries": "(Industrial grade) Corrosion inhibitor; heat transfer salt; reagent in dye manufacturing (diazotization); production of rubber chemicals; metal surface treatment."
  },
  {
    "name": "Potassium hydroxide",
    "cas_no": "1310-58-3",
    "cins_no": "",
    "molecular_formula": "HKO",
    "discription": "Potassium Hydroxide (caustic potash) is an inorganic compound, a strong alkali. It is a white, deliquescent solid.",
    "typical_properties": "Formula Weight: 56.106. Physical Properties: White sheet.",
    "packing": "25 kg",
    "food_idustry": "Used as a food additive (E525) for pH control, stabilization, and thickening. Used in processing cocoa and soft drinks.",
    "pharmaceutical_industry": "Used as an alkalizing agent, pH adjuster, and in some dermatological preparations for wart removal. Reagent in synthesis.",
    "other_industries": "(Industrial grade 90% -95%) Manufacturing of soft soaps and liquid detergents; electrolyte in alkaline batteries; production of potassium salts; chemical synthesis; biodiesel production (catalyst); drain cleaners."
  },
  {
    "name": "Sodium hydroxide",
    "cas_no": "1310-73-2",
    "cins_no": "",
    "molecular_formula": "HNaO",
    "discription": "Sodium Hydroxide (caustic soda, lye) is an inorganic compound, a highly caustic metallic base and alkali salt. It is a white solid available in pellets, flakes, granules, and as prepared solutions.",
    "typical_properties": "Formula Weight: 39.997. Physical Properties: No smelly white solid.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E524) Used for pH adjustment, peeling fruits and vegetables, cocoa processing, and in pretzel making (glazing).",
    "pharmaceutical_industry": "Used as an alkalizing agent and pH adjuster in pharmaceutical manufacturing. Reagent in chemical synthesis.",
    "other_industries": "(Industrial grade, alkali, So-ine hydroxide, imported) Major industrial chemical used in pulp and paper manufacturing, textile production, soap and detergent making, drain cleaners, petroleum refining, aluminum production, and chemical synthesis."
  },
  {
    "name": "Sodium Fluoride",
    "cas_no": "7681-49-4",
    "cins_no": "",
    "molecular_formula": "FNa",
    "discription": "Sodium Fluoride is an inorganic chemical compound. It is a colorless or white crystalline solid that is soluble in water.",
    "typical_properties": "Formula Weight: 41.9882. Physical Properties: White odorless powder or crystal.",
    "packing": "25 kg",
    "food_idustry": "Used for water fluoridation to prevent dental caries (where permitted and regulated).",
    "pharmaceutical_industry": "Active ingredient in toothpastes, mouth rinses, and dental gels for prevention of tooth decay. Used in treatment of osteoporosis (systemically, less common now).",
    "other_industries": "(Industrial grade, powder, crystal) Water fluoridation; flux in metallurgy; component of pesticides and rodenticides; wood preservative; glass manufacturing (etching, frosting)."
  },
  {
    "name": "ammonium fluoride",
    "cas_no": "12125-01-8",
    "cins_no": "",
    "molecular_formula": "H4FN",
    "discription": "Ammonium Fluoride is an inorganic compound. It is a white, crystalline salt that is soluble in water.",
    "typical_properties": "Formula Weight: 37.037. Physical Properties: white crystal.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Glass etching and frosting; cleaning and polishing metals; wood preservative; textile processing (mordant); analytical reagent."
  },
  {
    "name": "Ammonium bifluoride",
    "cas_no": "1341-49-7",
    "cins_no": "",
    "molecular_formula": "F2H5N",
    "discription": "Ammonium Bifluoride (Ammonium Hydrogen Fluoride) is an inorganic compound. It is a colorless, crystalline salt.",
    "typical_properties": "Formula Weight: 57.043. Physical Properties: White crystals, with a slightly pungent smell.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Glass etching and frosting (more effective than ammonium fluoride alone); cleaning agent for brick, stone, and ceramics; laundry sour (neutralizes alkali); oil well acidizing; aluminum anodizing."
  },
  {
    "name": "Sodium percarbonate",
    "cas_no": "15630-89-4",
    "cins_no": "",
    "molecular_formula": "C2H6Na4O12 (Actual formula is 2Na2CO3·3H2O2)",
    "discription": "Sodium Percarbonate is an adduct of sodium carbonate and hydrogen peroxide. It is a white, crystalline, water-soluble solid. It acts as an oxidizing agent.",
    "typical_properties": "Formula Weight: 314.021 (for 2Na2CO3·3H2O2). Physical Properties: White crystal powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Bleaching agent in laundry detergents and cleaning products (oxygen bleach); general purpose cleaner and disinfectant; pulp and paper bleaching; textile bleaching; aquaculture (oxygen source)."
  },
  {
    "name": "Sodium perborate",
    "cas_no": "10486-00-7 (tetrahydrate); 7632-04-4 (monohydrate)",
    "cins_no": "",
    "molecular_formula": "BH8NaO7 (for tetrahydrate NaBO3·4H2O)",
    "discription": "Sodium Perborate is a white, odorless, water-soluble chemical compound. It crystallizes commonly as the monohydrate or tetrahydrate.",
    "typical_properties": "Formula Weight: 153.86 (tetrahydrate). Physical Properties: White monoclinic crystals with crystalline particles or powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used in some antiseptic formulations and denture cleaners for its mild oxidizing and bleaching properties.",
    "other_industries": "(Industrial grade) Bleaching agent in laundry detergents, textile industry, and cosmetics (e.g., hair colorants); disinfectant; component of denture cleaners and tooth-whitening products."
  },
  {
    "name": "Orthoboric acid",
    "cas_no": "10043-35-3",
    "cins_no": "",
    "molecular_formula": "H3BO3",
    "discription": "Boric Acid (Orthoboric acid, Hydrogen borate) is a weak, monobasic Lewis acid of boron. It exists as colorless crystals or a white powder that dissolves in water.",
    "typical_properties": "Formula Weight: 61.833. Physical Properties: Colorless or white odorless crystalline solid.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a mild antiseptic, eyewash (buffered solutions), and insecticide (e.g., for cockroaches, ants). Buffering agent.",
    "other_industries": "(Industrial grade) Insecticide; flame retardant; neutron absorber in nuclear power plants; precursor to other boron compounds; manufacture of fiberglass, LCD flat panel glass, and ceramics; antiseptic."
  },
  {
    "name": "Sodium hydroxymethanesulfinate",
    "cas_no": "149-44-0",
    "cins_no": "",
    "molecular_formula": "CH3NaO3S",
    "discription": "Sodium Hydroxymethanesulfinate, commonly known as Rongalite, is a reducing agent. It is a white crystalline solid.",
    "typical_properties": "Formula Weight: 118.087. Physical Properties: Translucent white orthorhombic crystals or small pieces.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Carving white block, carved white powder) Reducing agent in textile dyeing (vat dyeing, discharge printing); bleaching agent for pulp and paper; polymerization initiator for synthetic rubber; photographic applications."
  },
  {
    "name": "Sodium bisulfite",
    "cas_no": "7631-90-5",
    "cins_no": "",
    "molecular_formula": "HNaO3S",
    "discription": "Sodium Bisulfite (Sodium Hydrogen Sulfite) is a chemical compound. It is a white powder or granular material with a slight sulfur dioxide odor.",
    "typical_properties": "Formula Weight: 104.061. Physical Properties: White powder.",
    "packing": "25 kg",
    "food_idustry": "(Food grade, E222) Used as a preservative, antioxidant, and bleaching agent in foods and beverages (e.g., wine, beer, dried fruits).",
    "pharmaceutical_industry": "Used as an antioxidant and reducing agent in pharmaceutical formulations, particularly to stabilize epinephrine and other drugs prone to oxidation.",
    "other_industries": "(Industrial grade) Reducing agent in chemical synthesis; dechlorinating agent in water treatment; oxygen scavenger; bleaching agent for pulp, paper, and textiles; food preservative; photographic industry."
  },
  {
    "name": "Acrylamide Crystals",
    "cas_no": "1979-6-1 (This CAS seems incorrect; Acrylamide monomer is 79-06-1).",
    "cins_no": "",
    "molecular_formula": "C3H5NO",
    "discription": "Acrylamide is an organic compound, a white, odorless crystalline solid. It is a monomer used to produce polyacrylamides. (Note: CAS in table is likely a typo, should be 79-06-1).",
    "typical_properties": "Formula Weight: 71.078. Physical Properties: white crystal.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Used in laboratories for preparing polyacrylamide gels for electrophoresis (e.g., PAGE) to separate proteins and nucleic acids.",
    "other_industries": "(Industrial grade) Monomer for polyacrylamides (PAM) used in water treatment (flocculant), paper manufacturing, soil conditioning, oil recovery, and dye manufacturing."
  },
  {
    "name": "Formic Acid",
    "cas_no": "64-8-6 (Typo, Formic acid is CAS 64-18-6).",
    "cins_no": "",
    "molecular_formula": "CH2O2",
    "discription": "Formic Acid (methanoic acid) is the simplest carboxylic acid. It is a colorless liquid with a pungent, penetrating odor. (Note: CAS in table 64-8-6 is a typo, should be 64-18-6).",
    "typical_properties": "Formula Weight: 46.025. Physical Properties: Colorless liquid.",
    "packing": "25 kg",
    "food_idustry": "Used as a preservative and antibacterial agent in livestock feed (food grade for animals).",
    "pharmaceutical_industry": "Used as a reagent in chemical synthesis; some topical wart removers contain it.",
    "other_industries": "(Industrial grade 85%) Preservative and antibacterial agent in livestock feed; leather tanning and textile dyeing; coagulant for rubber production; cleaning agent (descaler); chemical intermediate."
  },
  {
    "name": "phosphoric Acid",
    "cas_no": "7664-38-2",
    "cins_no": "",
    "molecular_formula": "H3O4P",
    "discription": "Phosphoric Acid (Orthophosphoric acid) is a mineral acid. Pure phosphoric acid is a white solid, but it is commonly available as an aqueous solution (typically 75% or 85%), which is a colorless, odorless, viscous liquid.",
    "typical_properties": "Formula Weight: 97.995. Physical Properties: transparency liquid.",
    "packing": "25 kg",
    "food_idustry": "(Food grade 85%, E338) Widely used as an acidulant, flavoring agent, and pH adjuster in soft drinks (especially colas), processed foods, and dairy products.",
    "pharmaceutical_industry": "Used as an acidulant and pH adjuster in pharmaceutical formulations; dental etchant; component of some anti-nausea medications.",
    "other_industries": "(Industrial grade 85%) Production of phosphate fertilizers; rust remover; metal surface treatment (phosphating); electrolyte in phosphoric acid fuel cells; catalyst; food additive."
  },
  {
    "name": "Sodium bisulfate",
    "cas_no": "7681-38-1",
    "cins_no": "",
    "molecular_formula": "HNaO4S",
    "discription": "Sodium Bisulfate (Sodium Hydrogen Sulfate, niter cake) is the sodium salt of the bisulfate anion. It is an acid salt formed by partial neutralization of sulfuric acid by sodium hydroxide.",
    "typical_properties": "Formula Weight: 120.06. Physical Properties: Gray-white particles, crystal or powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "(Industrial grade) Acidulant for lowering pH in swimming pools and industrial water treatment; metal cleaning and pickling; component of some cleaning products; food processing aid (pH control)."
  },
  {
    "name": "Bis(hydroxyammonium)sulfate",
    "cas_no": "10039-54-0",
    "cins_no": "",
    "molecular_formula": "H8N2O6S",
    "discription": "Hydroxylamine Sulfate (Bis(hydroxyammonium)sulfate) is the sulfuric acid salt of hydroxylamine. It is a white crystalline solid.",
    "typical_properties": "Formula Weight: 164.138. Physical Properties: White as a crystal or as a powder.",
    "packing": "25 kg",
    "food_idustry": "",
    "pharmaceutical_industry": "Reagent in the synthesis of various pharmaceutical compounds.",
    "other_industries": "(Industrial grade) Reducing agent in chemical synthesis; photographic developer; polymerization inhibitor; reagent for converting aldehydes and ketones to oximes; textile industry."
  }
]