[
    {
        "name": "Antimony trioxide",
        "cas_no": "1309-64-4",
        "cins_no": "215-175-0",
        "molecular_formula": "O3Sb2",
        "discription": "Antimony trioxide (chemical formula: Sb2O3) is an inorganic compound. The natural product is called antimony flower, commonly known as antimony white. It is mainly used as a pigment, flame retardant, mordant, catalyst, and can also be used to synthesize antimony salts.  ",
        "typical_properties": "White crystalline powder, melting point 655℃, boiling point 1550℃, soluble in concentrated hydrochloric acid, sulfuric acid, alkaline solution and hot tartaric acid solution, slightly soluble in water, dilute nitric acid and dilute sulfuric acid.  Appearance  White Powder  Sb2O3(%)  99.5 min  99.8 min  As2O3/As(%)  0.06 max  0.02 max  PbO/Pb(%)  0.1 max  0.02 max  Fe2O3/Fe(%)  0.006 max  0.003 max  CuO(%)  0.002 max  -  Se(%)  0.005 max  -  Whitness(%)  95 min  95 min",
        "packing": "In 25kgs,1000kgs bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Flame retardant for wide range of plastics, rubbers, paper and textiles. Catalyst in PET production. Activator in glass industry. Flocculant in Titanium Dioxide production. Paints and Adhesives industries. Pigments, Ceramic frites.  "
    },
    {
        "name": " Barium sulfate",
        "cas_no": " 7727-43-7",
        "cins_no": "231-784-4",
        "molecular_formula": "BaO4S",
        "discription": "Barium sulfate, also known as barium white, is a white crystalline solid with the chemical formula BaSO4. It is almost insoluble in water and other traditional solvents, but soluble in concentrated sulfuric acid. Barite is the main component of barite, which is a common barium ore. Barium sulfate is a common laboratory and industrial chemical.  ",
        "typical_properties": "Odorless, tasteless powder. Soluble in hot concentrated sulfuric acid, almost insoluble in water, dilute acid, and alcohol. Aqueous suspension solution is neutral to litmus paper. Barium Sulfate(%)  98 min  Volatile on 105°C(%)  0.3 max  Water Solubles(%)  0.3 max  Fe(%)  0.004 max  Whiteness  92 min  Oil absorption/(g/100g)  15-30  pH value  6.5-7.5 ",
        "packing": "In 25kgs bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Barium sulfate has many commercial applications. It is used either as natural barite, or precipitated BaSO4.  The precipitated salt in combination with equimolar amount of co-precipitated zinc sulfide formerly was used as a white protective  coating pigment. It is used as an additive in drilling mud in crude oil, well drilled to lubricate and cool the drilling bit, and to plaster  the walls of the drill hole to prevent caving. It is used as a filler in automotive paints, plastics and rubber products.  It also is used as a filler in polyurethane foam floor mats, white sidewall rubber tires and as a flux and additive to glass to  increase the refractive index. Medically used as the agent (barium meal) for X-rays on the gut and stomach. Barium sulfate is  the only non-toxic barium salts. It can be used in analysis reagents, electronics, instrumentation, metallurgy and other industries.  It can also be used as a white pigment and an administrated agent upon stomach X-ray angiography; it can also used as copper  flux, drilling mud weight enlarging agent and the filling agent of rubber, paper, and plastic."
    },
    {
        "name": " Calcium hypochlorite",
        "cas_no": "7778-54-3",
        "cins_no": " 600-072-9",
        "molecular_formula": "H2MnO5S",
        "discription": "Calcium hypochlorite is an inorganic compound with the chemical formula Ca(ClO)2. It is commonly used in the bleaching process in chemical production. It plays an important role in industrial production due to its rapid onset and outstanding bleaching effect.   ",
        "typical_properties": "White powder, soluble in water, insoluble in ethanol.  Strong oxidants, water or moist air can cause combustion and explosion, and mixing with alkaline substances can cause explosion. Contact with organic matter is dangerous to cause combustion, and heat, acid or sunlight will decompose and release irritating chlorine gas. 65% GRADE  Appearance  White Powder or Granules or Tablet  Chlorine content(%)  65 min  Moisture(%)  5.0 max  70% GRADE  Appearance  White Powder or Granules or Tablet  Chlorine content(%)  70 min  Moisture(%)  4.0",
        "packing": "In 50 kgs iron drum or 45 kgs plastic drum  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Calcium hypochlorite is used by many paper conservationists to bleach archival papers, and it is used as an oxidizing agent to reduce the effects of foxing. Any hypochlorite of calcium, commercial products contains 50 to 75% available chlorine. It is used as a bleaching agent (paper, textiles), bactericide, deodorant, water Purification, sterilizer, disinfectant for swimming pools, fungicide and in sanitary Installations.  "
    },
    {
        "name": " Sodium Hydroxide",
        "cas_no": " 1310-73-2",
        "cins_no": "215-185-5",
        "molecular_formula": "NaOH",
        "discription": "Caustic Soda,Sodium hydroxide (NaOH), also known as lye and caustic soda, is an inorganic compound. It is a white solid and highly caustic metallic base and alkali salt which is available in pellets, flakes, granules, and as prepared solutions at a number of different concentrations. Sodium hydroxide is also widely used in making soaps and detergents, Sodium hydroxide was originally used for soap manufacture, but now has a wider variety of functions. Sodium Hydroxide is used for sodium hypochlorite which is used as a household bleach and disinfectant and for sodium phenolate used in antiseptics and for the manufacture of Aspirin.   ",
        "typical_properties": "White flake or granular, can dissolve in water to form an alkaline solution, and can also dissolve in methanol and ethanol.  This alkaline substance is deliquescent and will absorb water vapor in the air, as well as acidic gases such as carbon dioxide and sulfur dioxide. Appearance  White, Powder, Flakes, Pearls or Solid  NaOH(%)  99.0 min  Na2CO3(%)  0.5 max  NaCl(%)  0.1 max  NaSO4(%)  0.1 max  Fe2O3(%)  0.004 max",
        "packing": "In 25kgs/bag,50kgs/bag, 1,000kgs/Bag  ",
        "food_idustry": "my country's \"Food Additives Use Hygiene Standard\" (GB 2920-1996) stipulates: It can be used as a processing aid and used in appropriate amounts according to production needs.",
        "pharmaceutical_industry": "1. Chemical experiments  It can be used for chemical experiments. In addition to being used as a reagent, it can also be used as an alkaline desiccant due to its strong water absorption and deliquescent properties.",
        "other_industries": "2. Chemical industry  Sodium hydroxide is widely used in the national economy, and many industrial sectors need sodium hydroxide. The sector that uses the most sodium hydroxide is the manufacture of chemical drugs, followed by papermaking, aluminum smelting, tungsten smelting, rayon, artificial cotton and soap manufacturing. In addition, in the production of dyes, plastics, pharmaceuticals and organic intermediates, the recycling of old rubber, the production of metallic sodium, the electrolysis of water and the production of inorganic salts, the production of borax, chromium salts, manganates, phosphates, etc., a large amount of caustic soda is also used. 4. Water treatment  Sodium hydroxide is widely used in water treatment. In sewage treatment plants, sodium hydroxide can reduce the hardness of water through neutralization reactions. In the industrial field, it is a regeneration agent for ion exchange resin regeneration. Sodium hydroxide is highly alkaline and relatively soluble in water.    5. Metallurgy  Sodium hydroxide is used to process bauxite, which contains alumina, which is the raw material for making aluminum."
    },
    {
        "name": "Potassium tripolyphosphate",
        "cas_no": "13845-36-8",
        "cins_no": "237-574-9",
        "molecular_formula": "H6KO10P3",
        "discription": "Potassium tripolyphosphate is an inorganic compound.In industry, it is mainly used for soil improvement, oil emulsification, buffering agent for liquid detergents, etc. In the food industry, it is used as a tissue improver, chelating agent, water treatment agent, etc.  ",
        "typical_properties": "White granules or powder. Melting point 620～640℃, easily hydrolyzed, alkaline in aqueous solution.  TECH GRADE  FOOD GRADE  Appearance  White powder  Content (K5P3O10,%)  90 min  90 min  P2O5(%)  46 min  46 min  K2O(%)  51 min  51 min  Water insolubles(%)  2 max  1 max  pH of 1% water solution  9.2-10.1  9.2-10.1  F(ppm)  /  5 max  Heavy Metals (as Pb,ppm)  /  10 max  Pb(ppm)  /  3 max  As(ppm)  /  2 max ",
        "packing": "In 25kg bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "It is mainly used in the industry for soil improvement, oil emulsification, buffering agent for liquid detergents, etc. It is a highly efficient phosphorus-potassium compound fertilizer. Adding appropriate trace elements can make multi-element highly efficient compound fertilizer. It is used as a tissue improver, chelating agent and water retaining agent in the food industry. It can be used in broth, quick-frozen shrimp dumplings, milk powder, cream powder, cheese, condensed milk, cream, cured meat products, and has good solubility in the solution.  "
    },
    {
        "name": " Manganese sulfate (Monohydrate)",
        "cas_no": " 13601-19-9",
        "cins_no": "600-072-9",
        "molecular_formula": "H2MnO5S",
        "discription": "Manganese sulfate monohydrate is an inorganic salt that often exists in the form of monohydrate. It is manganese sulfate and has good solubility. Manganese sulfate monohydrate can be used as an important chemical raw material for the preparation of other manganese compounds and materials. It can be used as a trace element fertilizer to supply the manganese element required by plants. It can be used as an electrolyte and anode material in batteries. It can be used as an analytical reagent, food additive, and nutritional additive. It can be used in the preparation of culture media.   ",
        "typical_properties": "Pink Hygroscopic Powder or Granular. Soluble in water, insoluble in ethanol. Starts to lose crystal water when heated above 200℃, loses most of the crystal water at about 280℃, becomes anhydrous salt melt at 700℃, starts to decompose at 850℃, releases sulfur trioxide, sulfur dioxide or oxygen depending on the conditions.  Appearance  Pink Hygroscopic Powder or Granular  Mn(%)  31.8 max  Heavy metals( as Pb,ppm )  10 max  As(ppm)  5 max  Cd(ppm)  10 max",
        "packing": "In 25 kgs, 50 kgs, 1,000 kgs in Bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Manganese sulfate monohydrate is one of the important trace element fertilizers. It can be used as base fertilizer, seed soaking, seed dressing, topdressing and foliar spraying. It can promote crop growth and increase yield. In animal husbandry and feed industry, it is used as a feed additive to make livestock and poultry grow well and have a fattening effect. It is also the raw material for processing paint and ink drying agent manganese naphthoate solution. It is used as a catalyst in the synthesis of fatty acids. In addition, it can also be used as a raw material for papermaking, ceramics, printing and dyeing, ore flotation, electrolytic manganese production and the raw material for manufacturing other manganese salts.  "
    },
    {
        "name": "Phosphorous acid",
        "cas_no": "13598-36-2",
        "cins_no": "  237-066-7",
        "molecular_formula": "H3O3P",
        "discription": "Phosphorous acid and phosphite are used as reducing agents in chemical industry because of easy oxidation property to phosphoric acid. They are used as antioxidant, stabilizer and chelating agent in plastic system. They are used as solvent in paint and as flame retardant on fibres. They are used as a chemical intermediate in the production of pharmaceutical ingredients, pesticides, optical brighteners and in lubricant additives and adhesives.   ",
        "typical_properties": "Colorless to light yellow ice-like crystals, easily soluble in water and ethanol  Appearance  Clear to yellowish Crystal  Phosphorous acid(%)  98.5 min  Phosphate(%)  0.2 max  Chloride(%)  0.015 max  Sulfate(%)  0.008 max  Heavy metals(ppm)  15 max  Iron(ppm)  15 max",
        "packing": "In 25kg bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Water treatment：  1.Sodium phosphite can be used in the field of water treatment to remove chlorine and heavy metal ions in tap water, making the water purer and easier to drink.  2. In industrial water treatment, phosphorous acid can be used as a water treatment agent to reduce the hardness of water and dissolve impurities such as rust.    Metal processing field：  1. Phosphorous acid can be used as a metal etchant, often used in the semiconductor industry and electronic engineering.  2. Phosphorous acid can be used for metal cleaning and surface treatment, and is often used for surface treatment of mechanical parts such as automobile engines.    Fire retardant：  1. Phosphorous acid can be used for fire prevention and flame retardant treatment of chemical materials, inhibiting the spread of fire and reducing the burning rate.  2. Phosphorous acid has the characteristics of insect prevention, anti-corrosion, and moth prevention, and can be used for fire prevention treatment in the wood and pulp industry.    Other industries：  1. In the printing and dyeing and dyeing industry, phosphorous acid as a reducing agent can reduce and remove impurities contained in natural cotton and promote the adsorption of dyes.  2. Phosphorous acid is also used in food additives and can be used as a preservative and acidifier."
    },
    {
        "name": "Poly Aluminum Chloride",
        "cas_no": "1327-41-9",
        "cins_no": "215-477-2",
        "molecular_formula": "AlClHO",
        "discription": "Polyaluminium chloride with different purity has different uses and colors.     White powder is used in paper industry,medicine,sugar refining,cosmetic additives,daily chemical industry;       Yellow powder is used for domestic water treatment;     yellow brown powder used in industrial wastewater, industrial circulating water and urban sewage purification.",
        "typical_properties": "High purity grade Poly Aluminium Chloride-white powder  Al2O3 / % ≥\u000129.5 Basicity / %\u000160-85 Density (20ºC) /(g/cm3) ≥\u0001--- Water insoluble / % ≤\u00010.3 PH value (10g/L water solution)\u00013.5-5.0 Drinking warter grade Poly Aluminium Chloride-light yellow powder Al2O3 / % ≥\u000130 Basicity / %\u000160-85 Density (20ºC) /(g/cm3) ≥\u0001--- The mass fraction of insoluble / % ≤\u00010.3 PH value (10g/L water solution)\u00013.5-5.0 Industrial grade Poly Aluminium Chloride--yellow brown powder Al2O3 / % ≥\u000129-30 Basicity / %\u000160-90 Density (20ºC) /(g/cm3) ≥\u0001--- Water insoluble / % ≤\u00010.3 PH value (10g/L water solution)\u00013.5-5.0",
        "packing": "In 25kg bag, inner plastic film, outer plastic woven bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "High purity grade pac is used in paper industry,medicine,sugar refining,cosmetic additives,daily chemical industry;     Drinking water grade pac   is used for domestic water treatment;     Industrial grade pac used in industrial waste water, industrial circulating water and urban sewage purification.  "
    },
    {
        "name": "Polyacrylamide",
        "cas_no": "9003-05-08",
        "cins_no": "231-545-4",
        "molecular_formula": " (C3H5NO)x",
        "discription": "Polyacrylamide, also known as flocculant, is widely used in petroleum exploitation, water treatment, textile, chemical industry, printing and dyeing, papermaking and other industries. It is divided into anionic polyacrylamide, cationic polyacrylamide and non-ionic polyacrylamide.  Anionic polyacrylamide is soluble in water in any proportion and insoluble in organic solvents.  Cationic polyacrylamide is a linear polymer compound. Because it has a variety of active genes, it can form hydrogen bonds with many substances by affinity and adsorption.  Nonionic polyacrylamide is a water-soluble polymer. According to a certain number of polar groups contained in the molecular chain, by absorbing solid particles suspended in water, bridging between particles or through charge neutralization, particles agglomerate to form large flocs.",
        "typical_properties": "White crystalline powder, sparingly soluble in cold water, but dissolves better in warm water.  Item\\Type\u0001Appearance\u0001Solid content (%)\u0001Molecular weight (million)\u0001Charge density (mole %)\u0001PH (0.1%SOL) Anionic\u0001White granule\u000188 min\u000112-36\u000110-40\u00017-14 Cationic\u0001White granule\u000188 min\u00018-12\u0001-\u0001- Nonionic\u0001White granule\u000188 min\u00012-12\u00015.0 max\u00017-8",
        "packing": "In 25kgs/bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Anionic polyacrylamide is mainly used for flocculation and sedimentation of various industrial wastewaters, sedimentation and clarification treatment, such as  iron and steel plant wastewater, electroplating plant wastewater, metallurgical wastewater, coal washing wastewater and other sewage treatment.    Cationic polyacrylamide is suitable for wastewater treatment with high organic colloid content in dyeing, papermaking, food, construction,  mineral processing and other industries.    Non-ionic polyacrylamide is mainly used for flocculation and sedimentation of various industrial wastewaters, sedimentation and clarification. Such as papermaking and pulp wastewater treatment, wastewater treatment in mineral processing and metal smelting processes, etc."
    },
    {
        "name": "Potassium bicarbonate",
        "cas_no": " 298-14-6",
        "cins_no": " 206-059-0",
        "molecular_formula": "KHCO3",
        "discription": "Potassium Bicarbonate is used in baking powder and soft-drinks. It is used as a CO2 fire extinguishers. It is added to some detergents for buffering capacity. It is also used as an antacid.   ",
        "typical_properties": "Colorless, odorless, transparent monoclinic crystals or white crystalline powder. Stable in air. Soluble in water, the aqueous solution is weakly alkaline due to hydrolysis, and no basic salt is precipitated with magnesium salt solution. Insoluble in ethanol.  Appearance  White crystal powder  Assay(%)  98.5 min  Chloride(%)  0.05 max  Sulfate(%)  0.05 max  Fe(%)  0.02 max  Water(%)  0.5 max  Heavy metals(ppm)  10 max",
        "packing": "In 25kg bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": "It is used as an analytical reagent, baking powder, foaming salt, fire extinguishing agent for pharmaceuticals, petroleum and chemicals, and is also used to produce other potassium salts such as potassium carbonate, potassium acetate, potassium arsenite, etc.   Potassium bicarbonate can be used as a substitute for sodium bicarbonate in baking, acting as a leavening agent, producing  carbon dioxide, and thus reducing the sodium content of food. In a low-sodium diet, sodium bicarbonate is one of the ingredients  of baking powder.    As a low-cost, non-toxic salt base, potassium bicarbonate can be used to adjust acidity and is widely used in the pharmaceutical  and brewing industries. In addition, potassium bicarbonate can improve the taste of bottled water and is also used in the production  of carbonated beverages and vitamin C effervescent tablets.",
        "other_industries": null
    },
    {
        "name": "Potassium hydroxide",
        "cas_no": " 1310-58-3",
        "cins_no": "  215-181-3",
        "molecular_formula": "KOH",
        "discription": "Potassium hydroxide is an inorganic compound with the chemical formula KOH. It is a common inorganic base with strong alkalinity. It is soluble in water and ethanol and slightly soluble in ether. It easily absorbs moisture in the air and deliquesces. It absorbs carbon dioxide to form potassium carbonate. It is mainly used as a raw material for the production of potassium salts and can also be used in electroplating, printing and dyeing, etc.  ",
        "typical_properties": "White crystalline powder, soluble in water, ethanol, slightly soluble in ether. Appearance  White flakes  Assay(%)  90.0 min  Carbonate(%)  0.5 max  Chlorides(%)  0.01 max  Sulphates(ppm)  10 max  Iron  3 max  Heavy metal(ppm)  10 max  Nickel(ppm)  5 max",
        "packing": "In 25kg, 50kg bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "1. Used in electroplating, engraving, lithography, etc.  2. Used as raw material for potassium salt production, such as potassium permanganate, potassium carbonate, etc.  3. In the pharmaceutical industry, it is used to produce potassium borohydride, spironolactone, safranolol, testosterone propionate, progesterone, vanillin, etc.  4. In the light industry, it is used to produce potassium soap, alkaline storage batteries, and cosmetics (such as cold cream, vanishing cream and shampoo).  5. In the dye industry, it is used to produce vat dyes, such as vat blue RSN, etc.  6. Used as analytical reagents, saponification reagents, and absorbents for carbon dioxide and moisture.  7. In the textile industry, it is used for printing and dyeing, bleaching and mercerization, and is used in large quantities as the main raw material for the manufacture of artificial fibers and polyester fibers. It is also used to make melamine dyes.  8. It is also used in metallurgical heating agents and leather degreasing."
    },
    {
        "name": " Potassium Persulfate",
        "cas_no": " 7727-21-1",
        "cins_no": "231-781-8",
        "molecular_formula": "K2O8S2",
        "discription": "Potassium persulfate is the inorganic compound with the formula K2S2O8. Also known as potassium peroxydisulfate, it is a  white solid that is sparingly soluble in cold water, but dissolves better in warm water. This salt is a powerful oxidant, commonly  used to initiate polymerizations.",
        "typical_properties": "White crystalline powder, sparingly soluble in cold water, but dissolves better in warm water.  Appearance\u0001White crystalline powder Purity (K2S2O8,%)\u000199.0 min Free Acid(%)\u00010.1 max Iron（Fe,%）\u00010.001 max Moisture(%)\u00010.15 max Ammonium Salt(%)\u00010.50 max Active oxygen(%)\u00015.86 min Heavy metal (as Pb,%)\u00010.0005 max Manganese（Mn,%）\u00010.0001 max",
        "packing": "In 25Kgs/bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "Mainly used as a disinfectant and fabric bleach. Industrial dyes and inorganic salts are used as the oxidant. Synthetic rubber industry as emulsion polymerization initiators. Synthetic resin is used as a polymerization accelerator. In addition, the terms used in the steel, photographic industry, and medicine.  "
    },
    {
        "name": "Sodium carbonate",
        "cas_no": "497-19-8",
        "cins_no": "207-838-8",
        "molecular_formula": "CH2O3.2Na",
        "discription": "Sodium carbonate   commonly occurs as a crystalline heptahydrate, which readily effloresces to form a white powder, the monohydrate. Pure sodium carbonate is a white, odorless powder that is hygroscopic (absorbs moisture from the air). It has a strongly alkaline taste, and forms a moderately basic solution in water. Sodium carbonate is well known domestically for its everyday use as a water softener.  ",
        "typical_properties": "White powder, a strong electrolyte, easily soluble in water, and alkaline. It has the general properties of salt.  Item  Standard                                       Na2CO3 (%)  99.2 min  NaC1(%)  0.70 max  Fe(%)  0.0035 max  Heavy metals (As Pb,%)  0.0010 max  As(%)  0.0002 max  Non water soluble matter (%)       0.03 max",
        "packing": "In 25kg kraft paper bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "The main industrial application areas of sodium carbonate are flat glass, daily glass, synthetic washing powder, neutralization of acidic waste, alumina and other industries.  In production and life, sodium carbonate is used to make pastries, prepare sodium hydroxide, etc., or as a formula for various detergents. It is used as a softener for water purification."
    },
    {
        "name": "Sodium Chlorate",
        "cas_no": "7775-09-09",
        "cins_no": " 231-887-4",
        "molecular_formula": "NaClO3",
        "discription": "Sodium chlorate is an inorganic compound with the chemical formula NaClO3. It is a white crystalline powder that is readily soluble in water. It is hygroscopic. It decomposes above 300 °C to release oxygen and leaves sodium chloride. Several hundred million tons are produced annually, mainly for applications in bleaching pulp to produce high brightness paper.  ",
        "typical_properties": "Sodium chlorate is an inorganic compound with the chemical formula NaClO3. It is a white crystalline powder that is readily soluble in water. It is hygroscopic. It decomposes above 300 °C to release oxygen and leaves sodium chloride. Several hundred million tons are produced annually, mainly for applications in bleaching pulp to produce high brightness paper.  Sodium Chlorate(%)\u000199 min Moisture(%)\u00010.3 max Water Insoluble matter(%)\u00010.02 max Chloride(as Cl,%)\u00010.15 max Sulfate(%)\u00010.01 max Chromate(%)\u00010.005 max Fe(%)\u00010.005 max Appearance\u0001White crystal powder",
        "packing": "In 25kg bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "1.Sodium Chlorate use for sodium chlorate is for making chlorine dioxide (ClO2).    2.All other, less important chlorates are derived from sodium chlorate, usually by salt metathesis with the corresponding chloride.    3.All perchlorate compounds are produced industrially by the oxidation of solutions of sodium chlorate by electrolysis.    4.Sodium chlorate is used as a non-selective herbicide.    5.Sodium chlorate has a soil sterilant effect.    6.it is used in chemical oxygen generators, such as those in commercial aircraft.    7.Sodium chlorate can be mixed with sucrose sugar to make a highly explosive fuel, similar to that of gunpowder, that burns in airtight spaces.    8.Sodium chlorate can be used with hydrochloric acid (or also sodium chlorate and sodium chloride, the reaction of which generates HCl) to chlorinate aromatic compounds without the use of organic solvents. In this case its function is to oxidize the HCl to obtain either HOCl or Cl2 (depending upon the pH) in-situ which are the active chlorinating agent."
    },
    {
        "name": "Sodium ferrocyanide",
        "cas_no": "  13601-19-9",
        "cins_no": "215-566-6",
        "molecular_formula": "Na4Fe(CN)6",
        "discription": "Sodium Ferrocyanide is the salt containing radical Fe(CN)64- (negative tetravalent); soluble in water but insoluble in alcohol. It is the main component of Prussian blue pigment, used for the manufacture of inks and paints and bluing in laundry and dyeing. It is used for removal of mercaptans from petroleum fuels and gas. It is used in making Sodium Ferricyanide. Other applications include photography, tanning, explosives, metal treatments and snow treatment.   ",
        "typical_properties": "Pale yellow crystals. Soluble in water, insoluble in alcohol.  Appearance  Yellow crystals  Content(%)  98.0 min ( Decahydrate )  NaCl(%)  0.2 max  NaCN(%)  0.1 max  Water insolubles(%)  0.5 max  Moisture(%)  0.5 max",
        "packing": "In 25kg bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "It is mainly used as an important raw material in medicine, pigment, leather tanning, smelting and chemical industries.  It can also be used as an additive to melt snow in winter and prevent agglomeration. It can also be used to prevent  agglomeration in salt.  "
    },
    {
        "name": " Sodium hexametaphosphate",
        "cas_no": "10124-56-8",
        "cins_no": "233-343-1",
        "molecular_formula": "H7NaO18P6",
        "discription": "Sodium hexametaphosphate (SHMP) is an inorganic polyphosphate compound widely used as a chelating agent in food and beverage applications. Chelates alkaline earth and heavy metal cations, preventing precipitation and crystallization. SHMP binds to calcium, magnesium and iron ions contained in food and beverages, retaining them in solution and inhibiting their effects. Promotes hydration and water retention in processed foods.   ",
        "typical_properties": "Sodium hexametaphosphate is easily deliquescent in the air, easily soluble in water, and insoluble in organic solvents. In a neutral medium, the final hydrolysis product is orthophosphate.   TECH GRADE  FOOD GRADE  Appearance  White Powder  Active matter(%)  68 min  68 min  Insolubles in water(%)  0.05 max  0.05 max  pH  5.8 - 7.3  5.8 - 6.5  Fe(%)  0.005 max  0.005 max  As(ppm)  /  3 max  Heavy metals(ppm)  /  10 max",
        "packing": "In 25kg plastic woven bag or 1000kg plastic woven bag  ",
        "food_idustry": null,
        "pharmaceutical_industry": null,
        "other_industries": "1. Used as a water softener for boiler water and industrial water, and a water treatment agent for industrial circulating cooling water; also used as a corrosion inhibitor, flotation agent, dispersant, high-temperature binder, dyeing auxiliaries, metal surface treatment, rust inhibitor, detergent auxiliaries, cement hardening accelerator, etc.  2. A reagent for oxidizing aldehydes to carboxylic acids in the presence of H2O2 as an oxidant.  3. A polymer stabilizer and protective agent for the synthesis of SHMP-stabilized gold nanoparticles (Au–SHMP), which can be used to develop biocompatible molecular probes.  4. A capping agent for the synthesis of spatially stabilized luminescent nanoparticles of manganese-doped zinc sulfide (ZnS:Mn2+). Stabilizer for the synthesis of barium sulfate nanoparticles by precipitation method."
    }
]