[
    {
        "name": "1,3-Propane Sultone (1,3-PS)",
        "cas_no": " 1120-71-4",
        "cins_no": "214-317-9",
        "molecular_formula": "C3H6O3S",
        "discription": "1,3-PS is one of the most important intermediates in organic synthesis. Widely used in electroplating industry, its derivatives can improve the surface properties of materials. As an additive in electrolyte, addition of PS to none aqueous electrolytes can improve cycle life and storage stability of power lithium ion battery.\n",
        "typical_properties": "1,3-PS is colorless liquid（≥31℃）with relative density 1.392 g/mL or white crystal below 31℃. Its melting point is 30-33℃ with boiling point 180℃ and flashing point 110℃.\nAppearance\nColorless liquid （ crystal when temp is low ）\nPurity（by GC,%）\n  99.5 min\nChromaticity（APHA,Hazen）\n20 max\nMoisure(%)\n0.1 max\nAcidity(%)\n0.07 max",
        "packing": "In 50kg/200L, 100kg/100L or 25kg/25L.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as a surfactant, and is also used in the preparation of cosmetics and as a pharmaceutical intermediate in the pharmaceutical industry. It is also used in leather making, inks and sensitizing dyes to synthesize sulfonating agents. It is widely used in pharmaceutical chemicals, photosensitive materials, lithium batteries, biochemistry, textiles, lubrication, wastewater treatment, surface treatment and other industries.\n"
    },
    {
        "name": "2-Hydroxyethyl methacrylate (HEMA)",
        "cas_no": "123-86-4",
        "cins_no": " 212-782-2",
        "molecular_formula": "C6H10O3",
        "discription": "2-Hydroxyethyl methacrylate is an organic substance, a colorless, transparent, and easy-flowing liquid. Used in the synthesis of medical polymer materials, thermosetting coatings, adhesives, etc.\n",
        "typical_properties": "Colorless transparent liquid, easy to polymerize, boiling point: 95℃ (1333.22Pa) , soluble with water, alcohol, ether and other organic solvents.\nEster Content(%)\n98 min\nFree Acid(%)\n0.2 max\nInhibitor(ppm)\n200±20\nColor(#)\n20 max\nWater Content(%,m/m)\n0.15 max",
        "packing": "In 200kg iron-plastic drum or plastic drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. In plastic industry, it is used for the production of acrylic acid resin.\n2. In coating industry, it can be used for the production of double-component coating with epoxy resin, diisocyanate, melamino-formaldehyde resin. In oil industry, it can be used as additive for cleaning of lubricant.\n3. In electronic industry, used as dehydrating agent of electron microscope.\n4. In textile industry, as the adhesive for the production of fabric. In analytical chemistry, as chemical reagent.\n5. In addition, it can also be used for fiber treatment agent, adhesive, photosensitive resin, medical macromolecular material,etc."
    },
    {
        "name": "Acetonitrile",
        "cas_no": " 75-05-8",
        "cins_no": " 200-835-2",
        "molecular_formula": "C2H3N",
        "discription": "Acetonitrile, primary use is as an extraction solvent for unsaturated hydrocarbons (especially butadiene) and as a general purpose solvent for many compounds including fatty acids and oils based on its selective miscibility. It is used as a general purpose solvent for many compounds. It is used in the production of fibers, rubbers, and resins. It is used as a chemical intermediate in pesticide, perfume and pharmaceutical manufacturing. It is used in high-performance liquid and gas chromatographic analysis, in extraction and refining of copper.\n",
        "typical_properties": "1,3-PS is colorless liquid（≥31℃）with relative density 1.392 g/mL or white crystal below 31℃. Its melting point is 30-33℃ with boiling point 180℃ and flashing point 110℃. Miscible with water, soluble in most organic solvents such as ethanol and ether.\nPurity(%)\n99.9 min\nAcidity(%)\n0.03 max\nWater(%)\n0.03 max\nHCN(%)\n0.001 max\nAcrylonitrile(%)\n0.0025 max\nPropionitrile(%)\n0.03 max\nAcetone(%)\n0.0005 max\nAmmonia(ppm)\n5 max\nAllyl alcohol(ppm)\n1 max",
        "packing": "In 150 or 160 kgs in drum/ISOTANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Chemical analysis and instrumental analysis\n2. Hydrocarbon extraction and separation solvent\n3. Acetonitrile, an intermediate for the synthesis of medicines and pesticides\n4. Semiconductor cleaning agent\n5. Other applications\nIn addition to the above applications, acetonitrile can also be used as a raw material for organic synthesis, a catalyst or a component of transition metal complex catalyst. In addition, acetonitrile is also used in fabric dyeing and coating compounds, and it is also an effective stabilizer for chlorinated solvents."
    },
    {
        "name": "Adipic acid",
        "cas_no": "0124-04-09",
        "cins_no": "204-673-3",
        "molecular_formula": "C6H10O4",
        "discription": "Almost all of the commercial adipic acid is produced from cyclohexane through two sequent oxidation processes. Adipic acid has two carboxylic acid, -COOH, groups, which can yield two kinds of salts. Its derivatives, acyl halides, anhydrides, esters, amides and nitriles, are used in making target products such as flavoring agents, internal plasticizers, pesticides, dyes, textile treatment agents, fungicides, and pharmaceuticals through further reactions of substitution, catalytic reduction, metal hydride reduction, diborane reduction, keto formation with organometallic reagents, electrophile bonding at oxygen, and condensation.\n",
        "typical_properties": "White crystals or crystalline powder. Slightly soluble in water, slightly soluble in ether, easily soluble in alcohol, insoluble in benzene.\nAppearance\nWhite crystal powder\nPurity(%)\n99.7 min\nSolution Color\n5 max\nMoisture(%)\n0.2 max\nAsh(ppm)\n7 max\nIron(ppm)\n1.0 max\nNitrates(ppm)\n10.0 max",
        "packing": "In 25 kgs, 500 kgs, 1,000 kgs in bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is the main intermediate of polyamide and polyurethane, and the main raw material of nylon 66 fiber and engineering plastics, biodegradable plastics, polyurethane resin, synthetic leather (PU), synthetic rubber, etc. It can be used as food acidifier, ester plasticizer and textile treatment agent, as well as in the production of advanced lubricants, pharmaceutical intermediates, flavor and fragrance control agents, new single crystal materials, plastic foaming agents, coatings, pesticides, adhesives and flux, etc. It is an indispensable intermediate material for building a better new life in the future.\n"
    },
    {
        "name": "N,N-Dimethylbenzylamine (BDMA)",
        "cas_no": "103-83-3",
        "cins_no": "203-572-1",
        "molecular_formula": "C9H13N",
        "discription": "N,N-dimethylbenzylamine is an organic compound with the chemical formula C9H13N. It is commonly used as a catalyst, corrosion inhibitor, neutralizer, and also used in organic synthesis.\n",
        "typical_properties": "Colorless to light yellow liquid with ammonia smell, miscible with alcohol and ether, soluble in hot water, slightly soluble in cold water\nAppearance\nColorless to light yellow liquid\nAssay(GC,%)\n99.0 min\nColour(Hazen)\n100 max\nMoisture(%)\n0.5 max",
        "packing": "In 180 kgs in drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "N, N-dimethylbenzylamine can be used as a dehydrogenation catalyst, preservative, intermediate for the synthesis of 18-methylnorethindrone and triene norgestrel, precursor of D ring in the total synthesis of steroidal compounds, and can also be used to synthesize quaternary ammonium salts, catalyst for the production of new chlorpyrifos dehydrogenation halides, corrosion inhibitor, acid neutralizer, accelerator for electron microscope section embedding, etc. It is an important organic synthesis intermediate.\n"
    },
    {
        "name": "Benzalkonium chloride\n",
        "cas_no": " 8001-54-5",
        "cins_no": "264-151-6",
        "molecular_formula": "C17H30ClN",
        "discription": "Benzalkonium chloride is a quaternary ammonium-based cationic surfactant and a heterogeneous mixture of various even-numbered alkyl chain alkylbenzyl chlorides.Quaternary ammonium compounds are any of a group of ammonium salts in which organic radicals have been substituted for all four hydrogens of the original ammonium cation. They are prepared by treatment of an amine with an alkylating agent, show a variety of physical, chemical, and biological properties and most compounds are soluble in water and strong electrolytes.",
        "typical_properties": "Clear to light-straw colored liquid,Very soluble in water or ethanol, slightly soluble in ether.\nAppearance\nClear to light-straw colored liquid\nContent(%)\n80\nCarbon distribution\n60% C14 + 25% C12 + 15% C16 (Typical)\nAlcohol + Water\nBalance\nColor, APHA\n150 max\nFree amine(%)\n2.0 max\n50%\nAppearance\nClear to light-straw colored liquid\nContent(%)\n50\nCARBON DISTRIBUTION\n60% C14 + 25% C12 + 15% C16 (Typical)\nEthanl + Water\nBalance\nColor, APHA\n150 max\nFree amine(%)\n1.5 max",
        "packing": "In 200kgs drum, 950kgs IBC drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Benzalkonium chloride is a cationic surfactant and a non-oxidizing fungicide. It has a broad-spectrum and highly efficient bactericidal and algaecidal ability. It can effectively control the reproduction of bacteria and algae and the growth of slime in water. It has good slime stripping effect and certain dispersing and penetrating effects. It also has certain degreasing, deodorizing and corrosion inhibition effects.\n"
    },
    {
        "name": "Benzyl acetate",
        "cas_no": "0140-11-4",
        "cins_no": "205-399-7",
        "molecular_formula": "C9H10O2",
        "discription": "Benzyl acetate, is an organic compound with a chemical formula of C9H10O2. It is a colorless liquid with a rich jasmine aroma.Benzyl Acetate is used as a composition of perfumery (floral, fruity; reminiscent of jasmine)\nand flavouring (Reminiscent of apple and pear). It is used as a solvent in plastics and resin, cellulose acetate , nitrate, oils, lacquers, polishes and inks.",
        "typical_properties": "Clear colourless liquid,Insoluble in glycerol, but miscible with alcohols, ethers, ketones, aliphatic hydrocarbons, aromatic hydrocarbons, etc.\nAppearance\nColorless transparent liquid\nOdor\nSweet, floral, fruity, fresh odor\nAssay(%)\n99 min\nSpecific gravity\n1.052-1.056\nRefractive index\n1.500-1.504\nAcidity (mg koh/g)\n0.5 max\nChloride test\nNegative",
        "packing": "In 200 kgs iron drum, IBC drum, ISO Tank\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Mainly used as the main ingredient of jasmine extracts, soap flavoring agents and other ingredients of spices and flavors.\n"
    },
    {
        "name": "  Benzyl chloride",
        "cas_no": " 100-44-7",
        "cins_no": "202-853-6",
        "molecular_formula": "C7H7Cl",
        "discription": "Benzyl chloride is widely used as an intermediate for manufacturing organic compounds including benzyl alcohol, Benzyl Cyanide and other benzyl compounds. It is used in fuel as a gum inhibitor.Its oxidation reaction with an alkali produces Benzaldehyde, alpha-Chlorinated Toluenes, used in the end applications of perfumery, dyes, pharmaceuticals, synthetic resins, photographic chemicals, warfare chemicals, Penicillins, quaternary ammonium compounds, plasticizer and esters.\n",
        "typical_properties": "Clear liquid with unpleasant pungent smell.Boiling point:179.6℃, Freezing point:-39.2℃. It is not soluble in water, but soluble in   benzene, ethanol, ether, choloroform and other organic solvents. Benzyl Chloride is flammable when near heat, open flame or oxidant.\nSpec\nQualified grade\nSuperior grade\nColor(Hazen)\n30 max\n20 max\nPurity(%)\n99.0 min\n99.5 min\nWater(%)\n0.03 max\n0.03 max\nBenzylidene Chloride(%)\n-\n0.25 max\nToluene(%)\n-\n0.05 max\nChlorotoluene(%)\n-\n0.15 max\nAcidity(as HCl%)\n0.03 max\n0.03 max",
        "packing": "In 200kgs plastic drum, ISO tank, IBC drum.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Benzyl chloride is an important chemical and pharmaceutical intermediate, used as a dye intermediate and in the synthesis of tannins, spices, and medicines.\nIn the pharmaceutical and pesticide industries, benzyl chloride can be used to synthesize benzyl nitrile, phenylacetic acid, etc"
    },
    {
        "name": "Butyl Acetate",
        "cas_no": "123-86-4",
        "cins_no": "204-658-1",
        "molecular_formula": "CH3COOC4H9",
        "discription": "Butyl acetate is an excellent organic solvent with good solubility for ethyl cellulose, cellulose acetate butyrate, polystyrene, methacrylate resin, chlorinated rubber, and a variety of natural gums.\n",
        "typical_properties": "Colorless, transparent liquid with pleasant fruity odor. Lower homologues are insoluble in water; miscible with organic solvents such as alcohol, ether, and ketone. Flammable. Acute toxicity is low, but it is highly irritating to the eyes and nose, and can cause anesthesia at high concentrations.\nAppearance\nClear liquid\nPurity(GC,%)\n99.5 min\nWater(%)\n0.05 max\nAcidity( as HAc,% )\n0.005 max\nResidue on ignation (%)\n0.005max\nColor (Pt-Co,#)\n10 max",
        "packing": "170 kgs in drum or bulk into ISOTANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Butyl acetate is used as a solvent in the production of nitrocellulose varnish, fabrics, artificial leather and plastics, an extractant in the petroleum and pharmaceutical industries, and is also used in the compounding of spices and as a component of various flavors such as banana, pineapple, apricot and pear.\n"
    },
    {
        "name": "Cyanuric acid",
        "cas_no": "108-80-5",
        "cins_no": "203-618-0",
        "molecular_formula": "C4H6O3",
        "discription": "Cyanuric acid (also known as tricyanic acid),(2,4,6-triazinettriol); s-triazinetriol (sym-triazinetriol).The chemical formula is C3H3N3O3. There are two isomers, namely keto and enol structures, and it usually exists as a mixture of the two isomers.Cyanuric acid is mainly used to make chlorinated derivatives, used to synthesize cyanuric acid formaldehyde resin, epoxy resin, herbicide, etc.\n",
        "typical_properties": "White crystals, precipitated from water, with two crystal waters. Slightly bitter, basically non-toxic, soluble in hot water, slightly soluble in cold water, the aqueous solution is acidic, soluble in potassium hydroxide and sodium hydroxide aqueous solutions, insoluble in cold alcohol, ether, benzene and other organic solvents\nAppearanc\nWhite crystalline powder or granular or tablet\nContent\n98.5% min\npH\n4 - 5\nWater\n0.5% max\nInsolubes in DMF\n0.5% max\nAsh\n0.1% max\n",
        "packing": "In 25 kgs net bag or 1,000 kgs net jumbo bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Cyanuric acid,1,3,5-Triazine-2,4,6-triol is used in making of salts and esters of Cyanuric acid, or used in the synthesis of new antiseptic,water treatment agent, bleaching agent, chlorinated agent, brominating agent, antioxidant, coating, herbicide, cyanidation moderator of metal, or used as chlorine stabilizer, fire retardant of nylon, plastic and polyester, cosmetic additivees, or used in resin, etc."
    },
    {
        "name": "Cyclohexylamine",
        "cas_no": "108-91-8",
        "cins_no": "203-629-0",
        "molecular_formula": "C6H13N",
        "discription": "Cyclohexylamine is used in the manufacturing of chemical intermediates, insecticide intermediates, rubber accelerators, water treatment chemicals and corrosion inhibitors.\n",
        "typical_properties": "Cyclohexylamine is a colorless to yellow liquid, soluble in water and miscible in most organic solvents.\nAppearance\nColorless to light yellow clear liquid\nCyclohexylamine(%)\n\n99.3 min\nAniline(%)\n0.1 max\nDicyclohexylamine(%)\n0.1 max\nChroma\n30 max\nWater(%)\n0.1 max",
        "packing": "180 kg/iron drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. For the synthesis of desulfurizers, corrosion inhibitors, vulcanization promoters, emulsifiers, antistatic agents, latex coagulants,\npetroleum product additives, corrosion inhibitors, fungicides, pesticides and so on.\n2. This product is the raw material of food additive sweetener: Cyclohexylamine can be used to produce cyclohexylamine sulfonate and sodium cyclamate, which is a sweetener 30 times sweeter than sucrose. The product name is cyclamate.\n"
    },
    {
        "name": "Dicyclopentadiene",
        "cas_no": " 77-73-6",
        "cins_no": " 201-052-9",
        "molecular_formula": "C10H12",
        "discription": "DCPD hydrogenated resin is a water-white tackifying resin prepared by polymerization and hydrogenation with dicyclopentadiene (DCPD) as the main raw material. It has good tackifying properties, compatibility, thermal stability and light stability. Product use: DCPD hydrogenated resin is widely used in rubber, adhesives, printing inks, high-grade coatings, hot melt adhesives and other fields.\n",
        "typical_properties": "Colorless to light yellow liquid with ammonia smell, miscible with alcohol and ether, soluble in hot water, slightly soluble in cold water\n97% min\n85% min\nAppearance\nTransparent liquid, without mechanical impurities\nTransparent liquid, without mechanical impurities\nColority\n50 Hazen max\n100 Hazen max\nDCPD Content\n97% min\n85% min\nCyclopentadiene\n/\n/\nInhibitor(ppm)\nBHT: 100-150\nDMF: 1,000 max\nPTBC: 50-200\nMoisture(ppm)\n100 max\n200 max\nSO4(%)\n0.005 max\n0.005 max\nHeavy metals( as Pb,% )\n0.001 max\n0.001 max",
        "packing": "Bulk into ISOTANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Dicyclopentadiene can be used in high energy fuel, metal derivatives, DCPD petroleum resin, epoxy resin, unsaturated\npolyesters resins, polymer, norbornene, drug, flavor and fine chemicals; moreover, it can be alsoused to produce value-added\nchemicals such as pesticide, drug, flavor and fire retardant, etc.."
    },
    {
        "name": "Di Basic Ester",
        "cas_no": "95481-62-2",
        "cins_no": "",
        "molecular_formula": "C21H36O12",
        "discription": "Environmental-friendly high boiling point solvent DBE is the environmental-friendly high boiling point solvent with biodegradation, and is widely used in dope industry, printing ink industry and other fields.\n",
        "typical_properties": "Appearance\nColorless transparent liquid\nEster Content(%)\n99.0 min\nDimethyl Glutarate(%)\n55-65\nDimethyl Succinate(%)\n15-25\nDimethyl Adipate(%)\n10-25\nMoisture(%)\n0.1 max\nAcid Value (mg KOH /g)\n0.2 max\nColor (APHA)\n15 max\nDensity (20℃ g/ml)\n1.076-1.096\nDistillation Range(℃)\n195-230",
        "packing": "Iron drum or special plastic drum, 220kgs for net weight, IBC or ISOTANK.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "DBE is extensively applied in the fields of coil coating,auto painting,packaging coating,carpentry coating, can coating,insulating varnish coating,high-grade ink and foundry resin industry. DBE can be the substitute of isophorone,cyclohexanonel,ether type of toxic and traditional pungent odor solvents.\n"
    },
    {
        "name": "Dimer acid",
        "cas_no": "  61788-89-4",
        "cins_no": "500-148-0",
        "molecular_formula": "C36H64O4",
        "discription": "Dimer acid, usually refers to dimer fatty acid, is a complex mixture, dimer acid refers to the dimer of linear unsaturated fatty acid or unsaturated fatty acid ester with linoleic acid of natural oil as the main component, which is self-condensed by Diels-Alder cycloaddition reaction under the catalysis of white clay. It is a mixture of multiple isomers, in which the main components are dimer, a small amount of trimer or polymer and a trace amount of unreacted monomer.\n",
        "typical_properties": "Light yellow liquid, flash point 280-350℃. Soluble in acetone, ethanol, ether, aliphatic, naphtha and almost all other solvents.\nAppearance\nLight yellow liquid\nDimer acid(%)\n76 min\nMono acid(%)\n20 max\nTrimer acid(%)\n4 max\nColority(#)\nGarner 5 max\nAcidity(mg KOH/g)\n190 min\nSaponification( mg KOH/g)\n192 min\nViscosity(mPa.s,25 °C)\n2,000-3,000",
        "packing": "190 kgs net in drum/950 kgs net in IBC drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It has been widely used in the fields of synthetic printed circuit board materials, ink manufacturing, rocket engine materials, etc. The dimer acid with higher purity is a light yellow viscous liquid, and the dimer acid with lower purity is a reddish brown viscous liquid. It usually uses vegetable oil as raw material and reacts under high temperature and high pressure under the action of catalyst to obtain a crude product, and then undergoes molecular distillation to obtain a pure product.\n"
    },
    {
        "name": "Dimethyl Carbonate",
        "cas_no": "616-38-6",
        "cins_no": "210-478-4",
        "molecular_formula": "C3H6O3",
        "discription": "Dimethyl carbonate is an organic compound with the chemical formula C3H6O3. It is a low-toxic, environmentally friendly, and widely used chemical raw material. It is an important organic synthesis intermediate. Its molecular structure contains functional groups such as carbonyl, methyl, and methoxy. It has a variety of reaction properties and is safe, convenient, less polluting, and easy to transport in production.\n",
        "typical_properties": "Clear, colorless liquid with a pleasant odor. Denser than water and slightly soluble in water. Vapors are heavier than air. Used to make other chemicals and as a special purpose solvent.\nAppearance\nColorless transparent liquid\nContent(%)\n99.90 min\nMoisture(%)\n0.02 max\nMeOH Content(%)\n0.02 max\nDensity (20°C, g/cm³)\n1.071± 0.005\nColor (APHA Color)\n5 max",
        "packing": "200kg iron drum, IBC drum or ISO TANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Environmentally friendly green chemical product. Low toxicity solvents for toluene, xylene, ethyl acetate, butyl acetate, acetone or butanone in paints and adhesive industry.\n2. Ideal substitute of highly toxic product such as phosgene, dimethyl sulfate, and methyl chloroformate.\n3. Synthesis for polycarbonate, diphenyl carbonate, and isocyanate.\n4. Synthesis of anti-infective drugs, anti-inflammatory medicines, vitamin-class medicines and central nervous system drugs.\n5. Production of methyl isocyanate, carbamate drugs, anisole.\n6. Gasoline additives.\n7. Lithium battery electrolyte.\n"
    },
    {
        "name": "Dimethyl disulfide (DMDS)",
        "cas_no": " 624-92-0",
        "cins_no": "210-871-0",
        "molecular_formula": "C2H6S2",
        "discription": "Dimethyl disulfide (DMDS) is an organic chemical compound with the molecular formula CH3SSCH3. It is a flammable liquid with an unpleasant, garlic-like odor. The compound is colorless although impure samples often appear yellowish.\n",
        "typical_properties": "Light yellow transparent liquid. Insoluble in water, miscible with ethanol, ether and acetic acid. Has a foul odor, boiling point 109.7℃. Melting point -85℃.\nAppearance\nClear liquid\nAssay(%)\n99.5% min\nColor, APHA\n30 max\nWater(%)\n0.3 max",
        "packing": "In 200kgs drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Dimethyl disulfide (DMDS) is a widely used sulfur-containing organic compound, used in organic synthesis, methylsulfonic acid, tetramethylsulfonyl chloride and pesticide intermediates, and is also an organic solvent. In petroleum technology, it is used as an anti-corrosion and anti-coking agent for ethane cracking furnaces, a vulcanizing agent for gasoline hydrogenation catalysis, and an inhibitor of hydrogenation cracking in benzene nuclear dehydroxylation reactions. In the rubber industry, it can be used as a solvent, regeneration agent, softener, plasticizer, etc. In addition, dimethyl disulfide can also be used as an additive for fuels and lubricants, an intermediate for the preparation of pesticides and insecticides, and an inhibitor for some organic chemical reactions.\n"
    },
    {
        "name": "N,N-Dimethylcyclohexylamine (DMCHA)",
        "cas_no": " 98-94-2",
        "cins_no": " 202-715-5",
        "molecular_formula": "C8H17N",
        "discription": "N,N-dimethylcyclohexylamine is an organic compound with the chemical formula C8H17N. It is mainly used as an intermediate of catalysts and rubber accelerators, and can also be used for fabric treatment.\n",
        "typical_properties": "Colorless transparent liquid, insoluble in water, soluble in most organic solvents such as ethanol and ether.\nAppearance\nClear liquid\nPurity (GC,%)\n99 min\nMoisture(%)\n0.5 max",
        "packing": "In 160kgs drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as an intermediate for catalysts and rubber accelerators and can also be used for fabric treatment.\n"
    },
    {
        "name": "2,2-Dimorpholinodiethylether (DMDEE)",
        "cas_no": "6425-39-4",
        "cins_no": "229-194-7",
        "molecular_formula": "",
        "discription": "",
        "typical_properties": "Active content (GC):\n99% min\nAppearance:\ncolorless to yellow liquid\nWater:\n0.5 % max (also available with max 0.1 % water)",
        "packing": "210 kg drums",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Dimethyl sulfoxide",
        "cas_no": "67-68-5",
        "cins_no": "200-664-3",
        "molecular_formula": "C2H6OS",
        "discription": "Dimethyl sulfoxide (DMSO) is a sulfur-containing organic compound with the molecular formula (CH3)2SO. It is a colorless, odorless, transparent liquid at room temperature and a hygroscopic flammable liquid. It has the characteristics of high polarity, high boiling point, aprotic, miscible with water, extremely low toxicity, good thermal stability, and can be dissolved in most organic substances such as ethanol, propanol, benzene and chloroform. It is known as the \"\"universal solvent.\"",
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "",
        "cas_no": "Colorless, odorless, hygroscopic and flammable transparent liquid at room temperature. It has both high polarity as well as high-boiling point. It also has aprotic and water-miscible characteristics. It has low toxicity, good thermal stability, and is not miscible with paraffin. It is soluble in water, ethanol, propanol, ether, benzene and chloroform and many other kinds of organic substance.\nAppearance\nColorless transparent liquid\nPurity(%)\n99.9 min\nCrystallization point( ℃)\n18.25 min\nAcid value ( mgKOH/g )\n0.03 max\nMoisture(%)\n0.05 max\nRefractive index\n1.4775 - 1.4790\nTransmittancy(%)\n96 min",
        "cins_no": "In 225 kgs drum\n",
        "molecular_formula": "",
        "discription": "",
        "typical_properties": "A wide range of primary pharmacological actions of Dimethyl Sulfoxide (DMSO) has been documented in laboratory studies: membrane transport, effects on connective tissue, anti-inflammation, nerve blockade (analgesia), bacteriostasis, diuresis, enhancements or reduction of the effectiveness of other drugs, cholinesterase inhibition, nonspecific enhancement of resistance to infection, vasodilation, muscle relaxation, antagonism to platelet aggregation, and influence on serum cholesterol in emperimental hypercholesterolemia. This substance induces differntiation and function of leukemic and other malignant cells. DMSO also has prophylactic radioprotective properties and cryoprotective actions. It protects against ischemic injury\n",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Dioctyl sebacate (DOS)",
        "cas_no": "122-62-3",
        "cins_no": " 204-558-8",
        "molecular_formula": "C26H50O4",
        "discription": "Dioctyl sebacate, also known as dioctyl sebacate, has a molecular formula of C26H50O4 and is an ester organic compound, mainly used as a low-temperature plasticizer.\n",
        "typical_properties": "Transparent liquid. Insoluble in water, miscible with ethanol, ether and acetic acid. Has a foul odor, boiling point 109.7℃. Melting point -85℃.\nAppearance\nTransparent liquid, no suspension object\nColority ( Pt-Co )\n30 max\nPurity(%)\n99 min\nMoisture(%)\n0.1 max\nAcidity(mgKOH/g)\n0.04 max\nSpecific gravity(g/cm³)\n0.913-0.916",
        "packing": "In 200kgs drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Dioctyl Sebacate (DOS) is used as a plasticizer for PVC, Nitrocelluloses, Styrene resins, and synthetic rubbers where low temperature performance is required. DOS is also compliant with FDA CFR 21 for food contact materials. Dioctyl Sebacate can also be used in lubricants to allow more mobility at lower temperatures. DOS can be used as anti-frosting cable, artificial leather, outdoor cable, PVC linoleum, resins and synthetic rubbers. Dioctyl Sebacate provides a silky feel and spreads easily. Because of this, Dioctyl Sebacate finds use in the personal care industry and is found in deodorants and antiperspirants, makeup, skin conditioners, lotions, and sunscreens."
    },
    {
        "name": " Formic acid",
        "cas_no": "64-18-6",
        "cins_no": "200-579-1",
        "molecular_formula": "C4H6O2",
        "discription": "Formic acid is colorless fuming and inflammable liquid with strong irritating smell，Formic acid and its aqueous solution can dissolve many metals, metal oxides, hydroxides and salts. Formate can be dissolved in water and can be used as chemical cleaning agent. Formic acid does not contain chloride ion and can be used for cleaning equipment containing stainless steel materials.",
        "typical_properties": "It is a colorless, transparent, fuming liquid with a pungent odor, easily soluble in water, alcohol and ether. It has strong acidity and reducing properties.  \nAppearance\nClear liquid\nAssay(%)\n85 min\nColor index\n20 max\nAsh(%)\n0.02 max\nSulfate(%)\n0.002 max\nChloride(%)\n0.005 max\nIron(%)\n0.0005 max",
        "packing": "In 250kgs drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is one basic chemicals for organic Chemical, mainly used in Pesticides ,Leather, dye, medicine and rubber industry. Medicine industry: Amino acid, caffeine, vitamins B1,etc. Pesticide Industry: Triadimefon , triadimefon, MET, insecticidal ether,etc. Chemical Industry: Formamide, dimethylformamide, antioxidant，etc. Leather Industry: Tanning agents for leather.Dye Industry: Acid dye. Rubber Industry: Nature Rubber's coagulation. Steel Industry: Acid Cleaning for steel.Paper Industry: Pulp manufacturing, etc.Feed Industry: Make feed,etc."
    },
    {
        "name": " Furfuryl alcohol",
        "cas_no": "98-00-0",
        "cins_no": " 202-626-1",
        "molecular_formula": "C5H6O2",
        "discription": "Furfuryl alcohol is an important organic chemical raw material with a wide range of uses. It is an important heterocyclic compound and organic synthesis raw material in industrial production.\n",
        "typical_properties": "Colorless to light yellow transparent liquid，Soluble in water, miscible in ethanol, ether, benzene, chloroform; its vapor forms explosive mixture with air. It is easy to polymerize in acid to form a resin that is difficult to melt.Appearance\nColorless to light yellow transparent liquid\nContent(%)\n98.50 min\nWater(%)\n0.20 max\nAldehyde（%）\n0.40 max\nAcidity(mol/L)\n0.01\nCloud point（℃）\n9.0 max\nRefractive index\n1.485-1.488\nDensity\n1.129-1.135",
        "packing": "250kg iron drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used to produce acetylactic acid and furan resins with various properties. As a selective solvent, dispersant and lubricant, it is used in furfuryl alcohol resin, silt-formaldehyde resin and phenolic resin. Hydrogenation can produce tetrahydrofurfuryl alcohol. It is also a good solvent for varnish and pigment and rocket fuel. In addition, it is used in synthetic fibers, rubber, pesticides and foundry industries. At the same time, it can be used to make plasticizers, and its cold resistance is better than that of esters of butanol and octanol. It produces calcium fructose. It is an intermediate for synthesizing dyes and medicines, manufacturing chemical intermediates, and making pyridine."
    },
    {
        "name": "Glutaraldehyde",
        "cas_no": "111-30-8",
        "cins_no": "203-856-5",
        "molecular_formula": "C5H8O2",
        "discription": "Glutaraldehyde is an organic compound with the chemical formula C5H8O2.   It is often used as a fungicide, food industry processing aid, disinfectant, tanning agent, wood preservative, medicine and raw material for polymer synthesis, etc.\n",
        "typical_properties": "Colorless or light yellow transparent liquid. It is soluble in water and easily soluble in organic solvents such as ethanol and ether. 50% Solution, industrial grade\nContent(%)\n50 min\npH\n3 - 5\nBoiling point(℃)\nca 187\nMelting point (℃)\n-14\nDensity\n1.01 - 1.02\nMethanol(ppm)\n0.5 max/3 max/7 max\n25% Solution\nContent(%)\n25 min\nWater\nBalance\nColor, APHA\n50 max\nMethanol(%)\n0.5 max",
        "packing": "In 220kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Glutaraldehyde containing two aldehyde groups, it is used as a disinfectant. It is used in sterilizing medical and dental equipment which cannot be heat sterilized. It is used as a fixative for biological tissues and for leather tanning. It is used as a chemical intermediate to produce other compounds.\n"
    },
    {
        "name": "GLUTARIC ACID\n",
        "cas_no": "110-94-1\n",
        "cins_no": "203-817-2\n",
        "molecular_formula": "HOOC(CH2)3COOH\n",
        "discription": "",
        "typical_properties": "APPEARANCE\nWhite crystalline powder\nASSAY\n99% min\nMELTING POINT\n96-99 C\nMOISTURE\n0.2% max\nWATER INSOLUBLES\n0.1% max\nRESIDUE ON IGNITION\n0.1% max",
        "packing": "25 kgs net in drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Glutaric acid is used in the production of polyester polyols, polyamides, ester plasticizers and corrosion inhibitors. It is used in the synthesis of pharmaceuticals, surfactants and metal finishing compounds.\n"
    },
    {
        "name": "Glyoxal",
        "cas_no": "107-22-2",
        "cins_no": "  203-474-9",
        "molecular_formula": "C2H2O2",
        "discription": "Glyoxal is an organic compound with a molecular formula of C2H2O2 and a molecular weight of 58.036. It is a white or off-white crystalline powder (yellow prisms or irregular flakes, turning white after cooling). It is used as a pharmaceutical intermediate, fabric finishing agent, dye and dye intermediate.\n",
        "typical_properties": "Colorless or yellow deliquescent crystals or liquids, with green vapor. Soluble in ethanol, ether, and water.\nAppearance\nColorless liquid\nGlyoxal(%)\n40+/-0.5\nAcidity ( AS Hac,% )\n0.2 max\nColor(apha)\n15 max\nFormaldehyde(ppm)\n200 max",
        "packing": "In 250kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Glyoxal, difunctional low mole weight aldehyde, is a highly reactive intermediate used for the preparation of copolymers, dyes, pharmaceuticals, pesticides, corrosion inhibitors and photographic chemicals. It is used as a dispersant water soluble polymers, starches, cellulosic materials, proteins (casein, gelatin and animal glue), and polyhydroxyl groups. It is used in soil and cement stabilizing. It is also used to improve moisture resistance in paper, leather and glue. It is used in embalming fluids, for leather tanning, and for rayon shrink-proofing. It is used as a sulfide scavenger.\n"
    },
    {
        "name": "m-CHLOROANILINE\n",
        "cas_no": "108-42-9\n",
        "cins_no": "203-581-0\n",
        "molecular_formula": "ClC6H4NH2\n",
        "discription": "",
        "typical_properties": "APPEARANCE\nClear to light amber liquid\nPurity\n99.9% min\nAniline\n0.02% max\nOCA\n0.03% max\nPCA\n0.02% max\nWater\n0.1% max",
        "packing": "250 kgs in drum or bulk into ISOTANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Mainly used as an intermediate in the production of a number of products, including\nAgricultural chemicals, AZO dyes and pigments, bactericide or biocide and pharmaceuticals."
    },
    {
        "name": "Maleic anhydride",
        "cas_no": "108-31-6",
        "cins_no": "203-571-6",
        "molecular_formula": "C4H2O3",
        "discription": "Maleic Anhydride's biggest single use is in the manufacture of unsaturated polyester resins for use in fibre-reinforced plastics in the automotive, construction, marine, consumer goods and agricultural industries. Producers are working at capacity, but maleic supplies are barely adequate for market requirements due to planned and unplanned downtime in recent days and continued strong demand.",
        "typical_properties": "At room temperature, it is white crystal with a strong pungent odor, soluble in water, acetone, benzene, chloroform and most other organic solvents. Sales Specifiation( Naphthalene process/N-Butane process )\nAppearance\nWhite briquettes\nPurity(%)\n99.5 min\nSolidification point(°C)\n52.40 min\nMolten color(APHA)\n25 max",
        "packing": "In 25kgs bag , ISO TANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as raw material for the production of unsaturated polyester resin, alkyd resin, pesticide malathion, high-efficiency and low-toxic pesticide 4049, long-acting iodine amine, etc.\n"
    },
    {
        "name": "Melamine",
        "cas_no": "108-78-1",
        "cins_no": "203-615-4",
        "molecular_formula": "C3H6N6",
        "discription": "Melamine also called Cyanuramide, or Triaminotriazine, a colourless, is a crystalline substance belonging to the family of heterocyclic organic compounds, which are used principally as a starting material for the manufacture of synthetic resins. Mainly used in Melamine-formaldehyde resins, Lamination, Adhesive agents, Tableware, Flame retardant, Polyurethane foams, Paints, coating, paper, plastics, Pigments, Thermosetting plastics..",
        "typical_properties": "It is a white monoclinic crystal, almost odorless, slightly soluble in water (3.1g/L at room temperature), soluble in formaldehyde, acetic acid, hot ethylene glycol, glycerin, pyridine, etc., insoluble in acetone and ethers, harmful to the body, and cannot be used in food processing or food additives.\n Appearance\nWhite crystalline powder\nAssay\n99.8% min\nMoisture\n0.1% max\nAsh\n0.03% max\npH\n7.5-9.5\nColority ( APHA )\n20 max\nTurbidity ( Kaolin )\n20 max",
        "packing": "In 25kgs in bag and big bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Melamine is an important nitrogen heterocyclic organic chemical intermediate with urea as raw material. It is increasingly favored by people due to its environmental performance and wide range of uses. It is widely used in wood processing, plastics, coatings, water reducers, papermaking, adhesives, textiles, leather, electrical appliances, medicine, flame retardants and other industries."
    },
    {
        "name": "Methane sulfonic acid (MSA)",
        "cas_no": "75-75-2",
        "cins_no": "200-898-6",
        "molecular_formula": "CH4O3S",
        "discription": "Methane sulfonic acid is an organic compound with the chemical formula CH4O3S. Methanesulfonic acid is a raw material for medicine and pesticides. It can also be used as a dehydrating agent, coating curing accelerator, fiber treatment agent, solvent, and catalyst for esterification, esterification and polymerization reactions.\n",
        "typical_properties": "Clear, colorless liquid, soluble in water, alcohol and ether, but insoluble in alkanes, benzene, toluene, etc. It does not decompose in boiling water or hot alkali solution, and has a strong corrosive effect on metals such as iron, copper and lead. \n70%\n99%\nAppearance\nColorless to pale yellow liquid\nPurity(%)\n70 min\n99 min\nOxidizable matter(ppm）\n20 max\n20 max\nCl(ppm）\n10 max\n100 max\nFe(ppm)\n10 max\n10 max\nSulfate(ppm)\n200 max\n200 max\nHeavy metals(ppm)\n10 max\n10 max\nCOLOR (APHA)\n25 max\n50 max",
        "packing": "In 250kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Methylsulfonic acid has applications in the fields include: Electroplating and electrochemical processes/Alkylation, esterification and condensation reactions/Lead recovery/Chemical intermediate for manufacture of drugs and pesticides/Petroleum refining and lube oil additives /Extraction and process solvent/Plastic stabilizers.Methylsulfonic acid has applications in the fields include: Electroplating and electrochemical processes/Alkylation, esterification and condensation reactions/Lead recovery/Chemical intermediate for manufacture of drugs and pesticides/Petroleum refining and lube oil additives /Extraction and process solvent/Plastic stabilizers.\nMethylsulfonic acid has applications in the fields include: Electroplating and electrochemical processes/Alkylation, esterification and condensation reactions/Lead recovery/Chemical intermediate for manufacture of drugs and pesticides/Petroleum refining and lube oil additives /Extraction and process solvent/Plastic stabilizers.\nMethylsulfonic acid has applications in the fields include: Electroplating and electrochemical processes/Alkylation, esterification and condensation reactions/Lead recovery/Chemical intermediate for manufacture of drugs and pesticides/Petroleum refining and lube oil additives /Extraction and process solvent/Plastic stabilizers.\n"
    },
    {
        "name": "Methyl Acetate",
        "cas_no": "79-20-9",
        "cins_no": "  201-185-2",
        "molecular_formula": "C3H6O2",
        "discription": "Methyl acetate is mainly used to replace traditional solvents such as acetone, butanone, ethyl acetate, and cyclopentane. The United States used methyl acetate to replace acetone solvent in 2005. As a new type of organic solvent, methyl acetate is an organic solvent substance that is not restricted for use internationally. It can meet the new environmental protection standards of coatings, inks, resins, and adhesives. It is a green and environmentally friendly product encouraged by industrial policies.\n",
        "typical_properties": "Colorless transparent liquid, slightly soluble in water, miscible in organic solvents such as ethanol and ether.\nAppearance\nColorless transparent liquid\nChromaticity(Hazen, Pt-Co)\n10 max\nWater(%)\n0.05 max\nAcidity(% )\n0.05 max\nPurity (%)\n99.5 min\nTotal aldehyde ketone (%)\n0.10 max",
        "packing": "180kg iron drum, ISO Tank\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used in pharmaceutical, coating, ink, paint, adhesive, organic solvent required in leather production process, polyurethane foam blowing agent, thinner and other industrial fields.\n"
    },
    {
        "name": " Methyl Ethyl Ketone",
        "cas_no": "78-93-3",
        "cins_no": "",
        "molecular_formula": "C4H8O",
        "discription": "Methyl ethyl ketone is used as a solvent for lacquers, adhesives, cleaning materials to be electroplated, degreasing, rubber and rubber cement, printing inks, and paints, wood stains and varnishes, paint removers, in cleaning solutions, as a catalyst, and as a carrier.\n",
        "typical_properties": "Methyl ethyl ketone is a colourless liquid with a faint sweet odour.Methyl ethyl ketone is a flammable liquid. It is partially soluble in water, and soluble in most other organic solvents. It will float on water while it rapidly dissolves in it.\nPurity%(m/m)\n99.7%min\nMoisture(%)\n\n0.05% max\nAcidity (as acetic acid,%,m/m)\n0.003 max\nAlcohol(as butanol,%,m/m)\n0.3 max\nDensity(20°C,g/cm3)\n0.804-0.806\nInitial boiling point(°C)\n78.5 min\nDry point(°C)\n81.0 max\nInvolatile matter,mg/100ml\n5 max\nChroma( in Hazen,Pt-Co)\n10 max",
        "packing": "165kg iron drum /iso tank",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "MEK is used as a solvent for various coating systems, for example, vinyl, adhesives, nitrocellulose, and acrylic coatings. It is used in paint removers, lacquers, varnishes, spray paints, sealers, glues, magnetic tapes, printing inks, resins, rosins, cleaning solutions, and for polymerization. It is found in other consumer products, for example, household and hobby cements, and wood-filling products. MEK is used in dewaxing lubricating oils, the degreasing of metals, in the production of synthetic leathers, transparent paper and aluminum foil, and as a chemical intermediate and catalyst. It is an extraction solvent in the processing of foodstuffs and food ingredients. MEK can also be used to sterilize surgical and dental equipment.\nIn addition to its manufacture, environmental sources of MEK include exhaust from jet and internal combustion engines, and industrial activities such as gasification of coal. It is found in substantial amounts in tobacco smoke. MEK is produced biologically and has been identified as a product of microbial metabolism. It has also been found in plants, insect pheromones, and animal tissues, and MEK is probably a minor product of normal mammalian metabolism. It is stable under ordinary conditions but can form peroxides on prolonged storage; these may be explosive."
    },
    {
        "name": "Methyl Isobutyl Ketone (MIBK)",
        "cas_no": "0108-10-1",
        "cins_no": "    203-550-1",
        "molecular_formula": "C6H12O",
        "discription": "Methyl isobutyl ketone (MIBK, 4-methylpentan-2-one) is an organic compound with the condensed chemical formula (CH3)2CHCH2C(O)CH3. This ketone is a colourless liquid that is used as a solvent for gums, resins, paints, varnishes, lacquers, and nitrocellulose.",
        "typical_properties": "Colorless liquid with pleasant odor. It's stable. Slightly soluble in water and most organic solvents. Steam forms an explosive mixture with air. With strong local irritation and toxicity.\nPurity（%）\n99.7 min\nChrominance APHA\n10\nRelative density d202\n0.800-0.804\nBoiling range (95%)\n114-117\nAcidity as Acetic Acid (%)\n0.01 max\nNon-Volatile Matter (%)\n2\nWater Content WT (%)\n0.1 max",
        "packing": "Galvanized iron drum package, 165kg/drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "MIBK is used as a solvent for nitrocellulose, lacquers, and certain polymers and resins.Another major use is as a precursor to N-(1,3-dimethylbutyl)-N'-phenyl-p-phenylene diamine (6PPD), an antiozonant used in tires. 6PPD is prepared by reductive coupling of MIBK with 4-aminodiphenylamine.Unlike the other common ketone solvents, acetone and MEK, MIBK has quite low solubility in water, making it useful for liquid-liquid extraction. It has a similar polarity to ethyl acetate, but greater stability towards aqueous acid and base. It can be used to extract gold, silver and other precious metals from cyanide solutions, such as those found at gold mines, to determine the levels of those dissolved metals. Diisobutyl ketone (DIBK), a related lipophilic ketone, is also used for this purpose. Methyl isobutyl ketone is also used as a denaturing agent for denatured alcohol. When mixed with water or isopropyl alcohol MIBK serves as a developer for PMMA electron beam lithography resist. MIBK is used as a solvent for CS in the preparation of the CS spray used currently by American and British police forces."
    },
    {
        "name": "Methyl methacrylate (MMA)",
        "cas_no": "80-62-6",
        "cins_no": "201-297-1",
        "molecular_formula": "C4H6O2",
        "discription": "Methyl methacrylate, referred to as MMA, is an unsaturated ester. Methyl methacrylate is used in adhesives, lubricants, wood impregnating agents, motor coil impregnating agents, paper polishing agents, textile printing and dyeing auxiliaries, leather treatment agents and insulation perfusion materials, etc.\n",
        "typical_properties": "Colorless transparent liquid at room temperature. It is volatile, explosive, and flammable. Its volatile gas has a pungent odor. It is soluble in alcohols, ethers, ketones, and chlorinated hydrocarbons, slightly soluble in aliphatic ethers and alcohols, and slightly soluble in water.\nAppearance\nColorless clear liquid\nPurity(%)\n99.9 min\nWater(%)\n0.05 max\nInhabitor(ppm)\n5-12\nColor (Pt-Co,#)\n\n10 max",
        "packing": "190kgs net iron drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in the manufacture of organic glass, coatings, lubricant additives, plastics, adhesives, resins, wood impregnation agents, motor coil impregnation agents, ion exchange resins, paper polishes, textile printing and dyeing auxiliaries, leather treatment agents, printing and dyeing auxiliaries and insulation potting materials, etc.\n"
    },
    {
        "name": " Mono propylene gylcol",
        "cas_no": "57-55-6",
        "cins_no": "200-338-0",
        "molecular_formula": "C5H8O2",
        "discription": "Mono propylene gylcol is a synthetic organic compound with the chemical formula C3H802. The substance name is 1,2-propylene glycol.Propylene glycol is an important raw material for unsaturated polyesters, epoxy resins, polyurethane resins, plasticizers, and surfactants. Mainly used to create polymers, but also used as a food additives.\n",
        "typical_properties": "Under normal conditions, it is a colorless viscous liquid, almost odorless, slightly sweet when smelled carefully, and miscible with water, ethanol and a variety of organic solvents.\nAppearance\nClear liquid\nAssay(%)\n99.5 min\nWater(%)\n0.2 max\nColor( Pt/Co )\n10 max\nSpecific gravity\n1.035 - 1.037\nRefractive index\n1.4310 -1.4340",
        "packing": "In 215 kgs in drum; 23 mts/Felixtank; 25mts/ISOTANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is used as a main ingredient in automobile antifreeze and engine-cooling liquids and in brake and hydraulic fluids due to its useful properties of low freezing point, involatility and low corrosive activity. It is used in the preparation of body-care surfactants. Propylene glycol is replacing ethylene glycol and ethanol as it is less toxic than ethylene glycol.\n"
    },
    {
        "name": "N,N-Dimethylaniline",
        "cas_no": "121-69-7",
        "cins_no": "204-493-5\n",
        "molecular_formula": "C8H11N",
        "discription": "N,N-dimethylaniline is an organic compound with the chemical formula C8H11N. It is mainly used as a dye intermediate for the preparation of vanillin, azo dyes, and triphenylmethane dyes. It can also be used as a solvent, stabilizer, analytical reagent, etc.\n",
        "typical_properties": "Colorless or light yellow transparent liquid. It is soluble in water and easily soluble in organic solvents such as ethanol and ether.\nAppearance\n\nPale Yellow to brown oily liquid, amine-like odor\nPurity(%)\n99 min\nAniline(%)\n0.3 max\nN-Methylaniline(%)\n0.5 max\nOthers & Moisture(%)\n0.2 max",
        "packing": "In 190 kgs in drum/ISOTANK\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "N,N-Dimethylaniline is used as an intermediate to manufacture dyes, vanillin, tetramethyldiaminobenzophenone ( white to greenish solid used as important intermediate for making dyes, pigments and photosensitizers ) and other organic products. It is also used as a stabilizer for colorimetric peroxidase determination.\n"
    },
    {
        "name": " N,N-Dimethylformamide",
        "cas_no": "68-12-2",
        "cins_no": "200-679-5",
        "molecular_formula": "C3H7NO",
        "discription": "Dimethylformamide, DMF is an organic compound with the chemical formula HCON(CH3)2. Its structure is HC(=O)−N(−CH3)2. Commonly abbreviated as DMF (although this initialism is sometimes used for dimethylfuran, or dimethyl fumarate), this colourless liquid is miscible with water and the majority of organic liquids. DMF is a common solvent for chemical reactions. Dimethylformamide is odorless, but technical-grade or degraded samples often have a fishy smell due to impurity of dimethylamine. Dimethylamine degradation impurities can be removed by sparging samples with an inert gas such as argon or by sonicating the samples under reduced pressure. As its name indicates, it is structurally related to formamide, having two methyl groups in the place of the two hydrogens. DMF is a polar (hydrophilic) aprotic solvent with a high boiling point. It facilitates reactions that follow polar mechanisms, such as SN2 reactions.",
        "typical_properties": "Colorless, transparent liquid that is compatible with water and most organic solvents. Pure Dimethylformamide have a special odour, while industrial or spoiled Dimethylformamide have a fishy odor due to the presence of a dimethylamine impurity.\nDMF (%)\n99.9 min\nMethanol (%)\n0.0010 max\nMoisture(%)\n0.050 max\nChrominance(Pt-Co)\n5 max\nAlkalinity(DimethylamineI,%)\n0.0010 max\nAcidity(Formic acid,%)\n0.0010 max\nPH(25°C, 20% Aquenous solution)\n6.5~8.0\nElectric conductivity(25°C,us/cm)\n2.0 max\nFe (mg/kg)\n0.05 max\nHeavy component (Dimethy acetamide,%)\n-",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "N-Methylaniline",
        "cas_no": "100-61-8",
        "cins_no": "202-870-9",
        "molecular_formula": "C7H9N",
        "discription": "N-methylaniline is an organic compound with the chemical formula C7H9N. It is mainly used as an intermediate, acid absorbent, and solvent for organic synthesis. In the dye industry, it is used for the production of cationic brilliant red 5GN, cationic pink FG, cationic pink B, reactive yellow brown KGR, reactive yellow brown KGR, reactive brilliant blue X-BR, reaction orange K-2RL, acid blue BR, etc.t, etc.\n",
        "typical_properties": "Colorless to light yellow liquid, slightly soluble in water, soluble in ethanol, ether, and chloroform.\nAppearance\nColorless to light yellow liquid\nPurity(%)\n99 min\nAniline(%)\n0.3 max\nN,N-Dimethylaniline(%)\n0.5 max\nMoisture and others(%)\n0.2 max",
        "packing": "In 200kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as an intermediate, acid absorbent and solvent in organic synthesis. In the dye industry, it is used for the production of Cationic Brilliant Red 5GN, Cationic Pink FG, Cationic Pink B, Reactive Yellow Brown KGR, Reactive Yellow Brown KGR, Reactive Brilliant Blue X-BR, Reactive Orange K-2RL, Acid Blue BR, etc."
    },
    {
        "name": "N-Methyl pyrrolidone\n（NMP)",
        "cas_no": "872-50-4",
        "cins_no": " 212-828-1",
        "molecular_formula": "C5H9NO",
        "discription": "N-Methyl-2-pyrrolidone (NMP) is an organic compound consisting of a 5-membered lactam. It is a colorless liquid, although impure samples can appear yellow. It is miscible with water and with most common organic solvents. It also belongs to the class of dipolar aprotic solvents such as dimethylformamide and dimethyl sulfoxide. It is used in the petrochemical, polymer and battery industries as a solvent, exploiting its nonvolatility and ability to dissolve diverse materials (including polyvinylidene difluoride, PVDF).The low toxicity is also a reason to use this solvent.",
        "typical_properties": "Colorless to light yellow transparent liquid with a slight ammonia smell, miscible with water in any proportion, soluble in ether, acetone and various organic solvents such as esters, halogenated hydrocarbons, aromatic hydrocarbons, and completely miscible with almost all solvents.\nItems\nMicro-electronic grade\nElectronic grade\nPharmaceutical grade\nIndustrial grade\nPurity\n99.9% min\n99.9% min\n99.8% min\n99.5% min\nWater\n0.01% max\n0.02% max\n0.03% max\n0.05% max\nChroma ( Hazen )\n5 max\n10 max\n20 max\n25 max\nDensity (@200Cjg/ml)\n1.026-1.036\n1.026-1.036\n1.026-1.036\n1.026- 1.036\nRefractive index\n1.46-1.475\n1.465-1.475\n1.465 ~1.475\n1.465-1.475\nPH value (20'C) 50%\n6.5- 9.0\n6.5-9.0\n6.5-9.0\n6.5-9.0\nTotal amine\n10 ppm max\n20 ppm max\n30 ppm max\n50 ppm max\nHeavy metals\n10 ppm max\n20 ppm max\n50 ppm max\n100 ppm max",
        "packing": "In 200 kgs in drum/Bulk into ISOTANK",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "N-Methylpyrrolidone (NMP) is a slowly evaporating liquid with low viscosity and excellent solvency power. NMP is colorless, has a faint amine odor and is soluble in water and conventional organic solvents. Used in Micro-electronic grade: It is applicable to LCD, semiconductor, circuit boards, carbon nano tubes and other high-end microelectronic industry. Electronic grade: It is applicable to lithium batteries, aramid fiber, PPS, ultrafiltration film and other industries. Pharmaceutical grade: It is applicable to medical, pharmaceutical, solvents, intermediates and other industries.Industrial grade: It is applicable to the acetylene concentration, butandiene extraction,electrical insulating materials, high-grade paints, pesticide adjuvants, inks, paints, industrial cleaning agent and other industries.\n"
    },
    {
        "name": "1,3:2,4-bis-O-( 4-methylbenzylidene )-D-sorbitol ( MDBS )",
        "cas_no": "54686-97-4",
        "cins_no": "",
        "molecular_formula": "C22H26O6",
        "discription": "",
        "typical_properties": "Purity(%)\n98 min\nMelting point\n249-253 ( MDBS ); 250-255 ( DMDBS )\nAsh(%)\n0.2 max",
        "packing": "10 kgs paper bag with pallet",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Secondary ( MDBS ) and Third ( DMDBS ) generation of sorbierite type of polyolefine Nucleating agent, dosage in polyolefine is about 0.25%. Moreover, also can be used in rubber, chemical fiber, textile, printing, coating, and pigment, etc.\nSecondary ( MDBS ) and Third ( DMDBS ) generation of sorbierite type of polyolefine Nucleating agent, dosage in polyolefine is about 0.25%. Moreover, also can be used in rubber, chemical fiber, textile, printing, coating, and pigment, etc.\n"
    },
    {
        "name": "1,3:2,4-bis-O-( 3,4-dimethylbenzylidene )-D-sorbitol ( DMDBS )",
        "cas_no": "135861-56-2",
        "cins_no": "",
        "molecular_formula": "C24H30O6",
        "discription": "",
        "typical_properties": "Purity(%)\n98 min\nMelting point\n249-253 ( MDBS ); 250-255 ( DMDBS )\nAsh(%)\n0.2 max",
        "packing": "10 kgs paper bag with pallet",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Secondary ( MDBS ) and Third ( DMDBS ) generation of sorbierite type of polyolefine Nucleating agent, dosage in polyolefine is about 0.25%. Moreover, also can be used in rubber, chemical fiber, textile, printing, coating, and pigment, etc.\n"
    },
    {
        "name": "p-dichlorobenzene\n(PDCB)",
        "cas_no": "  106-46-7",
        "cins_no": "203-400-5",
        "molecular_formula": "C6H4Cl2",
        "discription": "It is an organic compound with the chemical formula C6H4Cl2. It is a white crystalline powder. It is mainly used as an insecticide,mildewproof agent, analytical reagent, and can also be used in organic synthesis.\n",
        "typical_properties": "White crystall flake, insoluble in water, soluble in ethanol, ether and benzene.\nAppearance\nWhite crystal flakes\nPurity(%)\n99.8 min\nMoisture(%)\n0.1 max\nCrystal point(°C)\n52 min\n",
        "packing": "In 25kgs bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "p-Dichlorobenzenes belong to the group of organic halogen compounds replacing two hydrogen atoms in benzene by chlorine atoms. p-Dichlorobenzene is used mainly as an insecticidal fumigant against moths, as a space deodorizer, as a general insecticide and fungicide on crops, and as a chemical intermediate for 2,5-dichloroaniline, plastics (e.g polyphenylene sulfide resins used for surface coatings and molding resins), dyes, pharmaceuticals, agrochemicals and other organic synthesis.\n"
    },
    {
        "name": "p-Toluene sulfonamide",
        "cas_no": "70-55-3",
        "cins_no": "200-741-1",
        "molecular_formula": "C7H9NO2S",
        "discription": "p-Toluene sulfonamide is an organic compound used in the synthesis of chloramine-T and chloramphenicol sulfonate, fluorescent dyes, plasticizers, synthetic resins, coatings, disinfectants and wood processing brighteners.\n",
        "typical_properties": "White flake or leaf-shaped crystals, soluble in ethanol, hardly soluble in water.Appearance\nWhite crystalline powder\nAssay\n99%\nColor (APHA)\n25 max\nMoisture(%)\n0.2 max\nMelting point(℃)\n136\nIsmer impurity(%)\n0.5 max\nAsh(%)\n0.05 max\nHeavy metals(ppm)\n20 max\nSO4(ppm)\n40 max\nChloride(ppm)\n70 max",
        "packing": "In 25kg bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in organic synthesis. p-Toluenesulfonamide is mainly used to synthesize chloramine-T and chloramphenicol (Tevenel).\nUsed to synthesize fluorescent dyes, manufacture plasticizers, synthetic resins, coatings, disinfectants and wood processing brighteners, etc.\nMainly used as a toughening agent for synthesizing water-soluble melamine formaldehyde resins.\nUsed as a primary brightener in bright nickel plating. Used in bright multi -layer nickel plating to make the coating bright and uniform."
    },
    {
        "name": "Pentaerythritol",
        "cas_no": "115-77-5",
        "cins_no": "253-404-6",
        "molecular_formula": "C(CH2OH)4",
        "discription": "Pentaerythritol is used in the manufacture of Alkyd resins, fatty acid rosin and tall oil esters and to make paint and coatings, printing ink, coating adhesives, explosives, sealants, varnish, lacquer, vinyl chloride, synthetic rubber and miscellaneous including pentaerythritol tetranitrate (PETN), urethane coatings, flame retardant paints, polyvinyl chloride stabilizers, olefins antioxidant and pentaerythritol triacrylate.",
        "typical_properties": "White crystal powder without any visible foreign matters. Soluble in water, slightly soluted in alcohol, dissolvable in benzene, ether and petroleum ether etc., Esters will be formed by reaction with common organic acid; No reaction take place when it is heated with dilute caustic solution.\nPurity:                            95% 98%\nAppearence:                  White crystal powder or particles\n                                      Easily soluble in water",
        "packing": "In 25kgs plastic woven bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Phthalic anhydride",
        "cas_no": "85-44-9",
        "cins_no": "201-607-5",
        "molecular_formula": "C8H4O3",
        "discription": "Phthalic anhydride is an organic compound with the chemical formula C8H4O3. It is a cyclic anhydride formed by dehydration of phthalic acid molecules. It is a white crystalline powder, insoluble in cold water, slightly soluble in hot water and ether, soluble in ethanol, pyridine, benzene, carbon disulfide, etc. It is an important organic chemical raw material and an important intermediate for the preparation of phthalate plasticizers, coatings, saccharin, dyes and organic compounds.",
        "typical_properties": "White crystalline powder, insoluble in cold water, slightly soluble in hot water and ether, soluble in ethanol, pyridine, benzene, carbon disulfide, etc.Appearance\nWhite flake or powder\nContent(GC,%)\n99.85 min\nSolidification point(℃)\n130.5 min\nThermally stable chroma\n50 max\nMolten color(#)\n20 max\nSulphuric acid color(#)\n40 max\nFree acid(%)\n0.2 max",
        "packing": "In 25kgs bag, 1000kg jumbo bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Phthalic anhydride is one of the most important organic chemical raw materials. Its main derivatives include dibutyl phthalate, dioctyl phthalate and diisobutyl phthalate, etc. It is used as a plasticizer for PVC (easy to process and soften); it can also be used to produce unsaturated polyester resins, alkyd resins, dyes and pigments, various paints, food additives, phenolphthalein, a laxative in medicine, phosmet, bentazon and saccharin sodium in pesticides, etc.\n"
    },
    {
        "name": "Potassium acetate",
        "cas_no": "0127-08-02",
        "cins_no": "204-822-2",
        "molecular_formula": "CH3CO2K",
        "discription": "Potassium acetate is a colorless crystalline solid with a pungent taste. It is a salt compound of acetic acid and potassium ions. Potassium acetate solution is a catalyst that has catalytic effect on the reaction of isocyanate trimerization to form polyisocyanurate. It can be used together with other catalysts such as tertiary amines and potassium isooctanoate to meet various rigid foam casting and spraying processes, and has the characteristics of fast foaming and gelling. The cost of this catalyst is relatively low. Potassium acetate powder is mainly used in the production of potassium salt of penicillin and as a chemical reagent.",
        "typical_properties": "White crystalline powder, easily deliquescent, with alkaline taste. Soluble in water and ethanol, insoluble in ether. Appearance\nWhite powder\nAssay（%）\n99.0-100.5\nPH( 5% solution,25°C)\n7.5-8.5\nChloride(%)\n0.2 max\nWater insolubles(%)\n0.05 max\nFe(%)\n0.05 max",
        "packing": "In 25kgs/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is used as a textile conditioner, catalyst in the production of polyurethanes, polymers and carbon black, It is also used in manufacturing of crystal glass. In pharm industry, Potassium Acetate is used in the synthesis of medicines ( antibiotics, potassium penicillins)."
    },
    {
        "name": "Polyqyat DMA/E 50",
        "cas_no": "25988-97-0",
        "cins_no": "607-843-9",
        "molecular_formula": "C5H12ClNO",
        "discription": "Polyquat DMA/E 50 is a Cationic water-soluble polymeric quaternary ammonium compound. It is particularly effective against Chlorella vulgaris, the green algae in swimming pools. Polyquat DMA/E 50 has been specially developed for the treatment of swimming pool water and offers many advantages over other swimming pool water treatment chemicals, such as Benzalkonium Chloride, Hypochlorite and Chloro-isocyanate. Polyquat DMA/E 50 has enduring biocidal properties and is nonvolatile. It is a non-foaming quat and not corrosive to pumps. At the beginning of the season, an initial shock-treatment of the swimming pool water using 20-40 ppm. Polyquat DMA/E 50 is recommended to inhibit the growth of algae and fungi. After which, only a weekly dosage of 2 -5 ppm (1 ppm = 1g/m³) is necessary. As Polyquat DMA/E 50 is polymeric quaternary compound (positively charged), it adhers to leaves, dust etc. It is therefore recommended to first mechanically clean the swimming pool with an appropriate brush/suction cleaner before using.",
        "typical_properties": "Clear, colourless to light yellow liquid. Appearance\nColorless transparent liquid\nContent\n49.0% - 52.0%\nPH\n6.5 – 8.5\nSpecific gravity (g/cm3)\n1.140 – 1.170",
        "packing": "In 200 kgs net drum or 1,100 kgs net IBC drum.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Polyquat DMA/E 50 has been specially developed for the treatment of swimming pool water and offers many advantages over other swimming pool water treatment chemicals such as benzalkonium chloride, hypochlorite and chlorisocyanate. Polyquat DMA/E 50 has enduring biocidal properties and is nonvolatile. It is a non-foaming quat and not corrosive to pumps. I also helps deposit dust particles and other contaminants, giving swimming pool water a cleaner look."
    },
    {
        "name": "Propylene carbonate",
        "cas_no": "108-32-7",
        "cins_no": "203-572-1",
        "molecular_formula": "C4H6O3",
        "discription": "Propylene carbonate (molecular formula: C4H6O3) is a colorless, odorless, flammable liquid. In industry, propylene oxide is added to carbon dioxide under a certain pressure and then distilled under reduced pressure. It can be used as oily solvent, spinning solvent, olefin, aromatic extractant, carbon dioxide absorbent, dispersant for water-soluble dyes and pigments, etc.",
        "typical_properties": "Clear liquid, Propylene carbonate is a colorless, odorless, flammable liquid. It is miscible with ether, acetone, benzene, chloroform, vinyl acetate, etc., and soluble in water and carbon tetrachloride.\nAppearance\nClear liquid\nPurity(%)\n99.5 min\nMoisture(%)\n0.1 max\nColority(#)\n20 max",
        "packing": "In 250 kgs in drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "In the electronics industry, it can be used as an excellent medium for high-energy batteries and capacitors. In the polymer industry, it can be used as a solvent and plasticizer for polymers. It can be used as a plasticizer for adhesives and sealants. It can also be used as a phenolic resin curing accelerator and a dispersant for water-soluble adhesive pigments and fillers. In the chemical industry, it is the main raw material for the synthesis of dimethyl carbonate and can also be used to remove carbon dioxide and hydrogen sulfide from natural gas and petroleum cracking gas."
    },
    {
        "name": "Polytetramethylene Ether Glycol",
        "cas_no": "112945-52-5",
        "cins_no": "231-545-4",
        "molecular_formula": "O2Si",
        "discription": "Polytetrahydrofuran is an organic polymer compound with a molecular formula of ₙOH₂ and a structural formula of HO-ₙ-H. It can be regarded as a product of the intermolecular polymerization of tetrahydrofuran ring opening; or a product of the intermolecular condensation of 1,4-butanediol.As an important chemical raw material, polytetrahydrofuran is mainly used to prepare spandex in the chemical fiber field, and in the non-fiber field for the preparation of elastomers, adhesives, coatings, sealants and other fields. The polyurethane products prepared with it are wear-resistant, chemical-resistant, and have good flexibility and resilience. At present, the top three uses of polytetrahydrofuran abroad are polyurethane elastic fiber (49%), polyurethane elastomer (36%) and ester-ether copolymer elastomer (15%).\n",
        "typical_properties": "Polytetrahydrofuran is a white waxy solid that is easily soluble in alcohols, esters, ketones, aromatic hydrocarbons and chlorinated hydrocarbons, but insoluble in aliphatic hydrocarbons and water. It becomes a transparent liquid when the temperature exceeds room temperature. Product names\nQuality Index\nPTMEG 650\nPTMEG 1000\nPTMEG 1800\nPTMEG 2000\nMolecular Weight (g/mol)\n625-675\n950-1050\n1750-1850\n1950-2050\nHydroxyl Number (mgKOH/g)\n166.24-179.54\n106.87-118.12\n60.65-64.12\n60.65-64.12\nWater Content (ug/g)\n100 max\nColor (Pt-Co)\n30 max\nAcidity Value (mg/g)\n0.05 max\nPeroxides (wt.ug/g as H2O2)\n5 max\nStability (wt.ug/g as BHT)\nConsultation between Supply and Requisition Parties",
        "packing": "In 10/20 kgs net plastic bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "PTMEG should be stored in totally closed containers sealed with dry nitrogen. The containers must be fitted with heating equipment outside or inside to keep their internal temperature at about 50℃. Frozen PTMEG can be heated at about 70℃ for 24 hours to melt. PTMEG should not be stored at 90℃ for a long time.\nIn addition, it should be stored in cool, dry and well-ventilated places, and keep away from fire sources, sparks and naked flames. Due to PTMEG water absorbent and ease of oxidization, it should not be exposed to moisture or air. To avoid static electricity, its containers should be earthen during transportation.\nPTMEG becomes highly combustible at high temperature. If fire is started, one could use spray water, alcohol foam, dry chemicals products or carbon dioxide fire extinguishers to put off the fire. When loading or unloading it, one should wear gloves and safety glasses to prevent contacting with the eyes or skin."
    },
    {
        "name": "P-Toluene Sulfonic Acid ( PTSA )",
        "cas_no": "6192-52-5",
        "cins_no": "203-180-0",
        "molecular_formula": "C7H8O3S",
        "discription": "p-Toluenesulfonyl isocyanate(PTSI) is a commonly used monoisocyanate and a dehydrating agent commonly used in chemical products,referred to as TI.TI is effectively used in moisture-curing one-component and conventional two-component polyurethane paint systems as a dehydrating agent for solvents, fillers, pigments, etc. In addition, TI can also be used as a stabilizer in purified diisocyanates to prevent them from deteriorating or changing color.",
        "typical_properties": "Low viscosity, colorless transparent liquid, specific gravity: 1.29, viscosity: 10mpa.s; boiling point: 270℃; freezing point: 5℃; flash point:＞100℃. Appearance\nWhite crystal powder\nTotal Acidity( C7H8O3S,%)\n99 min\nFree Acid ( H2SO4,% )\n0.2 max\nFe(ppm)\n10 max\nMoisture(%)\n1.5 max\nAsh (%)\n0.02 max\nMelting point(℃)\n102 min\nWater dissolution test\nConforms\nEthanol dissolution test\nConforms",
        "packing": "In 25kgs bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "For chemical reagents, but also for dyes, organic synthesis.\nUsed as the intermediates of medicine ( such as Doxycycline ), pesticides ( such as Dicofol ), dyes. Also used in detergents,\nplastics, coatings and so on.\nFor medicine, pesticides, dyes and detergents, but also for plastics and printing coatings.\nUsed in the catalyst synthetic medicine, pesticides, polymerization of the stabilizer and organic synthesis ( Esters, etc. ).\nAlso used as medicine, paint intermediates and resin curing agent."
    },
    {
        "name": "P-Toluene sulfonyl isocyanate\n( PTSI )",
        "cas_no": "4083-64-1",
        "cins_no": "223-810-8",
        "molecular_formula": "C8H7NO3S",
        "discription": "p-Toluenesulfonyl isocyanate(PTSI) is a commonly used monoisocyanate and a dehydrating agent commonly used in chemical products,referred to as TI.TI is effectively used in moisture-curing one-component and conventional two-component polyurethane paint systems as a dehydrating agent for solvents, fillers, pigments, etc. In addition, TI can also be used as a stabilizer in purified diisocyanates to prevent them from deteriorating or changing color.",
        "typical_properties": "Low viscosity, colorless transparent liquid, specific gravity: 1.29, viscosity: 10mpa.s; boiling point: 270℃; freezing point: 5℃; flash point:＞100℃; hue: ≤1. Appearance\n\nColorless transparent liquid\nContent (%)\n98.0 min\nPTSC(%)\n1 max\nFree acid(%)\n0.5 max\nColority(APHA)\n\n50 max",
        "packing": "In 200kgs iron drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used for Synthesis of medicine or pesticide intermediates, for the synthesis of doxazosin. Chemical dehydrating agent, used in paints, coatings and adhesives."
    },
    {
        "name": "Sebacic acid",
        "cas_no": "111-20-6",
        "cins_no": "203-845-5",
        "molecular_formula": "C10H18O4",
        "discription": "Sebacic acid is an aliphatic dibasic acid and is found in flue-cured tobacco leaves, burley tobacco leaves, and oriental tobacco leaves.Sebacic Acid and its derivatives such as Azelaic Acid have a variety of industrial uses as plasticizers, lubricants, hydraulic fluids, cosmetics, candles, etc. It is used in the synthesis of polyamide and alkyd resins. It is also used as an intermediate for aromatics, antiseptics and painting materials.",
        "typical_properties": "White powder or granules, slightly soluble in water, poorly soluble in benzene, petroleum ether, carbon tetrachloride, and easily soluble in ethanol and ether. \nAppearance\nWhite powder, granules\nSebacic acid(%)\n99.5 min\nAsh(%)\n0.02 max\nMoisture(%)\n0.15 max\nMelting point(°C)\n131 - 134.5",
        "packing": "In 25 kg, 500 kg, 1,000 kg in bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used to prepare esters of sebacic acid, and its esters are widely used, such as dibutyl sebacate, dioctyl sebacate, and diisooctyl sebacate. These esters can be used as plasticizers for plastics and cold-resistant rubbers, and can also be used to make polyamides, polyurethanes, alkyd resins, synthetic lubricants, lubricant additives, as well as fragrances, coatings, cosmetics, etc. It can also be used as a raw material for the production of nylon 1010, nylon 910, nylon 810, nylon 610, nylon 9, and a raw material for high-temperature resistant lubricant diethylhexyl ester. It is also a raw material for the production of alkyd resins (used as surface coatings, plasticized nitrocellulose coatings, and urea resin varnishes) and plasticizers, softeners, and solvents for polyurethane rubber, cellulose resins, vinyl resins, and synthetic rubbers."
    },
    {
        "name": "Sodium acetate",
        "cas_no": "0127-09-03",
        "cins_no": "204-823-8",
        "molecular_formula": "C2H3NaO2",
        "discription": "Sodium acetate is an organic substance that can be used as a buffer, mordant, for the determination of lead, copper, nickel, and iron, culture medium preparation, organic synthesis, and film printing.",
        "typical_properties": "Colorless and odorless, transparent crystals or white granules, easily soluble in water, slightly soluble in ethanol and ether. \nAppearance\nWhite or colorless crystals\nPurity(%)\n58.0 - 60.0\nFree alkali(%)\n0.03 max\nInsoluble matters(%)\n0.03 max\nChloride(%)\n0.04 max\nPhosphate(%)\n0.1 max\nSulfate(%)\n0.02 max\nIron(ppm)\n5 max\nHeavy metal(as Pb,ppm)\n5 max",
        "packing": "In 25kg bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Sodium acetate is used as buffers in petroleum production and drilling muds, in food preservations, and in electroplating. It is used as a retardant in elastomer industry. It is used in tanning to effect a more even and rapid penetration of the tan in the leather industry. It is also used as a mordant in dyeing processes. Sodium Acetate is an intermediate to manufacture organic compounds like dyes, pigments, pharmaceuticals, cinnamic acid. It is also used in soap industry and purification of glucose."
    },
    {
        "name": "Sodium dichloroisocyanurate\n(SDIC)",
        "cas_no": "2893-78-9",
        "cins_no": "220-767-7",
        "molecular_formula": "C3Cl2N3NaO3",
        "discription": "Sodium dichloroisocyanurate (DCCNa) is an organic compound.Sodium dichloroisocyanurate is a commonly used disinfectant with strong oxidizing properties. It has a strong killing effect on various pathogenic microorganisms such as viruses, bacterial spores, fungi, etc. It is a widely applicable and highly effective bactericide.",
        "typical_properties": "White powder crystals or granules, easily soluble in water, difficult to dissolve in organic solvents. Appearance\nWhite crystalline granular or powder or Tablets\nChlorine content(%)\n56.0 min or 60.0 min\npH\n5.5 - 7.0",
        "packing": "In 50kgs in plastic drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Sodium dichloroisothiazide is a widely used broad-spectrum, high-efficiency, low-toxic disinfectant. It is an ideal replacement product for traditional disinfection products such as sodium hypochlorite, bleaching powder and bleaching essence. It is mainly used as a wool shrink-proof treatment agent, bleaching in the bleaching industry, and a disinfectant for kitchens, tableware and food. It can also be used as an additive for household dry bleach, bleaching laundry detergent, cleaning powder, tableware detergent and other detergents to play a bleaching and sterilization role, improve the function of detergents, especially for protein and juice. It has the best cleaning effect.\nIt can also be used for civil sanitation disinfection, such as tableware disinfection, swimming pool water disinfection, drinking water disinfection, industrial circulating water treatment, food companies, public places cleaning and disinfection and other fields."
    },
    {
        "name": " Sodium formate",
        "cas_no": "141-53-7",
        "cins_no": "205-488-0",
        "molecular_formula": "CHNaO2",
        "discription": "Sodium formate contains two crystal waters in its crystals, so it is also called sodium formate dihydrate, sodium formate dihydrate, and sodium formate dihydrate. Sodium formate is the simplest organic carboxylic acid. It is used as Raw material/Reductive bleaching agent/Tanning of leather/Deicing chemical/Buffering agent/Animal feed additive. Sodium Formate is also used in liquid detergent as a builder or an enzyme stabilizer. It is used in dyeing, in electroplating, in silage preservation.",
        "typical_properties": "White, odorless crystalline powder; soluble in water, sparingly soluble in alcohols, and insoluble in organic solvents. Appearance\nWhite crystalline powder\nPurity(%)\n95.0 min\nNaOH(%)\n1.0 max\nNaCl(%)\n1.0 max\nNaCO3(%)\n3.0 max\nNaS(%)\n0.1 max\nMoisture(%)\n1.0 max",
        "packing": "In 25kg bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in the leather industry, the main uses are as follows:\n1. Mainly used in the production of formic acid, oxalic acid and hydrosulfite, etc., and also used in the production of dimethylformamide, etc. It is also used in the pharmaceutical and printing and dyeing industries. ;\n2. Used as a reagent for the determination of phosphorus and arsenic, a disinfectant and a mordant;\n3. Used as a preservative. Use 4: Used in alkyd resin coatings, plasticizers, and strong;\n4. Used as explosives, acid-resistant materials, aviation lubricants, and adhesive additives."
    },
    {
        "name": " Stearic acid",
        "cas_no": "57-11-4",
        "cins_no": "266-928-5",
        "molecular_formula": "C18H36O2",
        "discription": "Stearic acid, another name for octadecanoic acid CH3(CH2)16COOH, is one of the most common fatty acids. It exists as a glycerol ester in most animal and plant fats (Beare-Rogers, Dieffenbacher, & Holm, 2001). It is an ingredient found in skin care products for protection against dryness or irritation.",
        "typical_properties": "A waxy solid that is insoluble in water, with the chemical formula C18H36O2. It is soluble in ethanol and acetone, and easily soluble in solvents such as ether, chloroform, carbon tetrachloride, benzene and carbon disulfide. Iterm\nIndex\nSA1845 Type\nIodine Value，g/100g\n5.0\nSaponification Value ，mg/g\n199 ~ 217\nAcid Value，mg/g\n198 ~ 216\nColor (Hazen)\n400\nFreezing Point℃\n>52\nMoisture%\n0.30\nInorganic   Acid%\n0.001",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is widely used for cosmetics, plastic cold resistant plasticizer, release agent, stabilizer, surfactant, rubber vulcanization accelerator, waterproofing agent, polishing agent, metal soap, metal mineral flotation agent, softener, pharmaceuticals and other organic chemicals.\nIn addition, also can be used as oil soluble pigment solvent, crayons, paper lighting agent transfer slip agent, stearic acid glyceride emulsifier etc..\nThe products in the food industry as a lubricant, defoaming agent and food additive monostearate, stearic acid, sorbitan esters, sucrose ester as raw material. Used as auxiliary raw materials and chemical products for daily use of raw materials.\nStearic acid is widely used in the manufacture of PVC plastic pipe, sheet, profiles, thin films. PVC heat stabilizer, with lubrication and good optical, thermal stability."
    },
    {
        "name": "Succinic acid",
        "cas_no": "1210-15-6",
        "cins_no": "203-740-4",
        "molecular_formula": "C4H6O4",
        "discription": "Succinic acid, also known as butyric acid, is a dicarboxylic acid. An important use of succinic acid is to prepare five-membered heterocyclic compounds. For example, succinic acid loses water rapidly when heated to form succinic anhydride, which is a furan ring compound. Succinic anhydride is an important raw material for manufacturing drugs, dyes and alkyd resins. Succinic anhydride and ammonia are heated together to form succinimide. The hydrogen on the imino group of succinimide can be replaced by bromine to form N-bromosuccinimide, which is a brominating agent and mild oxidant for organic synthesis. Succinic acid has antispasmodic, expectorant and diuretic effects in medicine. Diethyl succinate is an important intermediate in organic synthesis. Dibutyl succinate and dioctyl succinate are plasticizers for plastics. Diallyl succinate is copolymerized with 1,3-butadiene to make artificial rubber.",
        "typical_properties": "Colorless crystals, flammable, soluble in water, ethanol, ether, insoluble in carbon tetrachloride. Appearance\nWhite crystal powder\nContent(%)\n99.5 min\nMelting point\n185.0-190.0\nFumaric acid(%)\n0.1 max\nAsh(%)\n0.1 max\nSulfate(%)\n0.02 max\nChloride(%)\n0.005 max\nKMNO4 Reducings\nComplies\nHeavy metals ( As Pb,ppm )\n10 max\nAs(ppm)\n2 max\n",
        "packing": "In 25 kgs bag，1,000 kgs jumbo bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Succinic acid is commonly used in various industries. Used as an intermediate in the production of various chemicals. Also used in the food industry as a flavoring agent and acidity regulator.In the pharmaceutical industry, succinic acid is used as an excipient in the formulation of drugs. It can be used as a pH regulator, buffering agent, and solubilizing agent. The mechanism of action in pharmaceutical applications involves succinic acid's ability to maintain the stability and efficacy of drugs.\n"
    },
    {
        "name": "Trichloroisocyanuric acid (TCCA)",
        "cas_no": " 87-90-1",
        "cins_no": "201-782-8",
        "molecular_formula": "C3Cl3N3O3",
        "discription": "Trichloroisocyanuric acid is one of the products in the chloroisocyanuric acid series, referred to as TCCA. The pure product is a powdery white crystal, slightly soluble in water and easily soluble in organic solvents. [2] The active chlorine content is 2 to 3 times higher than that of bleaching powder. Trichloroisocyanuric acid is an upgraded product of bleaching powder and bleaching spirit. The three wastes are much lower than bleaching spirit. There is a trend in developed countries to use it to replace bleaching spirit.",
        "typical_properties": "White powder crystals, slightly soluble in water, easily soluble in organic solvents. Appearance\nWhite crystalline powder, granule or tablet ( 20gr - 200gr )\nChlorine content(%)\n90.0 min\nWater\n0.5% max\npH\nca 3 (1% sol.)",
        "packing": "In 50 kgs in plastic drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is used as a pharmaceutical raw material, a solvent for photographic developer, a solvent for paraffin oil in artificial fibers, an emulsifier for cosmetics, etc. Triisopropanolamine can be used as a gas absorbent and antioxidant; as a grinding aid in the cement industry; as a refining agent, antistatic agent, dyeing auxiliary, and fiber wetting agent in the fiber industry; as an antioxidant and plasticizer in lubricating oils and cutting oils; as a crosslinking agent in the plastics industry; and can also be used as a dispersant for titanium dioxide and minerals and a maturation agent in the polyurethane industry."
    },
    {
        "name": "Triisopropanolamine",
        "cas_no": "122-20-3",
        "cins_no": "204-528-4",
        "molecular_formula": "C9H21NO3",
        "discription": "Triisopropanolamine is an organic compound. This product is mainly used as synthetic detergent, cosmetics, surfactant raw material, fiber industry refining agent, antistatic agent, dyeing auxiliary, fiber wetting agent, antioxidant for lubricating oil and cutting oil, plasticizer, emulsifier, solvent, etc.",
        "typical_properties": "It is a light yellow or colorless transparent liquid above 0℃ and condenses into a solid below 0℃, soluble in water, ethanol, ether, etc. 85% AQ.Solution\nAppearance\nClear to light yellow liquid\nContent(%)\n85.0 min\nWater\nBalance",
        "packing": "In 200 kgs in drum/ISOTANK",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is used as an emulsifier to make zincate additives, ferrous metal rust inhibitors, cutting coolants, cement enhancers, printing and dyeing softeners, gas absorbents and antioxidants, as well as additives for soaps, detergents and cosmetics. It can also be used as a pharmaceutical raw material and a solvent for photographic developer. It is also used as a solvent for paraffin oil in the artificial fiber industry."
    }
]