[
    {
        "name": "Tris Base",
        "cas_no": "77-86-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Tris base, also known as tromethamine, is an organic compound commonly used as a buffer in biochemistry and molecular biology. It is a primary amine with three hydroxymethyl groups.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pH (0.5 M aqueous solution): 10.0 - 11.5",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as a buffering agent in biological research, in electrophoresis, and in some pharmaceutical formulations. It's also used in cosmetics and personal care products."
    },
    {
        "name": "Tris-HCl",
        "cas_no": "1185-53-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Tris hydrochloride is the hydrochloride salt of Tris (tromethamine). It is commonly used as a component of buffer solutions in biochemistry and molecular biology, particularly when a pH range slightly more acidic than Tris base is required.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pH (1% solution): approx. 4.0-5.5",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, commonly used in molecular biology, biochemistry, and electrophoresis."
    },
    {
        "name": "HEPES",
        "cas_no": "7365-45-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "HEPES (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid) is a zwitterionic organic chemical buffering agent; one of the twenty Good's buffers. HEPES is widely used in cell culture, largely because it is better at maintaining physiological pH despite changes in carbon dioxide concentration.",
        "typical_properties": "Content: 99.5%min; Appearance: White crystalline powder; pKa: 7.55 at 25 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, extensively used in cell culture media, biochemical assays, and as a buffering agent in many biological reactions."
    },
    {
        "name": "ABTS",
        "cas_no": "30931-67-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "ABTS (2,2'-azino-bis(3-ethylbenzothiazoline-6-sulfonic acid)) is a chemical compound used as a chromogenic substrate in enzyme-linked immunosorbent assays (ELISA) and other biochemical assays involving peroxidase enzymes (e.g., HRP). Oxidation of ABTS produces a green soluble end product.",
        "typical_properties": "Content: 98%min; Appearance: Greenish powder or crystals; Soluble in water.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Chromogenic substrate for enzymatic reactions, particularly for peroxidases in ELISA and other diagnostic assays."
    },
    {
        "name": "MOPS",
        "cas_no": "1132-61-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "MOPS (3-(N-morpholino)propanesulfonic acid) is a buffer initially developed as one of Good's buffers. It is widely used in biology and biochemistry with a pKa of 7.2, making it effective for buffering solutions at physiological pH.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa: 7.20 at 25 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, commonly used for RNA electrophoresis (e.g., formaldehyde gels), cell culture media, and various biochemical assays."
    },
    {
        "name": "Hexadecanedioic acid",
        "cas_no": "505-54-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Hexadecanedioic acid, also known as thapsic acid, is a C16 saturated dicarboxylic acid. It is a long-chain fatty acid with carboxyl groups at both ends of the alkane chain.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder or flakes; Melting point: approx. 124-127 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Chemical intermediate, used in the synthesis of polymers (e.g., polyesters, polyamides), plasticizers, lubricants, and fragrances."
    },
    {
        "name": "MOPS-Sodium",
        "cas_no": "71119-22-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "MOPS-Sodium is the sodium salt of MOPS (3-(N-morpholino)propanesulfonic acid). It is used as a biological buffer, often when a more soluble form of MOPS is required or when sodium ions are preferred in the buffering system.",
        "typical_properties": "Content: 99%min; Appearance: White powder; pH (1% solution): approx. 6.5-7.9",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, similar applications to MOPS acid form, used in cell culture and biochemical assays."
    },
    {
        "name": "BIS-TRIS",
        "cas_no": "6976-37-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Bis-tris (bis(2-hydroxyethyl)amino-tris(hydroxymethyl)methane) is a buffering agent used in biochemistry and molecular biology. It has a pKa of around 6.5, making it suitable for buffering in the slightly acidic to neutral pH range.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa: approx. 6.5 at 20 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, particularly useful for polyacrylamide gel electrophoresis (PAGE) of proteins and nucleic acids, and in anion exchange chromatography."
    },
    {
        "name": "MES (anhydrous)",
        "cas_no": "4432-31-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "MES (2-(N-morpholino)ethanesulfonic acid) is a buffer developed by Good et al., part of the Good's buffers series. It has a pKa of 6.15, making it useful for buffering in the acidic pH range. This is the anhydrous form.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa: 6.15 at 25 °C",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer used in cell culture, electrophoresis, and various biochemical assays requiring a buffer in the pH 5.5-6.7 range."
    },
    {
        "name": "PIPES",
        "cas_no": "5625-37-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "PIPES (piperazine-N,N′-bis(2-ethanesulfonic acid)) is a zwitterionic buffering agent used in biochemistry. It is one of Good's buffers and is effective in the pH range of 6.1-7.5.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa1: approx. 6.76 at 25 °C",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, commonly used in cell culture media, biochemical research, and electron microscopy studies due to its low metal binding capacity."
    },
    {
        "name": "Zinc undecylenate",
        "cas_no": "557-08-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Zinc undecylenate is the zinc salt of undecylenic acid, an unsaturated fatty acid. It is known for its antifungal properties.",
        "typical_properties": "Content: 98%min; Appearance: White to off-white fine powder.",
        "packing": "20kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used primarily as an antifungal agent in topical preparations, personal care products (like foot powders and anti-dandruff shampoos), and cosmetics."
    },
    {
        "name": "Undecenoic acid",
        "cas_no": "112-38-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Undecenoic acid, also known as 10-undecenoic acid, is an unsaturated fatty acid derived from castor oil. It possesses antifungal properties.",
        "typical_properties": "Content: 99%min; Appearance: Colorless to pale yellow liquid or low-melting solid with a characteristic odor.",
        "packing": "25kg/drum;180kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as an antifungal agent in topical medications, in perfumery, and as a chemical intermediate for the synthesis of polymers, fragrances, and other chemicals."
    },
    {
        "name": "Octocrylene",
        "cas_no": "6197-30-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Octocrylene is an organic compound used as an ingredient in sunscreens and cosmetics. It is an ester formed from diphenylcyanoacrylate and 2-ethylhexanol.",
        "typical_properties": "Content: 95%-105%; Appearance: Clear, viscous, oily liquid.",
        "packing": "25kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "UV filter in sunscreens, primarily absorbing UVB and some UVA rays. It also helps to stabilize other sunscreen actives and improve water resistance of formulations."
    },
    {
        "name": "Octyl 4-methoxycinnamate",
        "cas_no": "5466-77-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Octyl 4-methoxycinnamate, also known as Ethylhexyl Methoxycinnamate or Octinoxate, is an organic compound used as a UV filter in sunscreens and other cosmetic products.",
        "typical_properties": "Content: 98%min; Appearance: Colorless to pale yellow viscous liquid.",
        "packing": "25kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Widely used as a UVB absorbing agent in sunscreens, lip balms, and other personal care products to protect skin from sun damage."
    },
    {
        "name": "DL-Mandelic acid",
        "cas_no": "90-64-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "DL-Mandelic acid is a racemic mixture of mandelic acid, an alpha-hydroxy acid (AHA) derived from bitter almonds. It is known for its exfoliating and antibacterial properties.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in skincare products for treating acne, hyperpigmentation, and photoaging due to its exfoliating properties. Also used as a chemical intermediate in organic synthesis."
    },
    {
        "name": "Chitosan",
        "cas_no": "9012-76-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Chitosan is a natural biopolymer derived from chitin, which is found in the shells of crustaceans. It is biodegradable and biocompatible.",
        "typical_properties": "Content: 99%min (typically referring to purity or degree of deacetylation); Appearance: White to off-white or yellowish powder/flakes.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in water treatment as a flocculant, in agriculture as a biopesticide and plant growth enhancer, in biomedicine for drug delivery and wound dressings, and in the cosmetic industry."
    },
    {
        "name": "Ammonium thioglycolate",
        "cas_no": "5421-46-5",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Ammonium thioglycolate is the ammonium salt of thioglycolic acid. It is a reducing agent used primarily in hair care products.",
        "typical_properties": "Content: 50%min;60%min;70%min; Appearance: Colorless to pale pink liquid with a distinct odor.",
        "packing": "250kg/drum; 1250kg/IBC",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Active ingredient in hair perming solutions, hair straightening products, and depilatory (hair removal) creams. Also used in leather processing."
    },
    {
        "name": "IPMP / 3-methyl-4-propan-2-ylphenol",
        "cas_no": "3228-02-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "IPMP (Isopropyl Methylphenol), also known as o-Cymen-5-ol, is an isomer of thymol. It is used for its antiseptic and preservative properties.",
        "typical_properties": "Content: 99%min; Appearance: White crystals or crystalline powder with a slight characteristic odor.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as an antiseptic, preservative, and disinfectant in cosmetics, oral care products (like toothpaste and mouthwash), and some topical pharmaceutical preparations."
    },
    {
        "name": "Magnesium myristate",
        "cas_no": "4086-70-8",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Magnesium myristate is the magnesium salt of myristic acid, a saturated fatty acid. It is a fine white powder.",
        "typical_properties": "Content: 99%min; Appearance: Fine, white, lightweight powder.",
        "packing": "20kgs/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in cosmetics and personal care products as an anti-caking agent, opacifier, texturizer, and thickener in powders, foundations, and creams."
    },
    {
        "name": "1,2-Hexanediol",
        "cas_no": "6920-22-5",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "1,2-Hexanediol is a synthetic glycol that functions as a solvent, humectant, emollient, and preservative booster.",
        "typical_properties": "Content: 99.5%min; Appearance: Clear, colorless liquid.",
        "packing": "15kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Widely used in cosmetics and personal care products for its moisturizing properties, to improve product texture, and to enhance the efficacy of preservatives. Also used in printing inks."
    },
    {
        "name": "Guanidine isothiocyanate",
        "cas_no": "593-84-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Guanidine isothiocyanate (GITC) is a potent chaotropic agent widely used in molecular biology for the extraction and purification of RNA and DNA. It denatures proteins, including nucleases, thereby protecting nucleic acids from degradation.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (RNA/DNA isolation), biochemistry research."
    },
    {
        "name": "Guanidine hydrochloride",
        "cas_no": "50-01-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Guanidine hydrochloride (GdnHCl) is a strong chaotropic agent and protein denaturant. It is commonly used in biochemistry for denaturing proteins and in the purification of nucleic acids.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum;",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry (protein denaturation, refolding studies), molecular biology (nucleic acid purification)."
    },
    {
        "name": "IPTG",
        "cas_no": "367-93-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "IPTG (Isopropyl β-D-1-thiogalactopyranoside) is a molecular biology reagent used as an inducer of gene expression from the lac operon and its derivatives in E. coli. It mimics allolactose, an inducer of the lac operon.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (induction of gene expression, protein production), genetic engineering."
    },
    {
        "name": "TCEP-HCl",
        "cas_no": "51805-45-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "TCEP-HCl (Tris(2-carboxyethyl)phosphine hydrochloride) is a potent, odorless, and stable reducing agent commonly used in biochemistry and molecular biology to reduce disulfide bonds in proteins and peptides.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry, proteomics (reduction of disulfide bonds), molecular biology."
    },
    {
        "name": "Agarose",
        "cas_no": "9012-36-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Agarose is a polysaccharide polymer extracted from seaweed, widely used in molecular biology for preparing gels for electrophoresis of DNA, RNA, and proteins. It forms a porous matrix that allows for size-based separation.",
        "typical_properties": "Content: 99%min; Appearance: White to off-white powder.",
        "packing": "10kg/carton",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (gel electrophoresis), biochemistry, microbiology (culture media component)."
    },
    {
        "name": "DTT",
        "cas_no": "3483-12-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "DTT (Dithiothreitol), also known as Cleland's reagent, is a small-molecule redox reagent. Its strong reducing properties make it useful for reducing disulfide bonds in proteins and for protecting thiol groups from oxidation.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder with a characteristic sulfurous odor.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry, molecular biology (protein studies, enzyme assays), proteomics."
    },
    {
        "name": "N,N'-Methylenebisacrylamide",
        "cas_no": "110-26-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "N,N'-Methylenebisacrylamide (BIS) is a cross-linking agent used in the preparation of polyacrylamide gels for electrophoresis (PAGE). It forms cross-links between acrylamide chains, creating a gel matrix.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "25kg/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (polyacrylamide gel electrophoresis), biochemistry, polymer chemistry."
    },
    {
        "name": "Proteinase K",
        "cas_no": "39450-01-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Proteinase K is a broad-spectrum serine protease that is highly active and stable. It is widely used in molecular biology to digest proteins and remove contamination from nucleic acid preparations.",
        "typical_properties": "Content: 95%min ;(Enzyme activity ≥30u/mg); Appearance: Lyophilized white powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (nucleic acid extraction, DNase/RNase inactivation), diagnostics, prion research."
    },
    {
        "name": "Thiazolyl Blue",
        "cas_no": "298-93-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Thiazolyl Blue Tetrazolium Bromide (MTT) is a colorimetric reagent used to assess cell metabolic activity. Viable cells with active metabolism reduce MTT to a purple formazan product, which is quantifiable by spectrophotometry.",
        "typical_properties": "Content: 99%min; Appearance: Yellow to orange crystalline powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Cell biology (cell viability assays, proliferation assays, cytotoxicity assays), drug discovery."
    },
    {
        "name": "BCA-2Na",
        "cas_no": "979-88-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "BCA-2Na (Bicinchoninic acid disodium salt) is a key component of the bicinchoninic acid (BCA) assay, a widely used colorimetric method for the quantification of total protein in a solution.",
        "typical_properties": "Content: 98%min; Appearance: Light yellow to greenish-yellow powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry (protein quantification assays), molecular biology research."
    },
    {
        "name": "Sodium alginate",
        "cas_no": "9005-38-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Sodium alginate is a natural polysaccharide extracted from brown seaweed. It is a salt of alginic acid and is widely used as a thickener, gelling agent, and emulsifier.",
        "typical_properties": "Content: 99% , others as customer request; Appearance: White to yellowish fibrous or granular powder.",
        "packing": "25kg/bag",
        "food_idustry": "Used as a food additive (E401) for thickening, gelling, stabilizing in products like ice cream, jellies, sauces, and dressings.",
        "pharmaceutical_industry": "Used as a disintegrant, thickener, and in controlled-release drug formulations. Also used in wound dressings.",
        "other_industries": "Textile printing (as a thickener for reactive dyes), paper coating, cosmetics."
    },
    {
        "name": "L(+)-Tartaric acid",
        "cas_no": "87-69-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "L(+)-Tartaric acid is a white crystalline organic acid that occurs naturally in many plants, particularly grapes. It is one of the main acids found in wine.",
        "typical_properties": "Content: 99%min; Appearance: Colorless crystals or white crystalline powder.",
        "packing": "25kg/bag",
        "food_idustry": "Used as an acidulant, antioxidant, and flavoring agent in foods and beverages (E334), particularly in wine making, soft drinks, and confectionery.",
        "pharmaceutical_industry": "Used as an excipient, in the production of effervescent salts, and for chiral resolution.",
        "other_industries": "Photography, tanning, ceramics, and in the production of silver mirrors."
    },
    {
        "name": "L-Tryptophan",
        "cas_no": "73-22-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "L-Tryptophan is an essential alpha-amino acid that is used in the biosynthesis of proteins. It is a precursor to serotonin, melatonin, and niacin.",
        "typical_properties": "Content: 98.5%~101.5%; Appearance: White to yellowish-white crystalline powder.",
        "packing": "20kg/bag",
        "food_idustry": "Used as a dietary supplement and food additive.",
        "pharmaceutical_industry": "Used in pharmaceutical preparations, often for mood regulation, sleep aid, and in parenteral nutrition.",
        "other_industries": "Animal feed additive."
    },
    {
        "name": "N,2,3-Trimethyl-2-isopropylbutamide",
        "cas_no": "51115-67-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "N,2,3-Trimethyl-2-isopropylbutamide, also known as WS-23, is a synthetic cooling agent that provides a cooling sensation without a minty odor or taste. It is more potent than many other cooling agents.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "Used as a cooling agent in confectionery, chewing gum, beverages, and other food products.",
        "pharmaceutical_industry": "",
        "other_industries": "Used in cosmetics, personal care products (like oral care, shaving creams), and e-liquids for its cooling effect."
    },
    {
        "name": "Zein",
        "cas_no": "9010-66-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Zein is a class of prolamine proteins found in maize (corn). It is insoluble in water but soluble in aqueous alcohol and other organic solvents.",
        "typical_properties": "Content: 88%min (protein content); Appearance: Pale yellow powder or granules.",
        "packing": "25kg/drum",
        "food_idustry": "Used for edible coatings on fruits, nuts, and confectionery; as a glazing agent; and in biodegradable food packaging.",
        "pharmaceutical_industry": "Used for enteric coatings of tablets and capsules, and in drug delivery systems.",
        "other_industries": "Production of biodegradable plastics, fibers, adhesives, inks, and cosmetics."
    },
    {
        "name": "Alginic acid",
        "cas_no": "9005-32-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Alginic acid is a natural polysaccharide extracted from brown seaweed. It is an anionic polymer, insoluble in water in its acid form, but forms salts (alginates) which are soluble.",
        "typical_properties": "Content: As customer request; Appearance: White to yellowish-brown filamentous or granular powder.",
        "packing": "25kg/drum",
        "food_idustry": "Used as a food additive (E400) as a thickener, gelling agent, and stabilizer, though its salts (like sodium alginate) are more commonly used due to better solubility.",
        "pharmaceutical_industry": "Used in pharmaceutical formulations as a binder, disintegrant, and in preparations for treating acid reflux.",
        "other_industries": "Cosmetics, paper manufacturing, textile printing."
    },
    {
        "name": "D-LACTIC ACID",
        "cas_no": "10326-41-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "D-Lactic acid is the D-isomer of lactic acid, an organic acid. It is less common naturally than L-lactic acid but can be produced by certain microorganisms.",
        "typical_properties": "Content: 95%min; Appearance: Colorless to yellowish, viscous liquid or crystalline solid.",
        "packing": "1200kg/IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a chiral building block in the synthesis of pharmaceuticals and agrochemicals.",
        "other_industries": "Production of polylactic acid (PLA) bioplastics, specialty chemicals."
    },
    {
        "name": "AMMONIUM ALGINATE",
        "cas_no": "9005-34-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Ammonium alginate is the ammonium salt of alginic acid, a natural polysaccharide extracted from brown seaweed. It functions as a thickener, stabilizer, and gelling agent.",
        "typical_properties": "Content: As customer request; Appearance: White to yellowish fibrous or granular powder.",
        "packing": "25kg/bag",
        "food_idustry": "Used as a food additive (E403) as a thickener, gelling agent, and emulsifier in various food products.",
        "pharmaceutical_industry": "",
        "other_industries": "Textile sizing and printing, paper coatings, welding rod coatings."
    },
    {
        "name": "PROPYLENE GLYCOL ALGINATE",
        "cas_no": "9005-37-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Propylene glycol alginate (PGA) is an ester of alginic acid, derived from kelp. It is used as a thickener, stabilizer, and emulsifier, particularly effective in acidic food systems.",
        "typical_properties": "Content: 99%min; Appearance: White to yellowish-white fibrous or granular powder.",
        "packing": "20kgs/bag",
        "food_idustry": "Used as a food additive (E405) in salad dressings, sauces, beer (foam stabilizer), and beverages to improve texture and stability.",
        "pharmaceutical_industry": "",
        "other_industries": "Cosmetics and personal care products."
    },
    {
        "name": "Potassium iodide",
        "cas_no": "7681-11-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Potassium iodide (KI) is an inorganic compound, an ionic salt of potassium and iodine. It is a white crystalline solid.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder or colorless crystals.",
        "packing": "25kg/drum",
        "food_idustry": "Used to iodize table salt (to prevent iodine deficiency) and as a nutrient supplement.",
        "pharmaceutical_industry": "Used as a medication to treat hyperthyroidism, protect the thyroid gland from radioactive iodine, and as an expectorant. Also used in some antiseptic solutions.",
        "other_industries": "Photography (in silver iodide emulsions), analytical chemistry (as a source of iodide ions), animal feed supplement, polymer production."
    },
    {
        "name": "SODIUM GLUCOHEPTONATE",
        "cas_no": "13007-85-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Sodium glucoheptonate is the sodium salt of glucoheptonic acid. It is a chelating agent and sequestering agent, particularly effective for binding metal ions in alkaline solutions.",
        "typical_properties": "Content: 98%min; Appearance: White to light tan crystalline powder or granules.",
        "packing": "25kg/bag",
        "food_idustry": "Used as a sequestrant and chelating agent in food processing.",
        "pharmaceutical_industry": "",
        "other_industries": "Industrial cleaning, metal treatment, concrete admixture (retarder), agriculture (micronutrient carrier), textiles."
    },
    {
        "name": "Piperazine",
        "cas_no": "110-85-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Piperazine is an organic compound that consists of a six-membered ring containing two nitrogen atoms at opposite positions in the ring. It is a cyclic secondary amine.",
        "typical_properties": "Content: 99.5%min; Appearance: White crystalline powder or flakes with a characteristic amine odor.",
        "packing": "25kg/carton",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an anthelmintic (dewormer) in human and veterinary medicine.",
        "other_industries": "Chemical intermediate for pharmaceuticals, polymers (e.g., polyamides), gas sweetening agents, corrosion inhibitors."
    },
    {
        "name": "TMAC/Tetramethylammonium chloride",
        "cas_no": "75-57-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Tetramethylammonium chloride (TMAC) is a quaternary ammonium salt. It is a colorless, hygroscopic crystalline solid.",
        "typical_properties": "Content: 50%min, 99%; Appearance: White crystalline powder or aqueous solution.",
        "packing": "25kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Phase transfer catalyst, electrolyte in electrochemical studies, supporting electrolyte, chemical intermediate, surfactant, used in molecular biology for DNA precipitation."
    },
    {
        "name": "Carbohydrazide",
        "cas_no": "497-18-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Carbohydrazide is a white, water-soluble solid. It is used as an oxygen scavenger in water treatment systems, particularly for boiler feedwater, as an alternative to hydrazine.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Oxygen scavenger in water treatment (boiler systems), reducing agent, chemical intermediate in the synthesis of pharmaceuticals, agrochemicals, and organic compounds."
    },
    {
        "name": "2-Imidazolidone /Ethyleneurea",
        "cas_no": "120-93-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "2-Imidazolidone, also known as ethyleneurea, is a cyclic urea. It is a white solid and is used in various industrial applications.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder or flakes.",
        "packing": "25kg/drum;25kg/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Intermediate in the synthesis of resins (e.g., for textile finishing, paper treatment), chelating agents, pharmaceuticals, and agricultural chemicals. Used in cosmetics as a preservative."
    },
    {
        "name": "CMIT/MIT 14%",
        "cas_no": "26172-55-4/2682-20-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "CMIT/MIT 14% is an aqueous solution containing a mixture of 5-chloro-2-methyl-4-isothiazolin-3-one (CMIT) and 2-methyl-4-isothiazolin-3-one (MIT). It is a broad-spectrum biocide used to control microbial growth.",
        "typical_properties": "Content: 14%min (active ingredients); Appearance: Clear to pale yellow or greenish liquid.",
        "packing": "25kg/drum;250kgs/drum; 1250IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biocide and preservative in water treatment, cooling towers, pulp and paper industry, paints, coatings, adhesives, metalworking fluids, detergents, and some personal care products."
    },
    {
        "name": "Alpha Olefin Sulfonate (AOS)",
        "cas_no": "68439-57-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Alpha Olefin Sulfonate (AOS) is an anionic surfactant known for its excellent detergency, high foaming ability, and good compatibility with other surfactants. It is biodegradable.",
        "typical_properties": "Content: 92%min;35%min; Appearance: White to light yellow powder, flakes, or liquid depending on concentration.",
        "packing": "25kg/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Main active ingredient in laundry detergents, dishwashing liquids, shampoos, body washes, and other cleaning and personal care products. Also used in emulsion polymerization and oilfield chemicals."
    },
    {
        "name": "Dibutyltin dilaurate/DBTDL",
        "cas_no": "77-58-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Dibutyltin dilaurate (DBTDL) is an organotin compound. It is a colorless to pale yellow oily liquid or waxy solid, used primarily as a catalyst.",
        "typical_properties": "Content: Tin: 18.5%+/-0.5%; Appearance: Colorless to pale yellow oily liquid or waxy solid.",
        "packing": "25kg/drum;200kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Catalyst for polyurethane foams and coatings, silicone elastomers, and esterification reactions. Stabilizer for PVC. Used in transesterification processes."
    },
    {
        "name": "N,N-Dimethyl-P-Toluidine",
        "cas_no": "99-97-8",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "N,N-Dimethyl-p-toluidine (DMPT) is an organic compound, specifically a tertiary amine. It is used as an accelerator in polymerization reactions.",
        "typical_properties": "Content: 99%min; Appearance: Colorless to pale yellow liquid with an amine-like odor.",
        "packing": "190kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Accelerator for polyester and vinyl ester resins, catalyst in polyurethane production, intermediate in dye synthesis."
    },
    {
        "name": "3-Dimethylaminopropylamine/DMAPA",
        "cas_no": "109-55-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "3-Dimethylaminopropylamine (DMAPA) is an organic compound containing both primary and tertiary amine functional groups. It is a colorless liquid.",
        "typical_properties": "Content: 99.5%min; Appearance: Colorless to pale yellow liquid with an amine-like odor.",
        "packing": "25kg/drum, 200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Intermediate in the synthesis of surfactants (e.g., cocamidopropyl betaine), corrosion inhibitors, epoxy resin curing agents, polyurethane catalysts, water treatment chemicals, and agricultural chemicals."
    }
]
