[
    {
        "name": "Tris Base",
        "cas_no": "77-86-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Tris base, also known as tromethamine, is an organic compound commonly used as a buffer in biochemistry and molecular biology. It is a primary amine with three hydroxymethyl groups.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pH (0.5 M aqueous solution): 10.0 - 11.5",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as a buffering agent in biological research, in electrophoresis, and in some pharmaceutical formulations. It's also used in cosmetics and personal care products."
    },
    {
        "name": "Tris-HCl",
        "cas_no": "1185-53-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Tris hydrochloride is the hydrochloride salt of Tris (tromethamine). It is commonly used as a component of buffer solutions in biochemistry and molecular biology, particularly when a pH range slightly more acidic than Tris base is required.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pH (1% solution): approx. 4.0-5.5",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, commonly used in molecular biology, biochemistry, and electrophoresis."
    },
    {
        "name": "HEPES",
        "cas_no": "7365-45-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "HEPES (4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid) is a zwitterionic organic chemical buffering agent; one of the twenty Good's buffers. HEPES is widely used in cell culture, largely because it is better at maintaining physiological pH despite changes in carbon dioxide concentration.",
        "typical_properties": "Content: 99.5%min; Appearance: White crystalline powder; pKa: 7.55 at 25 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, extensively used in cell culture media, biochemical assays, and as a buffering agent in many biological reactions."
    },
    {
        "name": "ABTS",
        "cas_no": "30931-67-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "ABTS (2,2'-azino-bis(3-ethylbenzothiazoline-6-sulfonic acid)) is a chemical compound used as a chromogenic substrate in enzyme-linked immunosorbent assays (ELISA) and other biochemical assays involving peroxidase enzymes (e.g., HRP). Oxidation of ABTS produces a green soluble end product.",
        "typical_properties": "Content: 98%min; Appearance: Greenish powder or crystals; Soluble in water.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Chromogenic substrate for enzymatic reactions, particularly for peroxidases in ELISA and other diagnostic assays."
    },
    {
        "name": "MOPS",
        "cas_no": "1132-61-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "MOPS (3-(N-morpholino)propanesulfonic acid) is a buffer initially developed as one of Good's buffers. It is widely used in biology and biochemistry with a pKa of 7.2, making it effective for buffering solutions at physiological pH.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa: 7.20 at 25 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, commonly used for RNA electrophoresis (e.g., formaldehyde gels), cell culture media, and various biochemical assays."
    },
    {
        "name": "Hexadecanedioic acid",
        "cas_no": "505-54-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Hexadecanedioic acid, also known as thapsic acid, is a C16 saturated dicarboxylic acid. It is a long-chain fatty acid with carboxyl groups at both ends of the alkane chain.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder or flakes; Melting point: approx. 124-127 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Chemical intermediate, used in the synthesis of polymers (e.g., polyesters, polyamides), plasticizers, lubricants, and fragrances."
    },
    {
        "name": "MOPS-Sodium",
        "cas_no": "71119-22-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "MOPS-Sodium is the sodium salt of MOPS (3-(N-morpholino)propanesulfonic acid). It is used as a biological buffer, often when a more soluble form of MOPS is required or when sodium ions are preferred in the buffering system.",
        "typical_properties": "Content: 99%min; Appearance: White powder; pH (1% solution): approx. 6.5-7.9",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, similar applications to MOPS acid form, used in cell culture and biochemical assays."
    },
    {
        "name": "BIS-TRIS",
        "cas_no": "6976-37-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Bis-tris (bis(2-hydroxyethyl)amino-tris(hydroxymethyl)methane) is a buffering agent used in biochemistry and molecular biology. It has a pKa of around 6.5, making it suitable for buffering in the slightly acidic to neutral pH range.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa: approx. 6.5 at 20 °C",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, particularly useful for polyacrylamide gel electrophoresis (PAGE) of proteins and nucleic acids, and in anion exchange chromatography."
    },
    {
        "name": "MES (anhydrous)",
        "cas_no": "4432-31-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "MES (2-(N-morpholino)ethanesulfonic acid) is a buffer developed by Good et al., part of the Good's buffers series. It has a pKa of 6.15, making it useful for buffering in the acidic pH range. This is the anhydrous form.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa: 6.15 at 25 °C",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer used in cell culture, electrophoresis, and various biochemical assays requiring a buffer in the pH 5.5-6.7 range."
    },
    {
        "name": "PIPES",
        "cas_no": "5625-37-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "PIPES (piperazine-N,N′-bis(2-ethanesulfonic acid)) is a zwitterionic buffering agent used in biochemistry. It is one of Good's buffers and is effective in the pH range of 6.1-7.5.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder; pKa1: approx. 6.76 at 25 °C",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biological buffer, commonly used in cell culture media, biochemical research, and electron microscopy studies due to its low metal binding capacity."
    },
    {
        "name": "Zinc undecylenate",
        "cas_no": "557-08-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Zinc undecylenate is the zinc salt of undecylenic acid, an unsaturated fatty acid. It is known for its antifungal properties.",
        "typical_properties": "Content: 98%min; Appearance: White to off-white fine powder.",
        "packing": "20kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used primarily as an antifungal agent in topical preparations, personal care products (like foot powders and anti-dandruff shampoos), and cosmetics."
    },
    {
        "name": "Undecenoic acid",
        "cas_no": "112-38-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Undecenoic acid, also known as 10-undecenoic acid, is an unsaturated fatty acid derived from castor oil. It possesses antifungal properties.",
        "typical_properties": "Content: 99%min; Appearance: Colorless to pale yellow liquid or low-melting solid with a characteristic odor.",
        "packing": "25kg/drum;180kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as an antifungal agent in topical medications, in perfumery, and as a chemical intermediate for the synthesis of polymers, fragrances, and other chemicals."
    },
    {
        "name": "Octocrylene",
        "cas_no": "6197-30-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Octocrylene is an organic compound used as an ingredient in sunscreens and cosmetics. It is an ester formed from diphenylcyanoacrylate and 2-ethylhexanol.",
        "typical_properties": "Content: 95%-105%; Appearance: Clear, viscous, oily liquid.",
        "packing": "25kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "UV filter in sunscreens, primarily absorbing UVB and some UVA rays. It also helps to stabilize other sunscreen actives and improve water resistance of formulations."
    },
    {
        "name": "Octyl 4-methoxycinnamate",
        "cas_no": "5466-77-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Octyl 4-methoxycinnamate, also known as Ethylhexyl Methoxycinnamate or Octinoxate, is an organic compound used as a UV filter in sunscreens and other cosmetic products.",
        "typical_properties": "Content: 98%min; Appearance: Colorless to pale yellow viscous liquid.",
        "packing": "25kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Widely used as a UVB absorbing agent in sunscreens, lip balms, and other personal care products to protect skin from sun damage."
    },
    {
        "name": "DL-Mandelic acid",
        "cas_no": "90-64-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "DL-Mandelic acid is a racemic mixture of mandelic acid, an alpha-hydroxy acid (AHA) derived from bitter almonds. It is known for its exfoliating and antibacterial properties.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in skincare products for treating acne, hyperpigmentation, and photoaging due to its exfoliating properties. Also used as a chemical intermediate in organic synthesis."
    },
    {
        "name": "Chitosan",
        "cas_no": "9012-76-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Chitosan is a natural biopolymer derived from chitin, which is found in the shells of crustaceans. It is biodegradable and biocompatible.",
        "typical_properties": "Content: 99%min (typically referring to purity or degree of deacetylation); Appearance: White to off-white or yellowish powder/flakes.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in water treatment as a flocculant, in agriculture as a biopesticide and plant growth enhancer, in biomedicine for drug delivery and wound dressings, and in the cosmetic industry."
    },
    {
        "name": "Ammonium thioglycolate",
        "cas_no": "5421-46-5",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Ammonium thioglycolate is the ammonium salt of thioglycolic acid. It is a reducing agent used primarily in hair care products.",
        "typical_properties": "Content: 50%min;60%min;70%min; Appearance: Colorless to pale pink liquid with a distinct odor.",
        "packing": "250kg/drum; 1250kg/IBC",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Active ingredient in hair perming solutions, hair straightening products, and depilatory (hair removal) creams. Also used in leather processing."
    },
    {
        "name": "IPMP / 3-methyl-4-propan-2-ylphenol",
        "cas_no": "3228-02-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "IPMP (Isopropyl Methylphenol), also known as o-Cymen-5-ol, is an isomer of thymol. It is used for its antiseptic and preservative properties.",
        "typical_properties": "Content: 99%min; Appearance: White crystals or crystalline powder with a slight characteristic odor.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as an antiseptic, preservative, and disinfectant in cosmetics, oral care products (like toothpaste and mouthwash), and some topical pharmaceutical preparations."
    },
    {
        "name": "Magnesium myristate",
        "cas_no": "4086-70-8",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Magnesium myristate is the magnesium salt of myristic acid, a saturated fatty acid. It is a fine white powder.",
        "typical_properties": "Content: 99%min; Appearance: Fine, white, lightweight powder.",
        "packing": "20kgs/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in cosmetics and personal care products as an anti-caking agent, opacifier, texturizer, and thickener in powders, foundations, and creams."
    },
    {
        "name": "1,2-Hexanediol",
        "cas_no": "6920-22-5",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "1,2-Hexanediol is a synthetic glycol that functions as a solvent, humectant, emollient, and preservative booster.",
        "typical_properties": "Content: 99.5%min; Appearance: Clear, colorless liquid.",
        "packing": "15kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Widely used in cosmetics and personal care products for its moisturizing properties, to improve product texture, and to enhance the efficacy of preservatives. Also used in printing inks."
    },
    {
        "name": "Guanidine isothiocyanate",
        "cas_no": "593-84-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Guanidine isothiocyanate (GITC) is a potent chaotropic agent widely used in molecular biology for the extraction and purification of RNA and DNA. It denatures proteins, including nucleases, thereby protecting nucleic acids from degradation.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (RNA/DNA isolation), biochemistry research."
    },
    {
        "name": "Guanidine hydrochloride",
        "cas_no": "50-01-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Guanidine hydrochloride (GdnHCl) is a strong chaotropic agent and protein denaturant. It is commonly used in biochemistry for denaturing proteins and in the purification of nucleic acids.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum;",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry (protein denaturation, refolding studies), molecular biology (nucleic acid purification)."
    },
    {
        "name": "IPTG",
        "cas_no": "367-93-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "IPTG (Isopropyl β-D-1-thiogalactopyranoside) is a molecular biology reagent used as an inducer of gene expression from the lac operon and its derivatives in E. coli. It mimics allolactose, an inducer of the lac operon.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (induction of gene expression, protein production), genetic engineering."
    },
    {
        "name": "TCEP-HCl",
        "cas_no": "51805-45-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "TCEP-HCl (Tris(2-carboxyethyl)phosphine hydrochloride) is a potent, odorless, and stable reducing agent commonly used in biochemistry and molecular biology to reduce disulfide bonds in proteins and peptides.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry, proteomics (reduction of disulfide bonds), molecular biology."
    },
    {
        "name": "Agarose",
        "cas_no": "9012-36-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Agarose is a polysaccharide polymer extracted from seaweed, widely used in molecular biology for preparing gels for electrophoresis of DNA, RNA, and proteins. It forms a porous matrix that allows for size-based separation.",
        "typical_properties": "Content: 99%min; Appearance: White to off-white powder.",
        "packing": "10kg/carton",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (gel electrophoresis), biochemistry, microbiology (culture media component)."
    },
    {
        "name": "DTT",
        "cas_no": "3483-12-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "DTT (Dithiothreitol), also known as Cleland's reagent, is a small-molecule redox reagent. Its strong reducing properties make it useful for reducing disulfide bonds in proteins and for protecting thiol groups from oxidation.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder with a characteristic sulfurous odor.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry, molecular biology (protein studies, enzyme assays), proteomics."
    },
    {
        "name": "N,N'-Methylenebisacrylamide",
        "cas_no": "110-26-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "N,N'-Methylenebisacrylamide (BIS) is a cross-linking agent used in the preparation of polyacrylamide gels for electrophoresis (PAGE). It forms cross-links between acrylamide chains, creating a gel matrix.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "25kg/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (polyacrylamide gel electrophoresis), biochemistry, polymer chemistry."
    },
    {
        "name": "Proteinase K",
        "cas_no": "39450-01-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Proteinase K is a broad-spectrum serine protease that is highly active and stable. It is widely used in molecular biology to digest proteins and remove contamination from nucleic acid preparations.",
        "typical_properties": "Content: 95%min ;(Enzyme activity ≥30u/mg); Appearance: Lyophilized white powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Molecular biology (nucleic acid extraction, DNase/RNase inactivation), diagnostics, prion research."
    },
    {
        "name": "Thiazolyl Blue",
        "cas_no": "298-93-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Thiazolyl Blue Tetrazolium Bromide (MTT) is a colorimetric reagent used to assess cell metabolic activity. Viable cells with active metabolism reduce MTT to a purple formazan product, which is quantifiable by spectrophotometry.",
        "typical_properties": "Content: 99%min; Appearance: Yellow to orange crystalline powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Cell biology (cell viability assays, proliferation assays, cytotoxicity assays), drug discovery."
    },
    {
        "name": "BCA-2Na",
        "cas_no": "979-88-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "BCA-2Na (Bicinchoninic acid disodium salt) is a key component of the bicinchoninic acid (BCA) assay, a widely used colorimetric method for the quantification of total protein in a solution.",
        "typical_properties": "Content: 98%min; Appearance: Light yellow to greenish-yellow powder.",
        "packing": "As customer request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biochemistry (protein quantification assays), molecular biology research."
    },
    {
        "name": "Sodium alginate",
        "cas_no": "9005-38-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Sodium alginate is a natural polysaccharide extracted from brown seaweed. It is a salt of alginic acid and is widely used as a thickener, gelling agent, and emulsifier.",
        "typical_properties": "Content: 99% , others as customer request; Appearance: White to yellowish fibrous or granular powder.",
        "packing": "25kg/bag",
        "food_idustry": "Used as a food additive (E401) for thickening, gelling, stabilizing in products like ice cream, jellies, sauces, and dressings.",
        "pharmaceutical_industry": "Used as a disintegrant, thickener, and in controlled-release drug formulations. Also used in wound dressings.",
        "other_industries": "Textile printing (as a thickener for reactive dyes), paper coating, cosmetics."
    },
    {
        "name": "L(+)-Tartaric acid",
        "cas_no": "87-69-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "L(+)-Tartaric acid is a white crystalline organic acid that occurs naturally in many plants, particularly grapes. It is one of the main acids found in wine.",
        "typical_properties": "Content: 99%min; Appearance: Colorless crystals or white crystalline powder.",
        "packing": "25kg/bag",
        "food_idustry": "Used as an acidulant, antioxidant, and flavoring agent in foods and beverages (E334), particularly in wine making, soft drinks, and confectionery.",
        "pharmaceutical_industry": "Used as an excipient, in the production of effervescent salts, and for chiral resolution.",
        "other_industries": "Photography, tanning, ceramics, and in the production of silver mirrors."
    },
    {
        "name": "L-Tryptophan",
        "cas_no": "73-22-3",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "L-Tryptophan is an essential alpha-amino acid that is used in the biosynthesis of proteins. It is a precursor to serotonin, melatonin, and niacin.",
        "typical_properties": "Content: 98.5%~101.5%; Appearance: White to yellowish-white crystalline powder.",
        "packing": "20kg/bag",
        "food_idustry": "Used as a dietary supplement and food additive.",
        "pharmaceutical_industry": "Used in pharmaceutical preparations, often for mood regulation, sleep aid, and in parenteral nutrition.",
        "other_industries": "Animal feed additive."
    },
    {
        "name": "N,2,3-Trimethyl-2-isopropylbutamide",
        "cas_no": "51115-67-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "N,2,3-Trimethyl-2-isopropylbutamide, also known as WS-23, is a synthetic cooling agent that provides a cooling sensation without a minty odor or taste. It is more potent than many other cooling agents.",
        "typical_properties": "Content: 98%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "Used as a cooling agent in confectionery, chewing gum, beverages, and other food products.",
        "pharmaceutical_industry": "",
        "other_industries": "Used in cosmetics, personal care products (like oral care, shaving creams), and e-liquids for its cooling effect."
    },
    {
        "name": "Zein",
        "cas_no": "9010-66-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Zein is a class of prolamine proteins found in maize (corn). It is insoluble in water but soluble in aqueous alcohol and other organic solvents.",
        "typical_properties": "Content: 88%min (protein content); Appearance: Pale yellow powder or granules.",
        "packing": "25kg/drum",
        "food_idustry": "Used for edible coatings on fruits, nuts, and confectionery; as a glazing agent; and in biodegradable food packaging.",
        "pharmaceutical_industry": "Used for enteric coatings of tablets and capsules, and in drug delivery systems.",
        "other_industries": "Production of biodegradable plastics, fibers, adhesives, inks, and cosmetics."
    },
    {
        "name": "Alginic acid",
        "cas_no": "9005-32-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Alginic acid is a natural polysaccharide extracted from brown seaweed. It is an anionic polymer, insoluble in water in its acid form, but forms salts (alginates) which are soluble.",
        "typical_properties": "Content: As customer request; Appearance: White to yellowish-brown filamentous or granular powder.",
        "packing": "25kg/drum",
        "food_idustry": "Used as a food additive (E400) as a thickener, gelling agent, and stabilizer, though its salts (like sodium alginate) are more commonly used due to better solubility.",
        "pharmaceutical_industry": "Used in pharmaceutical formulations as a binder, disintegrant, and in preparations for treating acid reflux.",
        "other_industries": "Cosmetics, paper manufacturing, textile printing."
    },
    {
        "name": "D-LACTIC ACID",
        "cas_no": "10326-41-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "D-Lactic acid is the D-isomer of lactic acid, an organic acid. It is less common naturally than L-lactic acid but can be produced by certain microorganisms.",
        "typical_properties": "Content: 95%min; Appearance: Colorless to yellowish, viscous liquid or crystalline solid.",
        "packing": "1200kg/IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a chiral building block in the synthesis of pharmaceuticals and agrochemicals.",
        "other_industries": "Production of polylactic acid (PLA) bioplastics, specialty chemicals."
    },
    {
        "name": "AMMONIUM ALGINATE",
        "cas_no": "9005-34-9",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Ammonium alginate is the ammonium salt of alginic acid, a natural polysaccharide extracted from brown seaweed. It functions as a thickener, stabilizer, and gelling agent.",
        "typical_properties": "Content: As customer request; Appearance: White to yellowish fibrous or granular powder.",
        "packing": "25kg/bag",
        "food_idustry": "Used as a food additive (E403) as a thickener, gelling agent, and emulsifier in various food products.",
        "pharmaceutical_industry": "",
        "other_industries": "Textile sizing and printing, paper coatings, welding rod coatings."
    },
    {
        "name": "PROPYLENE GLYCOL ALGINATE",
        "cas_no": "9005-37-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Propylene glycol alginate (PGA) is an ester of alginic acid, derived from kelp. It is used as a thickener, stabilizer, and emulsifier, particularly effective in acidic food systems.",
        "typical_properties": "Content: 99%min; Appearance: White to yellowish-white fibrous or granular powder.",
        "packing": "20kgs/bag",
        "food_idustry": "Used as a food additive (E405) in salad dressings, sauces, beer (foam stabilizer), and beverages to improve texture and stability.",
        "pharmaceutical_industry": "",
        "other_industries": "Cosmetics and personal care products."
    },
    {
        "name": "Potassium iodide",
        "cas_no": "7681-11-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Potassium iodide (KI) is an inorganic compound, an ionic salt of potassium and iodine. It is a white crystalline solid.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder or colorless crystals.",
        "packing": "25kg/drum",
        "food_idustry": "Used to iodize table salt (to prevent iodine deficiency) and as a nutrient supplement.",
        "pharmaceutical_industry": "Used as a medication to treat hyperthyroidism, protect the thyroid gland from radioactive iodine, and as an expectorant. Also used in some antiseptic solutions.",
        "other_industries": "Photography (in silver iodide emulsions), analytical chemistry (as a source of iodide ions), animal feed supplement, polymer production."
    },
    {
        "name": "SODIUM GLUCOHEPTONATE",
        "cas_no": "13007-85-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Sodium glucoheptonate is the sodium salt of glucoheptonic acid. It is a chelating agent and sequestering agent, particularly effective for binding metal ions in alkaline solutions.",
        "typical_properties": "Content: 98%min; Appearance: White to light tan crystalline powder or granules.",
        "packing": "25kg/bag",
        "food_idustry": "Used as a sequestrant and chelating agent in food processing.",
        "pharmaceutical_industry": "",
        "other_industries": "Industrial cleaning, metal treatment, concrete admixture (retarder), agriculture (micronutrient carrier), textiles."
    },
    {
        "name": "Piperazine",
        "cas_no": "110-85-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Piperazine is an organic compound that consists of a six-membered ring containing two nitrogen atoms at opposite positions in the ring. It is a cyclic secondary amine.",
        "typical_properties": "Content: 99.5%min; Appearance: White crystalline powder or flakes with a characteristic amine odor.",
        "packing": "25kg/carton",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an anthelmintic (dewormer) in human and veterinary medicine.",
        "other_industries": "Chemical intermediate for pharmaceuticals, polymers (e.g., polyamides), gas sweetening agents, corrosion inhibitors."
    },
    {
        "name": "TMAC/Tetramethylammonium chloride",
        "cas_no": "75-57-0",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Tetramethylammonium chloride (TMAC) is a quaternary ammonium salt. It is a colorless, hygroscopic crystalline solid.",
        "typical_properties": "Content: 50%min, 99%; Appearance: White crystalline powder or aqueous solution.",
        "packing": "25kg/drum;200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Phase transfer catalyst, electrolyte in electrochemical studies, supporting electrolyte, chemical intermediate, surfactant, used in molecular biology for DNA precipitation."
    },
    {
        "name": "Carbohydrazide",
        "cas_no": "497-18-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Carbohydrazide is a white, water-soluble solid. It is used as an oxygen scavenger in water treatment systems, particularly for boiler feedwater, as an alternative to hydrazine.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Oxygen scavenger in water treatment (boiler systems), reducing agent, chemical intermediate in the synthesis of pharmaceuticals, agrochemicals, and organic compounds."
    },
    {
        "name": "2-Imidazolidone /Ethyleneurea",
        "cas_no": "120-93-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "2-Imidazolidone, also known as ethyleneurea, is a cyclic urea. It is a white solid and is used in various industrial applications.",
        "typical_properties": "Content: 99%min; Appearance: White crystalline powder or flakes.",
        "packing": "25kg/drum;25kg/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Intermediate in the synthesis of resins (e.g., for textile finishing, paper treatment), chelating agents, pharmaceuticals, and agricultural chemicals. Used in cosmetics as a preservative."
    },
    {
        "name": "CMIT/MIT 14%",
        "cas_no": "26172-55-4/2682-20-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "CMIT/MIT 14% is an aqueous solution containing a mixture of 5-chloro-2-methyl-4-isothiazolin-3-one (CMIT) and 2-methyl-4-isothiazolin-3-one (MIT). It is a broad-spectrum biocide used to control microbial growth.",
        "typical_properties": "Content: 14%min (active ingredients); Appearance: Clear to pale yellow or greenish liquid.",
        "packing": "25kg/drum;250kgs/drum; 1250IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Biocide and preservative in water treatment, cooling towers, pulp and paper industry, paints, coatings, adhesives, metalworking fluids, detergents, and some personal care products."
    },
    {
        "name": "Alpha Olefin Sulfonate (AOS)",
        "cas_no": "68439-57-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Alpha Olefin Sulfonate (AOS) is an anionic surfactant known for its excellent detergency, high foaming ability, and good compatibility with other surfactants. It is biodegradable.",
        "typical_properties": "Content: 92%min;35%min; Appearance: White to light yellow powder, flakes, or liquid depending on concentration.",
        "packing": "25kg/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Main active ingredient in laundry detergents, dishwashing liquids, shampoos, body washes, and other cleaning and personal care products. Also used in emulsion polymerization and oilfield chemicals."
    },
    {
        "name": "Dibutyltin dilaurate/DBTDL",
        "cas_no": "77-58-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Dibutyltin dilaurate (DBTDL) is an organotin compound. It is a colorless to pale yellow oily liquid or waxy solid, used primarily as a catalyst.",
        "typical_properties": "Content: Tin: 18.5%+/-0.5%; Appearance: Colorless to pale yellow oily liquid or waxy solid.",
        "packing": "25kg/drum;200kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Catalyst for polyurethane foams and coatings, silicone elastomers, and esterification reactions. Stabilizer for PVC. Used in transesterification processes."
    },
    {
        "name": "N,N-Dimethyl-P-Toluidine",
        "cas_no": "99-97-8",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "N,N-Dimethyl-p-toluidine (DMPT) is an organic compound, specifically a tertiary amine. It is used as an accelerator in polymerization reactions.",
        "typical_properties": "Content: 99%min; Appearance: Colorless to pale yellow liquid with an amine-like odor.",
        "packing": "190kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Accelerator for polyester and vinyl ester resins, catalyst in polyurethane production, intermediate in dye synthesis."
    },
    {
        "name": "3-Dimethylaminopropylamine/DMAPA",
        "cas_no": "109-55-7",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "3-Dimethylaminopropylamine (DMAPA) is an organic compound containing both primary and tertiary amine functional groups. It is a colorless liquid.",
        "typical_properties": "Content: 99.5%min; Appearance: Colorless to pale yellow liquid with an amine-like odor.",
        "packing": "25kg/drum, 200kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Intermediate in the synthesis of surfactants (e.g., cocamidopropyl betaine), corrosion inhibitors, epoxy resin curing agents, polyurethane catalysts, water treatment chemicals, and agricultural chemicals."
    },
    {
        "name": "Isobutyl Isobutyrate",
        "cas_no": "97-85-8",
        "cins_no": "",
        "molecular_formula": "C8H16O2",
        "discription": "Isobutyl Isobutyrate is an ester with a fruity odor, often used as a flavoring and fragrance agent, and as a solvent.",
        "typical_properties": "Formula Weight: 144.21, Flash Point: Not specified in detail (value obscured, looks like '176.9' which is too high for FP, likely BP was meant or it is a different property), Boiling point: Not specified clearly, Density (20°C): Not specified clearly (column header seems off, values may be refractive index if column is like previous). Physical Properties: Colorless liquid.",
        "packing": "200 kg",
        "food_idustry": "Used as a flavoring agent in foods and beverages, imparting fruity notes.",
        "pharmaceutical_industry": "",
        "other_industries": "Solvent for coatings, lacquers, and inks; fragrance ingredient in perfumes and cosmetics; chemical intermediate."
    },
    {
        "name": "Methyl 3- methoxypropionate",
        "cas_no": "3852-09-3",
        "cins_no": "",
        "molecular_formula": "C5H10O3",
        "discription": "Methyl 3-methoxypropionate is an ester solvent with a mild odor, good solvency for various resins, and a moderate evaporation rate.",
        "typical_properties": "Formula Weight: 118.131, Flash Point: Not specified clearly. Physical Properties: Colorless liquid.",
        "packing": "200 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Solvent for paints, coatings (automotive, industrial), inks, and adhesives; used in electronics cleaning; chemical intermediate."
    },
    {
        "name": "Dibasic Acid Dimethyl Ester (DBE)",
        "cas_no": "95481-62-2 / 26896-20-8",
        "cins_no": "",
        "molecular_formula": "C10H20O2 (This MF seems too simple for a mixture of dibasic acid dimethyl esters like succinate, glutarate, adipate. Typical DBE mixtures are C6-C8 range for the esters if from C4-C6 acids.)",
        "discription": "Dibasic Ester (DBE) is typically a mixture of dimethyl esters of dicarboxylic acids (e.g., succinic, glutaric, and adipic acids). It is a colorless, low-odor, readily biodegradable solvent.",
        "typical_properties": "Formula Weight: 480.221 (This FW also seems very high for typical DBE mixtures. C10H20O2 FW would be ~172. DBEs are mixtures, so FW is an average). Physical Properties: Colorless liquid.",
        "packing": "220 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Environmentally friendly solvent for paints, coatings, inks, resins, and cleaners; paint stripper; industrial degreaser; foundry core binder solvent; plasticizer."
    },
    {
        "name": "Neodecanoic Acid",
        "cas_no": "26896-20-8",
        "cins_no": "",
        "molecular_formula": "C10H20O2",
        "discription": "Neodecanoic acid is a branched-chain C10 carboxylic acid. It is a liquid at room temperature and used to produce various derivatives.",
        "typical_properties": "Formula Weight: 172.264. Physical Properties: Colorless liquid.",
        "packing": "180 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Intermediate for metal salts (paint driers, PVC stabilizers, catalysts), esters (synthetic lubricants, plasticizers), and peroxy esters (polymerization initiators); corrosion inhibitors."
    },
    {
        "name": "Vinyl Neodecanoate (vv-10)",
        "cas_no": "51000-52-3",
        "cins_no": "",
        "molecular_formula": "C12H22O2",
        "discription": "Vinyl Neodecanoate is a vinyl ester of neodecanoic acid. It is a low-viscosity monomer used as a comonomer in emulsion polymerization to improve polymer properties.",
        "typical_properties": "Formula Weight: 198.3. Physical Properties: Colorless liquid.",
        "packing": "179 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Comonomer in the production of vinyl acetate-based and acrylic emulsion polymers for paints, coatings, adhesives, and construction materials; imparts hydrophobicity, flexibility, and alkali resistance."
    },
    {
        "name": "Glycidyl neodecanoate (E-10P)",
        "cas_no": "26761-45-5",
        "cins_no": "",
        "molecular_formula": "C13H24O3",
        "discription": "Glycidyl Neodecanoate is an epoxy functional ester, the glycidyl ester of neodecanoic acid. It is used as a reactive diluent for epoxy resins and as a chemical intermediate.",
        "typical_properties": "Formula Weight: 228.328. Physical Properties: yellow liquid.",
        "packing": "200 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Reactive diluent for epoxy resins (reduces viscosity, improves flexibility and adhesion); stabilizer for chlorinated compounds; intermediate for producing weatherable coatings and specialty chemicals."
    },
    {
        "name": "Ethyl 3- ethoxypropionate (EEP-3)",
        "cas_no": "763-69-9",
        "cins_no": "",
        "molecular_formula": "C7H14O3",
        "discription": "Ethyl 3-ethoxypropionate is a slow-evaporating ether-ester solvent with good solvency for a wide range of coating resins. It has a mild, characteristic odor.",
        "typical_properties": "Formula Weight: 146.184. Physical Properties: Colorless liquid,strong irritation (description likely referring to handling, not physical appearance itself which is colorless).",
        "packing": "198 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Solvent for paints and coatings (automotive refinishes, industrial coatings, high-bake enamels), inks, and resins; provides good flow and leveling; electronics cleaning."
    },
    {
        "name": "ISOCYANIC ACID (MDI)",
        "cas_no": "75-13-8",
        "cins_no": "",
        "molecular_formula": "CHNO",
        "discription": "Isocyanic acid is a chemical compound with the formula HNCO. The abbreviation MDI usually refers to Methylene Diphenyl Diisocyanate, which is a completely different, much larger molecule (CAS 101-68-8). Given CAS 75-13-8 and MF CHNO, this entry is for Isocyanic Acid, a very reactive and volatile compound. It's possible MDI is a typo or refers to a specific context for this highly unusual entry.",
        "typical_properties": "Formula Weight: 43.0247. Physical Properties: Colorlessclearliquid,strong irritation (Isocyanic acid is typically a gas or volatile liquid; MDI is a liquid or solid).",
        "packing": "230 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Isocyanic acid itself has limited direct use; it's an important intermediate in some reactions and can be formed in situ. Its esters and related compounds (isocyanates like MDI) are key in polyurethane synthesis.",
        "other_industries": "Isocyanic acid: Laboratory reagent, chemical intermediate. If 'MDI' was intended (Methylene Diphenyl Diisocyanate): Major component in the production of polyurethane foams (rigid, flexible), elastomers, coatings, adhesives, and sealants."
    },
    {
        "name": "Isobutyl Acetate (IBAC)",
        "cas_no": "110-19-0",
        "cins_no": "",
        "molecular_formula": "C6H12O2",
        "discription": "Isobutyl Acetate is an ester solvent with a characteristic fruity odor. It is a colorless liquid with good solvency for various resins.",
        "typical_properties": "Formula Weight: 116.158. Physical Properties: clear liquid.",
        "packing": "180 kg",
        "food_idustry": "Used as a flavoring agent in foods and beverages.",
        "pharmaceutical_industry": "Used as a solvent in pharmaceutical manufacturing processes.",
        "other_industries": "Solvent for lacquers, nitrocellulose, paints, coatings, inks, and adhesives; fragrance ingredient; extraction solvent."
    },
    {
        "name": "Dimethyl phthalate (DMP)",
        "cas_no": "131-11-3",
        "cins_no": "",
        "molecular_formula": "C10H10O4",
        "discription": "Dimethyl Phthalate is a diester of phthalic acid and methanol. It is a colorless, oily liquid with a faint, slightly aromatic odor.",
        "typical_properties": "Formula Weight: 194.184. Physical Properties: clear oily liquid.",
        "packing": "230 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a plasticizer in enteric coatings for tablets and capsules; insect repellent.",
        "other_industries": "Plasticizer for cellulose acetate and other polymers; solvent; insect repellent (especially for mosquitoes and flies); component in some solid rocket propellants."
    },
    {
        "name": "Dibutyl phthalate (DOP)",
        "cas_no": "84-74-2",
        "cins_no": "",
        "molecular_formula": "C16H22O4",
        "discription": "Dibutyl Phthalate (DBP) is a diester of phthalic acid and n-butanol. It is a common plasticizer. (Note: Abbreviation 'DOP' usually refers to Di(2-ethylhexyl) phthalate, CAS 117-81-7. DBP is the correct name for CAS 84-74-2).",
        "typical_properties": "Formula Weight: 278.344. Physical Properties: Colorless transparent oily liquid, slightly aromatic odor.",
        "packing": "200 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a plasticizer in some pharmaceutical coatings (e.g., enteric coatings) and medical devices. Use is declining due to health concerns.",
        "other_industries": "Plasticizer for PVC, nitrocellulose, and other polymers to impart flexibility; solvent; component in adhesives, printing inks, and lacquers. Its use is increasingly restricted due to environmental and health concerns."
    },
    {
        "name": "Trioctyl-trimellitate (TOTM)",
        "cas_no": "3319-31-1",
        "cins_no": "",
        "molecular_formula": "C33H54O6",
        "discription": "Trioctyl Trimellitate (Tris(2-ethylhexyl) trimellitate) is a high-molecular-weight plasticizer derived from trimellitic anhydride and 2-ethylhexanol. It offers good thermal stability and low volatility.",
        "typical_properties": "Formula Weight: 546.778. Physical Properties: Colorless or light yellow transparent oily liquid.",
        "packing": "200 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a plasticizer for PVC in medical devices (e.g., blood bags, tubing) where low migration and good biocompatibility are required, particularly for high-temperature applications.",
        "other_industries": "Primary plasticizer for PVC applications requiring high-temperature resistance and low volatility, such as wire and cable insulation, automotive interiors, and medical tubing; also used in adhesives and coatings."
    },
    {
        "name": "2-Methyl-2,4-pentanediol (MPD)",
        "cas_no": "107-41-5",
        "cins_no": "",
        "molecular_formula": "C6H14O2",
        "discription": "2-Methyl-2,4-pentanediol, also known as Hexylene Glycol, is an organic compound, a diol. It is a colorless liquid with a mild, sweetish odor.",
        "typical_properties": "Formula Weight: 118.174. Physical Properties: Colorless transparent liquid with a slight sweetness.",
        "packing": "195 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a solvent, coupling agent, and viscosity-decreasing agent in pharmaceutical and cosmetic formulations.",
        "other_industries": "Solvent and coupling agent in coatings, inks, and cleaners; hydraulic fluid component; fuel and lubricant additive; cosmetics (emulsifier, surfactant); laboratory reagent for protein crystallization."
    },
    {
        "name": "Glycerin",
        "cas_no": "56-81-5",
        "cins_no": "",
        "molecular_formula": "C3H8O3",
        "discription": "Glycerin (Glycerol) is a simple polyol compound. It is a colorless, odorless, viscous liquid that is sweet-tasting and non-toxic.",
        "typical_properties": "Formula Weight: 92.094. Physical Properties: Clear colorless, viscous liquid.",
        "packing": "250 kg",
        "food_idustry": "Widely used as a food additive (E422) as a humectant, solvent, sweetener, and preservative in various food and beverage products.",
        "pharmaceutical_industry": "Extensively used as a humectant, solvent, emollient, plasticizer, and sweetening agent in pharmaceutical formulations (oral liquids, suppositories, topical creams, toothpaste). Osmotic diuretic.",
        "other_industries": "Humectant in cosmetics and personal care products; raw material for polyurethanes, nitroglycerin, and alkyd resins; solvent; antifreeze; plasticizer; tobacco processing."
    },
    {
        "name": "Trichloroethylene",
        "cas_no": "79-01-6",
        "cins_no": "",
        "molecular_formula": "C2HCl3",
        "discription": "Trichloroethylene (TCE) is a halocarbon commonly used as an industrial solvent. It is a clear, non-flammable liquid with a sweet odor.",
        "typical_properties": "Formula Weight: 131.388. Physical Properties: Colorless transparent flowing liquid.",
        "packing": "300 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Historically used as an extraction solvent in pharmaceutical manufacturing and as an inhaled anesthetic. Its use has significantly declined due to health concerns (carcinogen).",
        "other_industries": "Industrial solvent for degreasing metal parts; dry cleaning solvent (less common now); extraction solvent for oils and fats; refrigerant; chemical intermediate (e.g., for HFC-134a). Use is restricted due to toxicity."
    },
    {
        "name": "Dichloromethane (industrial grade)",
        "cas_no": "75-09-2 (CAS for Dichloromethane, 141B likely product code)",
        "cins_no": "",
        "molecular_formula": "CH2Cl2",
        "discription": "Dichloromethane (DCM), also known as Methylene Chloride, is an organochloride compound. It is a colorless, volatile liquid with a mildly sweet odor.",
        "typical_properties": "Formula Weight: 84.933. Physical Properties: Colorless liquid.",
        "packing": "250 kg",
        "food_idustry": "Used as an extraction solvent (e.g., for decaffeination of coffee/tea, spice oleoresins), with strict limits on residues.",
        "pharmaceutical_industry": "Used as a reaction solvent and extraction solvent in the manufacturing of various pharmaceuticals (e.g., antibiotics, steroids). Solvent in tablet film coatings.",
        "other_industries": "Solvent in paint strippers and removers; degreasing agent; aerosol propellant; process solvent in manufacturing plastics and synthetic fibers; foam blowing agent."
    },
    {
        "name": "Vinyl acetate (VAM)",
        "cas_no": "108-05-4",
        "cins_no": "",
        "molecular_formula": "C4H6O2",
        "discription": "Vinyl Acetate Monomer (VAM) is an organic compound, the acetate ester of vinyl alcohol. It is a colorless liquid with a pungent, fruity odor.",
        "typical_properties": "Formula Weight: 86.089. Physical Properties: Colorless liquid.",
        "packing": "190 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Primary monomer for producing polyvinyl acetate (PVA), polyvinyl alcohol (PVOH), and vinyl acetate copolymers (e.g., VAE emulsions). These polymers are used in adhesives, paints, coatings, textiles, paper coatings, and films."
    },
    {
        "name": "Styrene (SM)",
        "cas_no": "100-42-5",
        "cins_no": "",
        "molecular_formula": "C8H8",
        "discription": "Styrene Monomer is an organic compound, an aromatic hydrocarbon. It is a colorless, oily liquid that evaporates easily and has a sweet smell, although high concentrations have a less pleasant odor.",
        "typical_properties": "Formula Weight: 104.149. Physical Properties: Colorless transparent oily liquid.",
        "packing": "185 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Major commodity chemical used as a monomer for producing polystyrene (PS) and various copolymers, such as acrylonitrile butadiene styrene (ABS), styrene-acrylonitrile (SAN), styrene-butadiene rubber (SBR), and unsaturated polyester resins. Used in plastics, rubber, insulation, fiberglass, and packaging."
    },
    {
        "name": "Bis(hydroxymethyl)butyric acid",
        "cas_no": "10097-02-6",
        "cins_no": "",
        "molecular_formula": "C6H12O4",
        "discription": "Bis(hydroxymethyl)butyric acid, also known as Dimethylolbutyric Acid (DMBA), is a hindered diol carboxylic acid used in the synthesis of waterborne polyurethane dispersions and other polymers.",
        "typical_properties": "Formula Weight: 148.157. Physical Properties: White crystal powder.",
        "packing": "25/包 kg (likely 25 kg/bag)",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as a chain extender and hydrophilic modifying agent in the production of waterborne polyurethane dispersions (PUDs), polyester resins, and alkyd resins for coatings, adhesives, and inks; improves dispersibility and stability."
    },
    {
        "name": "2,2-Bis(hydroxymethyl)propionic acid",
        "cas_no": "4767-03-7",
        "cins_no": "",
        "molecular_formula": "C5H10O4",
        "discription": "2,2-Bis(hydroxymethyl)propionic acid (DMPA) is a trifunctional molecule containing two hydroxyl groups and one carboxyl group. It is a white crystalline powder widely used to introduce hydrophilicity into polymer systems.",
        "typical_properties": "Formula Weight: 134.13. Physical Properties: White crystal powder.",
        "packing": "25/包 kg (likely 25 kg/bag)",
        "food_idustry": "",
        "pharmaceutical_industry": "Used in the synthesis of biocompatible and biodegradable polymers for drug delivery, tissue engineering, and medical implants.",
        "other_industries": "Key monomer for producing waterborne polyurethane dispersions (PUDs) by providing hydrophilic centers (carboxyl groups which can be neutralized); also used in water-soluble alkyd and polyester resins for coatings, adhesives, and inks."
    },
    {
        "name": "Tetrahydrofuran (THF)",
        "cas_no": "109-99-9",
        "cins_no": "",
        "molecular_formula": "C4H8O",
        "discription": "Tetrahydrofuran is a heterocyclic organic compound. It is a colorless, water-miscible organic liquid with a low viscosity and an ether-like odor.",
        "typical_properties": "Formula Weight: 72.11. Physical Properties: Colorless liquid.",
        "packing": "180 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Widely used as a reaction solvent in pharmaceutical synthesis (e.g., Grignard reactions, reductions with LAH) and for polymer processing (e.g., casting films for drug delivery).",
        "other_industries": "Industrial solvent for PVC, resins, lacquers, and adhesives; Grignard reaction solvent; precursor to polytetramethylene ether glycol (PTMEG), used to make spandex fibers and polyurethanes."
    },
    {
        "name": "Benzyl alcohol",
        "cas_no": "100-51-6",
        "cins_no": "",
        "molecular_formula": "C7H8O",
        "discription": "Benzyl Alcohol is an aromatic alcohol. It is a colorless liquid with a mild pleasant aromatic odor. It is a useful solvent due to its polarity, low toxicity, and low vapor pressure.",
        "typical_properties": "Formula Weight: 108.13. Physical Properties: Colorless liquid, aromatic.",
        "packing": "210 kg",
        "food_idustry": "Used as a flavoring agent (synthetic fruit flavors).",
        "pharmaceutical_industry": "Used as a preservative (bacteriostatic agent) in injectable medications and cosmetics; solvent for drugs; local anesthetic component. Also used as a solubilizer.",
        "other_industries": "Solvent for inks, paints, lacquers, and epoxy resin coatings; precursor to various esters used in soap, perfume, and flavor industries; photographic developer; cosmetics (preservative, solvent, viscosity-decreasing agent)."
    },
    {
        "name": "1-Propanol (NPA)",
        "cas_no": "71-23-8",
        "cins_no": "",
        "molecular_formula": "C3H8O2 (Typo, should be C3H8O)",
        "discription": "1-Propanol (n-Propanol) is a primary alcohol. It is a colorless liquid with a mild, alcohol-like odor. (Note: MF in table C3H8O2 is incorrect, should be C3H8O).",
        "typical_properties": "Formula Weight: 60.1. Physical Properties: colorless clear liquid.",
        "packing": "165 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a solvent in pharmaceutical manufacturing; antiseptic in some topical preparations.",
        "other_industries": "Solvent for resins, lacquers, printing inks, and coatings; chemical intermediate for producing esters (e.g., propyl acetate), amines, and other compounds; extraction solvent; component in cleaning agents."
    },
    {
        "name": "Isopropanol (IPA)",
        "cas_no": "67-63-0",
        "cins_no": "",
        "molecular_formula": "C3H8O",
        "discription": "Isopropanol (Isopropyl Alcohol, 2-Propanol) is a secondary alcohol. It is a colorless, flammable chemical compound with a strong odor.",
        "typical_properties": "Formula Weight: 60.06. Physical Properties: colorless clear liquid.",
        "packing": "160/165 kg",
        "food_idustry": "Used as an extraction solvent (e.g., for food colorings, flavorings), with strict limits on residues. Indirect food additive.",
        "pharmaceutical_industry": "Widely used as a disinfectant and antiseptic (rubbing alcohol); solvent for drug synthesis and in topical preparations; cleaning agent for medical equipment.",
        "other_industries": "Solvent for coatings, inks, resins, and adhesives; cleaning agent (electronics, general purpose); deicing fluid; chemical intermediate (e.g., for acetone, isopropyl acetate); fuel additive; laboratory reagent."
    },
    {
        "name": "Ethyl Alcohol (ABS)",
        "cas_no": "(Ethanol is CAS 64-17-5. ABS refers to Acrylonitrile Butadiene Styrene, a plastic, and is irrelevant here).",
        "cins_no": "",
        "molecular_formula": "C2H6O",
        "discription": "Ethyl Alcohol (Ethanol) is a primary alcohol. It is a volatile, flammable, colorless liquid with a characteristic wine-like odor and pungent taste. (Note: Abbreviation 'ABS' is incorrect here).",
        "typical_properties": "Formula Weight: 46.07. Physical Properties: colorless liquid with special flavor.",
        "packing": "165 kg",
        "food_idustry": "Key ingredient in alcoholic beverages; solvent for food colorings, flavorings, and extracts; preservative.",
        "pharmaceutical_industry": "Widely used as an antiseptic and disinfectant; solvent for drug extraction, synthesis, and in many liquid medications; preservative.",
        "other_industries": "Solvent in cosmetics, perfumes, and personal care products; fuel (biofuel); chemical intermediate (e.g., for ethyl esters, acetaldehyde); antifreeze; cleaning agent."
    },
    {
        "name": "Isooctanol (2-EH)",
        "cas_no": "CH(CH2)5CH(C2H5)CH2OH (This is a partial structural formula, not CAS. 2-Ethylhexanol CAS is 104-76-7. Isooctanol is a generic term for C8 branched alcohols.)",
        "cins_no": "",
        "molecular_formula": "C5H10OH (This MF is incorrect for Isooctanol C8H18O).",
        "discription": "Isooctanol refers to a mixture of isomeric C8 branched-chain alcohols, with 2-Ethylhexanol (2-EH) being a major component. It is a colorless liquid with a characteristic odor. (Note: Data in table for MF and CAS is incomplete/incorrect for isooctanol/2-EH).",
        "typical_properties": "Formula Weight: /. Physical Properties: colorless flammable liquid with a distinctive odor.",
        "packing": "200 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Primarily used to manufacture plasticizers (e.g., dioctyl phthalate - DOP, dioctyl adipate - DOA); raw material for surfactants, lubricant additives, and herbicides; solvent; defoamer."
    },
    {
        "name": "Anhydrous tert-butanol",
        "cas_no": "(tert-Butanol CAS is 75-65-0)",
        "cins_no": "",
        "molecular_formula": "C2H6O (Typo, tert-Butanol is C4H10O).",
        "discription": "Tert-Butanol (tert-Butyl Alcohol, TBA) is the simplest tertiary alcohol. It is a colorless solid or liquid (melts near room temperature) with a camphor-like odor. (Note: MF in table is incorrect).",
        "typical_properties": "Formula Weight: 46.07 (Typo, tert-Butanol FW is 74.12). Physical Properties: colorless liquid with special flavor (misleading).",
        "packing": "155 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Solvent in pharmaceutical synthesis; used to prepare tert-butyl ethers and esters as protecting groups or intermediates.",
        "other_industries": "Solvent; gasoline octane booster (as a component of MTBE or ETBE synthesis, or directly); denaturant for ethanol; paint remover component; chemical intermediate."
    },
    {
        "name": "Tert-butyl methyl ether (MTBE)",
        "cas_no": "1634-04-4",
        "cins_no": "",
        "molecular_formula": "C5H12O",
        "discription": "Tert-Butyl Methyl Ether is an organic compound, a volatile, flammable, and colorless liquid that is sparingly soluble in water. It was widely used as a gasoline additive.",
        "typical_properties": "Formula Weight: 88.1482. Physical Properties: Colorless liquid with an ether-like odor.",
        "packing": "150 kg",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a solvent in pharmaceutical manufacturing and for extraction processes.",
        "other_industries": "Formerly a major gasoline additive (octane booster, oxygenate), use now largely phased out in many regions due to groundwater contamination concerns; solvent for Grignard reagents and other organic reactions; extraction solvent."
    },
    {
        "name": "Paraformaldehyde (PFA)",
        "cas_no": "30525-89-4",
        "cins_no": "",
        "molecular_formula": "(CH2O)n",
        "discription": "Paraformaldehyde is the smallest polyoxymethylene, the polymerization product of formaldehyde with a typical degree of polymerization of 8–100 units. It is a white crystalline solid with a strong formaldehyde odor.",
        "typical_properties": "Formula Weight: 90.08 (This is for trioxane (CH2O)3; PFA has variable FW depending on n). Physical Properties: White flammable crystalline powder with formaldehdye-like odor.",
        "packing": "25/包 kg (likely 25 kg/bag)",
        "food_idustry": "",
        "pharmaceutical_industry": "Source of formaldehyde for disinfection and sterilization; used in tissue fixation (histology, pathology); reagent in chemical synthesis.",
        "other_industries": "Source of formaldehyde for producing phenolic resins, urea-formaldehyde resins, and melamine resins; disinfectant; fumigant; preservative in some industrial products; herbicide."
    },
    {
        "name": "Guanidine thiocyanate",
        "cas_no": "593-84-0",
        "cins_no": "",
        "molecular_formula": "CH5N3·CHNS or C2H6N4S",
        "discription": "Guanidine thiocyanate (GTC) is a chemical compound used as a general protein denaturant, being a chaotropic agent, though it is most commonly used in the extraction of DNA and RNA.",
        "typical_properties": "Formula Weight: 118.16. Physical Properties: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Primarily used in molecular biology as a chaotropic agent for nucleic acid (DNA/RNA) extraction and purification by denaturing proteins (including nucleases). Not for direct therapeutic use.",
        "other_industries": "Laboratory reagent for biochemical research."
    },
    {
        "name": "Guanidine hydrochloride",
        "cas_no": "50-01-1",
        "cins_no": "",
        "molecular_formula": "CH6ClN3",
        "discription": "Guanidine hydrochloride is the hydrochloride salt of guanidine. It is a powerful chaotropic agent used in the denaturation and refolding of proteins.",
        "typical_properties": "Formula Weight: 95.53. Physical Properties: White crystalline powder.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a protein denaturant in biochemical research and in some older therapeutic applications (e.g., for myasthenic syndrome, but use is limited due to side effects). Important for protein solubilization and purification processes.",
        "other_industries": "Laboratory reagent in biochemistry and molecular biology."
    },
    {
        "name": "Proteinase K",
        "cas_no": "39450-01-6",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Proteinase K is a broad-spectrum serine protease. The enzyme was discovered in 1974 in extracts of the fungus Engyodontium album. It is widely used in molecular biology to digest proteins and remove contamination from nucleic acid preparations.",
        "typical_properties": "Formula Weight: ~28,900 Da (protein). Physical Properties: Lyophilized white to off-white powder.",
        "packing": "20g/bottle",
        "food_idustry": "",
        "pharmaceutical_industry": "Essential enzyme in molecular biology labs for isolating high molecular weight nucleic acids (DNA/RNA) by digesting contaminating proteins (e.g., DNases, RNases). Used in sample preparation for PCR, cloning, and sequencing.",
        "other_industries": "Biotechnology research, diagnostics (sample preparation)."
    },
    {
        "name": "Bis[(2-hydroxyethoxy)ethyl]ETHER",
        "cas_no": "112-60-7",
        "cins_no": "",
        "molecular_formula": "C8H18O5",
        "discription": "This compound is Tetraethylene Glycol (TEGOH). It is a higher polyethylene glycol, a colorless, odorless, viscous liquid.",
        "typical_properties": "Formula Weight: 194.23. Physical Properties: Colorless viscous liquid.",
        "packing": "230kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a solvent, humectant, and plasticizer in certain pharmaceutical and cosmetic formulations. Can be used as a less volatile alternative to lower glycols.",
        "other_industries": "Solvent for resins, dyes; plasticizer; component in hydraulic fluids and brake fluids; gas dehydration; chemical intermediate."
    },
    {
        "name": "SODIUM ALGINATE",
        "cas_no": "9005-38-3",
        "cins_no": "",
        "molecular_formula": "(C6H7NaO6)n",
        "discription": "Sodium Alginate is the sodium salt of alginic acid, a natural polysaccharide extracted from brown seaweed. It forms viscous solutions or gels with water.",
        "typical_properties": "Formula Weight: Varies (polymer). Physical Properties: White to yellowish-brown powder.",
        "packing": "25kgs/drum",
        "food_idustry": "Widely used as a food additive (E401) as a thickener, gelling agent, emulsifier, and stabilizer in products like ice cream, yogurts, sauces, and instant puddings. Used in spherification (molecular gastronomy).",
        "pharmaceutical_industry": "Used as a thickening agent, suspending agent, and emulsion stabilizer in liquid oral medications; component of wound dressings (forms a gel); used in antacid preparations (forms a raft to prevent reflux); dental impression materials; drug delivery systems.",
        "other_industries": "Thickener in textile printing (reactive dye printing); paper coating; food industry; cosmetics; production of insoluble alginates."
    },
    {
        "name": "DL-Mandelic acid",
        "cas_no": "90-64-2",
        "cins_no": "",
        "molecular_formula": "C8H8O3",
        "discription": "DL-Mandelic acid is a racemic mixture of mandelic acid, an aromatic alpha-hydroxy acid (AHA). It is a white crystalline solid.",
        "typical_properties": "Formula Weight: 152.15. Physical Properties: White crystalline powder.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used in topical dermatological preparations (creams, peels) for its exfoliating properties to treat acne, hyperpigmentation, and photoaging. Urinary antiseptic (less common now). Chiral resolving agent in synthesis.",
        "other_industries": "Cosmetics (exfoliant, anti-aging); chemical intermediate."
    },
    {
        "name": "Ethylenurea",
        "cas_no": "120-93-4",
        "cins_no": "",
        "molecular_formula": "C3H6N2O",
        "discription": "Ethylenurea (2-Imidazolidinone) is a cyclic urea. It is a white crystalline solid.",
        "typical_properties": "Formula Weight: 86.09. Physical Properties: White crystalline powder or flakes.",
        "packing": "25kgs/drum or 25kgs/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "Intermediate in the synthesis of some pharmaceutical compounds.",
        "other_industries": "Intermediate for resins (e.g., wrinkle-resistant finishes for textiles by reacting with formaldehyde); component in some adhesives, coatings, and personal care products; agricultural chemicals."
    },
    {
        "name": "Octyl 4-methoxycinnamate",
        "cas_no": "5466-77-3",
        "cins_no": "",
        "molecular_formula": "C18H26O3",
        "discription": "Octyl 4-methoxycinnamate (OMC), also known as Ethylhexyl Methoxycinnamate or Octinoxate, is an organic compound, an ester formed from methoxycinnamic acid and 2-ethylhexanol. It is a common sunscreen agent.",
        "typical_properties": "Formula Weight: 290.40. Physical Properties: Colorless to pale yellow oily liquid.",
        "packing": "200kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Active ingredient in sunscreen products to absorb UVB radiation, protecting the skin from sunburn. Also used in other cosmetic and personal care products for UV protection.",
        "other_industries": "UV filter in plastics and coatings to prevent degradation by sunlight."
    },
    {
        "name": "Quaternary ammonium compounds, benzylbis(hydrogenated tallow alkyl)methyl, chlorides",
        "cas_no": "61789-73-9",
        "cins_no": "",
        "molecular_formula": "Variable mixture",
        "discription": "A complex mixture of quaternary ammonium salts, typically used as cationic surfactants. 'Hydrogenated tallow alkyl' refers to alkyl chains derived from hydrogenated animal fat.",
        "typical_properties": "Formula Weight: Variable (mixture). Physical Properties: Waxy solid or paste, sometimes liquid depending on specific composition.",
        "packing": "175kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as fabric softeners, antistatic agents in textile finishing; conditioning agents in hair care products; phase transfer catalysts; components of some disinfectants and sanitizers."
    },
    {
        "name": "Lauroyl chloride",
        "cas_no": "112-16-3",
        "cins_no": "",
        "molecular_formula": "C12H23ClO",
        "discription": "Lauroyl chloride (Dodecanoyl chloride) is the acyl chloride of lauric acid. It is a colorless to pale yellow liquid with a pungent odor.",
        "typical_properties": "Formula Weight: 218.76. Physical Properties: Colorless to pale yellow liquid.",
        "packing": "200kg/drum or 900kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Reagent in pharmaceutical synthesis for introducing the lauroyl (C12 acyl) group, for example, in the preparation of esters, amides, or peroxides.",
        "other_industries": "Intermediate for synthesizing surfactants, emulsifiers, peroxide initiators (e.g., dilauroyl peroxide for polymer industry), and other specialty chemicals."
    },
    {
        "name": "Azelaic acid",
        "cas_no": "123-99-9",
        "cins_no": "",
        "molecular_formula": "C9H16O4",
        "discription": "Azelaic acid is a naturally occurring saturated dicarboxylic acid. It is a white crystalline powder.",
        "typical_properties": "Formula Weight: 188.22. Physical Properties: White crystalline powder or flakes.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used topically for the treatment of acne and rosacea due to its anti-inflammatory, antibacterial, and keratolytic properties. Also used for skin hyperpigmentation.",
        "other_industries": "Intermediate for polymers (polyamides, polyesters), plasticizers, and lubricants; component in cosmetics (skin conditioning, pH adjuster)."
    },
    {
        "name": "Triphosgene",
        "cas_no": "32315-10-9",
        "cins_no": "",
        "molecular_formula": "C3Cl6O3",
        "discription": "Triphosgene (Bis(trichloromethyl) carbonate) is a chemical compound that is used as a safer substitute for phosgene, as it is a solid at room temperature, whereas phosgene is a gas.",
        "typical_properties": "Formula Weight: 296.75. Physical Properties: White crystalline solid with a phosgene-like odor.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a reagent in pharmaceutical synthesis as a source of phosgene for reactions like formation of carbonates, ureas, isocyanates, and chloroformates, which are key intermediates for many APIs.",
        "other_industries": "Reagent in organic synthesis for carbonylation reactions, production of polymers, agrochemicals, and specialty chemicals where phosgene chemistry is required but handling gaseous phosgene is problematic."
    },
    {
        "name": "Isothiazolinones",
        "cas_no": "26172-55-4 (This CAS is for CMIT/MIT mixture. Isothiazolinones is a class of compounds.)",
        "cins_no": "",
        "molecular_formula": "Variable (e.g., CMIT: C4H4ClNOS; MIT: C4H5NOS)",
        "discription": "Isothiazolinones are a class of heterocyclic organic compounds used as broad-spectrum biocides. Common examples include Methylisothiazolinone (MIT) and Methylchloroisothiazolinone (CMIT), often used in combination.",
        "typical_properties": "Formula Weight: Variable. Physical Properties: Typically supplied as aqueous solutions, colorless to pale yellow liquid.",
        "packing": "250kgs/drum, 1250kgs/drum, 25kg/drum, 25kgs/keg",
        "food_idustry": "",
        "pharmaceutical_industry": "Limited use as preservatives in some topical pharmaceutical or diagnostic reagent formulations, with restrictions due to potential for skin sensitization.",
        "other_industries": "Widely used as preservatives and antimicrobial agents in industrial water treatment (cooling towers, pulp & paper), paints, coatings, adhesives, metalworking fluids, household and industrial cleaners, and personal care products (rinse-off cosmetics)."
    },
    {
        "name": "N,N-DIMETHYL-P-TOLUIDINE",
        "cas_no": "99-97-8",
        "cins_no": "",
        "molecular_formula": "C9H13N",
        "discription": "N,N-Dimethyl-p-toluidine (DMPT) is an aromatic tertiary amine. It is a colorless to pale yellow liquid.",
        "typical_properties": "Formula Weight: 135.21. Physical Properties: Colorless to pale yellow oily liquid.",
        "packing": "190kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an accelerator in the polymerization of acrylic resins, particularly in dental materials (e.g., bone cements, denture base resins) and some adhesive systems.",
        "other_industries": "Accelerator for polyester and vinyl ester resins curing (often with peroxide initiators); catalyst in polyurethane foam production; intermediate for dyes and photographic chemicals."
    },
    {
        "name": "TROMETAMOL",
        "cas_no": "77-86-1",
        "cins_no": "",
        "molecular_formula": "C4H11NO3",
        "discription": "Trometamol, also known as Tris base or Tris(hydroxymethyl)aminomethane, is an organic amine proton acceptor. It is widely used as a biological buffer.",
        "typical_properties": "Formula Weight: 121.14. Physical Properties: White crystalline powder.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Widely used as a biological buffer in pharmaceutical formulations (especially injectables and ophthalmic solutions) and laboratory solutions (e.g., TBE, TAE buffers for electrophoresis). Used clinically for treatment of metabolic acidosis. Component of some drug formulations as an excipient.",
        "other_industries": "Buffering agent in biochemistry, molecular biology, and analytical chemistry; cosmetics (pH adjuster); emulsifier."
    },
    {
        "name": "TRIS hydrochloride",
        "cas_no": "1185-53-1",
        "cins_no": "",
        "molecular_formula": "C4H12ClNO3",
        "discription": "Tris hydrochloride is the hydrochloride salt of Tris(hydroxymethyl)aminomethane (Tris base). It is also a common biological buffer.",
        "typical_properties": "Formula Weight: 157.60. Physical Properties: White crystalline powder.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a component of buffer solutions in pharmaceutical preparations and biochemical assays, often in conjunction with Tris base to achieve a specific pH.",
        "other_industries": "Buffering agent in biological research, diagnostics, and chemical analysis."
    },
    {
        "name": "(2-CARBOXYETHYL)DIMETHYLSULFONIUM CHLORIDE",
        "cas_no": "4337-33-1",
        "cins_no": "",
        "molecular_formula": "C5H12ClSO2 or C5H12ClO2S (better representation)",
        "discription": "(2-Carboxyethyl)dimethylsulfonium chloride, also known as Dimethylsulfoniopropionate (DMSP) degradation product when chlorinated, or generally a sulfonium salt. This specific structure serves as an intermediate or specialty chemical.",
        "typical_properties": "Formula Weight: 170.65 (for C5H12ClO2S). Physical Properties: Likely a white crystalline solid.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "May be used as an intermediate in organic synthesis or investigated for specific biological activities.",
        "other_industries": "Specialty chemical for research and organic synthesis."
    },
    {
        "name": "L(+)-Tartaric acid",
        "cas_no": "87-69-4",
        "cins_no": "",
        "molecular_formula": "C4H6O6",
        "discription": "L-(+)-Tartaric Acid is a white, crystalline organic acid that occurs naturally in many plants, particularly grapes. It is one of the main acids found in wine.",
        "typical_properties": "Formula Weight: 150.087. Physical Properties: White crystalline powder or colorless crystals.",
        "packing": "25kgs/bag",
        "food_idustry": "(Food grade, E334) Widely used as an acidulant, antioxidant, flavoring agent, and sequestrant in foods and beverages (e.g., wine, soft drinks, jams, candies, baking powder).",
        "pharmaceutical_industry": "Used as an excipient (acidulant, buffering agent) in pharmaceutical formulations; component of effervescent tablets; resolving agent for chiral separations.",
        "other_industries": "Metal cleaning and polishing; mordant in dyeing; photographic industry; electroplating; ceramics."
    },
    {
        "name": "3-METHYL-3-BUTEN-1-OL",
        "cas_no": "763-32-6",
        "cins_no": "",
        "molecular_formula": "C5H10O",
        "discription": "3-Methyl-3-buten-1-ol (Isoprenol) is an unsaturated alcohol, a hemiterpenoid. It is a colorless liquid.",
        "typical_properties": "Formula Weight: 86.13. Physical Properties: Colorless liquid.",
        "packing": "170kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Intermediate in the synthesis of various terpenes, vitamins (e.g., Vitamin E, Vitamin A), and fragrances.",
        "other_industries": "Building block in organic synthesis for fragrances, flavors, agrochemicals, and specialty polymers."
    },
    {
        "name": "Piperazine",
        "cas_no": "110-85-0",
        "cins_no": "",
        "molecular_formula": "C4H10N2",
        "discription": "Piperazine is an organic compound that consists of a six-membered ring containing two nitrogen atoms at opposite positions in the ring. It is a white crystalline solid with an amine-like odor.",
        "typical_properties": "Formula Weight: 86.14. Physical Properties: White crystalline flakes or solid.",
        "packing": "25kgs/carton, 1x20FCL load 9000kgs",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an anthelmintic (dewormer) to treat parasitic worm infections (e.g., ascariasis, enterobiasis) in humans and animals. Precursor for various pharmaceuticals (e.g., antihistamines like cyclizine, antipsychotics).",
        "other_industries": "Intermediate for polyamides, polyurethanes, and epoxy curing agents; corrosion inhibitor; gas scrubbing (CO2 capture)."
    },
    {
        "name": "2-ACETYLPYRAZINE",
        "cas_no": "22047-25-2",
        "cins_no": "",
        "molecular_formula": "C6H6N2O",
        "discription": "2-Acetylpyrazine is a heterocyclic organic compound with a characteristic nutty, roasted, popcorn-like aroma. It is a key flavoring agent.",
        "typical_properties": "Formula Weight: 122.12. Physical Properties: White to pale yellow crystalline solid or liquid (melts near room temperature).",
        "packing": "25kgs/drum",
        "food_idustry": "Widely used as a flavoring agent in processed foods to impart roasted, nutty, bready, or corn-like flavors (e.g., snack foods, baked goods, popcorn, coffee).",
        "pharmaceutical_industry": "",
        "other_industries": "Flavor and fragrance industry."
    },
    {
        "name": "docosyltrimethylammonium chloride",
        "cas_no": "17301-53-0",
        "cins_no": "",
        "molecular_formula": "C25H54NCl",
        "discription": "Docosyltrimethylammonium chloride (Behentrimonium chloride) is a quaternary ammonium salt with a long C22 alkyl chain. It is used as a cationic surfactant and conditioning agent.",
        "typical_properties": "Formula Weight: 404.16. Physical Properties: White to off-white waxy solid or flakes.",
        "packing": "50kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Primary use as a conditioning agent in hair care products (conditioners, detanglers) for its antistatic, detangling, and softening properties. Also used in some fabric softeners."
    },
    {
        "name": "POTASSIUM MYRISTATE",
        "cas_no": "13429-27-1",
        "cins_no": "",
        "molecular_formula": "C14H27KO2",
        "discription": "Potassium Myristate is the potassium salt of myristic acid (a saturated C14 fatty acid). It is used as an anionic surfactant (soap).",
        "typical_properties": "Formula Weight: 266.46. Physical Properties: White to off-white powder or flakes.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an emulsifier and cleansing agent in some topical pharmaceutical preparations.",
        "other_industries": "Component of soaps, detergents, and personal care products (cleansers, shaving creams) as an emulsifier, surfactant, and viscosity controlling agent."
    },
    {
        "name": "(S)-(-)-2-Chloropropionic acid",
        "cas_no": "29617-66-1",
        "cins_no": "",
        "molecular_formula": "C3H5ClO2",
        "discription": "(S)-(-)-2-Chloropropionic acid is a chiral carboxylic acid. It is a useful building block in organic synthesis, particularly for chiral compounds.",
        "typical_properties": "Formula Weight: 108.52. Physical Properties: Colorless to pale yellow liquid.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Chiral intermediate in the synthesis of various pharmaceuticals and agrochemicals where specific stereochemistry is required.",
        "other_industries": "Chiral building block in fine chemical synthesis."
    },
    {
        "name": "Tetramethylammonium chloride",
        "cas_no": "75-57-0",
        "cins_no": "",
        "molecular_formula": "C4H12NCl",
        "discription": "Tetramethylammonium chloride (TMAC) is a quaternary ammonium salt. It is a white crystalline solid, highly soluble in water.",
        "typical_properties": "Formula Weight: 109.60. Physical Properties: White crystalline powder or colorless crystals.",
        "packing": "200kgs/drum, 1000kgs/IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an electrolyte and in some biochemical assays. Precursor for other tetramethylammonium salts.",
        "other_industries": "Phase transfer catalyst; supporting electrolyte in electrochemistry; reagent in organic synthesis; component of developers in photolithography; zeolite template."
    },
    {
        "name": "Undecenoic acid",
        "cas_no": "112-38-9",
        "cins_no": "",
        "molecular_formula": "C11H20O2",
        "discription": "Undecenoic acid (10-Undecenoic acid) is an unsaturated fatty acid derived from castor oil. It is a colorless to pale yellow liquid or waxy solid with a characteristic odor.",
        "typical_properties": "Formula Weight: 184.28. Physical Properties: Colorless to pale yellow liquid or low-melting solid.",
        "packing": "25kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used topically as an antifungal agent for treating fungal skin infections (e.g., athlete's foot, ringworm).",
        "other_industries": "Intermediate for fragrances, polymers, and agricultural chemicals; component in cosmetics and personal care products."
    },
    {
        "name": "Zinc undecylenate",
        "cas_no": "557-08-4",
        "cins_no": "",
        "molecular_formula": "C22H38O4Zn",
        "discription": "Zinc undecylenate is the zinc salt of undecylenic acid. It is a white amorphous powder.",
        "typical_properties": "Formula Weight: 431.92. Physical Properties: White fine powder.",
        "packing": "20kg/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an antifungal agent, often in combination with undecylenic acid, in topical powders and ointments for treating fungal skin infections.",
        "other_industries": "Antifungal agent in cosmetics and personal care products."
    },
    {
        "name": "MOPS sodium salt / MOPS-Sodium",
        "cas_no": "71119-22-7",
        "cins_no": "",
        "molecular_formula": "C7H16NNaO4S",
        "discription": "MOPS sodium salt is the sodium salt of MOPS (3-(N-morpholino)propanesulfonic acid), a zwitterionic biological buffer. It is used to prepare MOPS buffer solutions.",
        "typical_properties": "Formula Weight: 231.26. Physical Properties: White crystalline powder.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Used to prepare MOPS buffer solutions for biochemical, molecular biology, and cell culture applications. MOPS buffer is used in electrophoresis (e.g., RNA gels).",
        "other_industries": "Component of biological buffer systems in research and diagnostics."
    },
    {
        "name": "MOPS",
        "cas_no": "1132-61-2",
        "cins_no": "",
        "molecular_formula": "C7H17NO4S",
        "discription": "MOPS (3-(N-morpholino)propanesulfonic acid) is a zwitterionic buffer widely used in biochemistry and molecular biology. It is part of Good's buffers.",
        "typical_properties": "Formula Weight: 209.26. Physical Properties: White crystalline powder.",
        "packing": "25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Key component of MOPS buffer solutions used in various biological assays, cell culture media, and electrophoresis (especially for RNA). Used in diagnostic reagent kits.",
        "other_industries": "Biochemical research, diagnostics, laboratory buffer systems."
    },
    {
        "name": "Octocrylene",
        "cas_no": "6197-30-4",
        "cins_no": "",
        "molecular_formula": "C24H27NO2",
        "discription": "Octocrylene is an organic compound, an ester of diphenylcyanoacrylate with 2-ethylhexanol. It is a sunscreen agent that absorbs UVB and some UVA radiation. It can also help stabilize other sunscreen agents.",
        "typical_properties": "Formula Weight: 361.48. Physical Properties: Clear, viscous, colorless to pale yellow liquid.",
        "packing": "25kg/drum or 200kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Active ingredient in sunscreen products to provide UV protection. Also used to photostabilize other UV filters like avobenzone.",
        "other_industries": "UV filter in plastics, coatings, and personal care products."
    },
    {
        "name": "AGAROSE",
        "cas_no": "9012-36-6",
        "cins_no": "",
        "molecular_formula": "Polymer (complex carbohydrate)",
        "discription": "Agarose is a polysaccharide polymer material, generally extracted from seaweed. It is a linear polymer made up of repeating units of agarobiose. It is widely used to make gels for electrophoresis.",
        "typical_properties": "Formula Weight: Variable (polymer). Physical Properties: White to off-white powder or flakes.",
        "packing": "25kgs/drum or 25kgs/bag",
        "food_idustry": "Used as a gelling agent, thickener, and stabilizer in some food applications, similar to agar but typically more purified for specific uses (e.g., vegetarian gelatin substitute).",
        "pharmaceutical_industry": "Primary use in preparing agarose gels for electrophoresis of DNA, RNA, and proteins. Used in chromatography media, cell culture matrices, and for immobilizing enzymes or cells. Ingredient in some laxative preparations.",
        "other_industries": "Biotechnology research, diagnostics, microbiology (culture media), food industry (gelling agent)."
    }
]