[
    {
        "name": "Acetaminophen",
        "cas_no": "103-90-2",
        "cins_no": " 203-157-5",
        "molecular_formula": "C8H9NO2",
        "discription": "Acetaminophen(Paracetamol) is used to treat many conditions such as headache, muscle aches, arthritis, backache, toothaches, colds, and fevers.It relieves pain in mild arthritis but has no effect on the underlying inflammation and swelling of the joint.\n",
        "typical_properties": "Acetaminophen ( Paracetamol ) is an odorless, slightly bitter taste white crystalline powder. It is soluble in organic solvents such as methanol and ethanol but slightly soluble in water and ether. It's pH range is 5.5 - 6.5 based on saturated aqueous solution. Acetaminophen is a nonprescription analgesic and antipyretic drug similar to aspirin\n",
        "packing": "In 25kgs/bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "Acetaminophen( Paracetamol) powder nutritional supplemen Mainly used for amino acid infusion,due to special wettability, also used in cold cream,osmetics. Serine constitute the human body of several kinds of essential amino acid of protein a, for the construction of proteinhas a very important role. Paracetamol powder nutritional supplement Mainly used for amino acid infusion,due to special wettability,also used in cold cream,osmetics. Serine constitute the human body of several kinds of essential amino acid of protein a,for the construction of protein has a very important role.",
        "other_industries": ""
    },
    {
        "name": "Acetonitrile",
        "cas_no": "75-05-8",
        "cins_no": "200-835-2",
        "molecular_formula": "C2H3N",
        "discription": "Acetonitrile, primary use is as an extraction solvent for unsaturated hydrocarbons (especially butadiene) and as a general purpose solvent for many compounds including fatty acids and oils based on its selective miscibility. It is used as a general purpose solvent for many compounds. It is used in the production of fibers, rubbers, and resins. It is used as a chemical intermediate in pesticide, perfume and pharmaceutical manufacturing. It is used in high-performance liquid and gas chromatographic analysis, in extraction and refining of copper.",
        "typical_properties": "1,3-PS is colorless liquid（≥31℃）with relative density 1.392 g/mL or white crystal below 31℃. Its melting point is 30-33℃ with boiling point 180℃ and flashing point 110℃. Miscible with water, soluble in most organic solvents such as ethanol and ether.",
        "packing": "In 150 or 160 kgs in drum/ISOTANK",
        "food_idustry": "",
        "pharmaceutical_industry": "1. Chemical analysis and instrumental analysis. 2. Hydrocarbon extraction and separation solvent. 3. Acetonitrile, an intermediate for the synthesis of medicines and pesticides. 4. Semiconductor cleaning agent",
        "other_industries": "In addition to the above applications, acetonitrile can also be used as a raw material for organic synthesis, a catalyst or a component of transition metal complex catalyst. In addition, acetonitrile is also used in fabric dyeing and coating compounds, and it is also an effective stabilizer for chlorinated solvents."
    },
    {
        "name": "Acetylsalicylic acid",
        "cas_no": "50-78-2",
        "cins_no": "200-064-1",
        "molecular_formula": "C9H8O4",
        "discription": "Acetylsalicylic Acid, also known by trade name Aspirin, is an acetyl derivative of salicylic acid that is a white, crystalline, weakly acidic substance, with melting point 137°C. It is useful in the relief of headache and muscle and joint aches. Acetaminophen does not cause gastric irritation but does lower fever and relieve pain, is often substituted for Aspirin. They are widely used for the treatment of inflammatory disorders and painful conditions such as rheumatoid arthritis, gout, bursitis, painful menstruation, and headache.",
        "typical_properties": "Odorless, Colorless or a white crystalline powder odorless or slightly acetic; it will slowly hydrolyze when exposed to moisture. This product is easily soluble in ethanol, soluble in trigas methane or ether, slightly soluble in water or anhydrous ether; soluble in sodium hydroxide solution or sodium carbonate solution, but decomposes at the same time.",
        "packing": "In 25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "It is a salicylate drug that is commonly used as an analgesic, antipyretic and anti-inflammatory drug. It can also be used to treat certain specific inflammatory diseases, such as Kawasaki disease, pericarditis, and rheumatic fever. Giving it immediately after a myocardial infarction can reduce the risk of death. This product can also prevent platelets from aggregating at the site of damaged blood vessels and has an anticoagulant effect. Long-term low-dose use in patients with high cardiovascular risk can prevent heart disease, stroke and thrombosis[4]. This drug is also effective in preventing certain cancers, especially colorectal cancer[5]. For pain relief and fever, the effect of the drug generally takes effect within 30 minutes after oral administration. Aspirin is a nonsteroidal anti-inflammatory drug (NSAID). It has a similar anti-inflammatory role to other NSAIDs, but aspirin also has an antiplatelet effect.",
        "other_industries": ""
    },
    {
        "name": "Ascorbic acid",
        "cas_no": "50-81-7",
        "cins_no": "200-066-2",
        "molecular_formula": "C6H8O6",
        "discription": "Ascorbic acid , also known as Vitamin C, is a vitamin found in various foods and is also sold as a nutritional supplement to prevent and treat scurvy. Vitamin C is involve in tissue repair and the enzymatic production of certain neurotransmitters. It is required for the function of several enzymes and is important for the functioning of the immune system. It also acts as an antioxidant.",
        "typical_properties": "Ascorbic acid is easily soluble in water, slightly soluble in ethanol, insoluble in ether, chloroform, benzene, petroleum ether, oils, and fats. The aqueous solution shows an acidic reaction. It can be quickly oxidized into dehydroascorbic acid in the air, with a citric acid-like sour taste. It is a strong reducing agent, and gradually turns into light yellow to varying degrees after long storage.",
        "packing": "In 25kgs/carton",
        "food_idustry": "In food processing, it is used as a vitamin fortifier for concentrated orange juice, fruit juice crystals, candy, jelly, jam, etc.",
        "pharmaceutical_industry": "In medicine, it is mainly used to prevent or treat scurvy, as well as for dental caries, gum abscesses, anemia, growth stagnation and other diseases caused by insufficient ascorbic acid. Ascorbic acid participates in the production of collagen in the body, neutralizes toxins, promotes the production of antibodies, and enhances the body's detoxification function. ",
        "other_industries": ""
    },
    {
        "name": "Benzaldehyde",
        "cas_no": "100-52-7",
        "cins_no": "202-860-4",
        "molecular_formula": "C7H6O",
        "discription": "Benzaldehyde is the simplest representative of the aromatic aldehydes. It is a colorless liquid aldehyde with a characteristic almond odor. It is the first step in the synthesis for fragrances. It undergoes simultaneous oxidation and reduction with alcoholic potassium hydroxide, giving potassium benzoate and benzyl alcohol. It is converted to benzoin with alcoholic potassium cyanide, with anhydrous sodium acetate and acetic anhydride, giving cinnamic acid.",
        "typical_properties": "Colorless to yellow liquid with bitter almonds odor. Boiling point:179℃, Freezing point:-26℃. It is poorly soluble in water, but soluble in a variety of organic solvents like benzene, ethyl alcohol, ethylether and chlorofom. Benzaldehyde is flammable when near heat, open flame or oxidant.",
        "packing": "In 200kg/drum, ISO tank, IBC drum.",
        "food_idustry": "In the flavor industry, it is mainly used to prepare edible flavors, and a small amount is used in daily chemical flavors and tobacco flavors.",
        "pharmaceutical_industry": "Benzaldehyde is a colorless liquid with a bitter almond-like aroma. It is an important raw material for the pharmaceutical, dye, fragrance and resin industries. It is mainly used to make lauric aldehyde, lauric acid, lauric green, etc.",
        "other_industries": "Benzaldehyde is an organic compound formed when the hydrogen of benzene is replaced by an aldehyde group. Benzaldehyde is the simplest and most commonly used aromatic aldehyde in industry. It is a colorless or light yellow liquid at room temperature. Benzaldehyde is the main component of bitter almond oil extract, and can also be extracted from apricots, cherries, laurel leaves, and peach pits. The compound also exists in kernels and nuts in the form of glycosides (amygdalin). It can be used as a raw material for organic synthesis to make cinnamaldehyde, cinnamic acid and its esters, and can also be used to prepare a mixture of benzyl alcohol and benzoic acid and herbicides; it is also an intermediate for the synthesis of chloramphenicol, DL-phenylglycine, and 2-nitrobenzaldehyde."
    },
    {
        "name": "Benzoic acid",
        "cas_no": "65-85-0",
        "cins_no": "200-618-2",
        "molecular_formula": "C7H6O2",
        "discription": "Benzoic acid is an aromatic acid organic compound and the simplest aromatic acid. Benzoic acid is widely present in nature in the form of free acid, ester or its derivatives. It is mainly used to prepare sodium benzoate preservatives, and is used in the synthesis of drugs and dyes. It is also used in the preparation of plasticizers, mordants, fungicides and fragrances.",
        "typical_properties": "White crystalline powder, soluble in ethanol, slightly soluble in water, has a benzoic smell, and can sublime when heated.",
        "packing": "In 25kgs/bag,500kg/bag,1000kg/bag, polyethylene plastic bag, coating bag, super sack",
        "food_idustry": "Used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco, feed, etc. Benzoic acid has the effect of sterilization and inhibition of bacterial growth. The change of pH value has a great influence on its effect. The effect is best when the pH value is 2.5-4.5, and it is significantly reduced in alkaline medium. It is widely used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco, and feed.",
        "pharmaceutical_industry": "The effect is best when the pH value is 2.5-4.5, and it is significantly reduced in alkaline medium. It is widely used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco, and feed.",
        "other_industries": "It can improve the gloss, viscosity, strength and chemical corrosion resistance of various alkyd resin coatings, terminate the chain growth of alkyd resins, and change the crystallinity of products. It can be used as a carrier of dyes when hydrophobic polyester fibers are colored. It is used as a raw material for synthesizing benzoyl chloride and various plasticizers."
    },
    {
        "name": "Benzyl alcohol",
        "cas_no": "100-51-6",
        "cins_no": "202-859-9",
        "molecular_formula": "C7H8O",
        "discription": "Benzyl alcohol used as a general solvent for inks, paints, lacquers, and epoxy resin coatings. It is also a precursor to a variety of esters, used in the soap, perfume, and flavor industries. It is often added to intravenous medication solutions as a preservative. It is also used as a photographic developer; as a general solvent for inks, paints, lacquers, and epoxy resin coatings; a precursor to a variety of esters, used in the soap, perfume, and flavor industries.",
        "typical_properties": "Transparent liquid with slight fragrance smell. If long time exposure, it will be oxidized into benzaldehyde and benzyl acid, so it smells like the bitter almond. Boiling point: 205.4℃, Freezing point:-15.3℃. It is soluble in water with ratio 1:30 and easily soluble in alcohol, ether and chloroform.",
        "packing": "In 210kg/iron drum, IBC drum, ISO tank, Flexitank",
        "food_idustry": "Benzyl alcohol can also be used as a food additive to improve the taste of food and make it taste better, thereby promoting appetite and enhancing appetite to a certain extent.",
        "pharmaceutical_industry": "Benzyl alcohol is often used as a preservative in medicines, which can improve the stability of drugs and prevent them from decomposing. In addition, benzyl alcohol can also be used to prepare eye drops, which can relieve eye fatigue. Benzyl alcohol can also be used in medicine, cosmetics, pesticides, etc., and can play a role in decontamination.",
        "other_industries": "Benzyl alcohol can also be used to prepare dyes, which can make the color of dyes more uniform, and can also play an antibacterial role, which can play an antibacterial role to a certain extent. Benzyl alcohol can also be used in industry, which can make paints, pigments, preservatives and other substances widely used.\n"
    },
    {
        "name": "Benzyl benzoate",
        "cas_no": "120-51-4",
        "cins_no": "204-402-9",
        "molecular_formula": "C14H12O2",
        "discription": "Benzyl benzoate is used in flavor spice, pharmacy, and plasticizer. In textile auxiliaries, Benzyl Benzoate is used as lead agent, leveler and repair agent. With constant development of textile industry in worldwide, especially in dyeing, the difficulty of coloring and uniformity, becomes the main problem, while Benzyl Benzoate has a good plasticizer performance, it can treat and draw away the fiber to facilitate dye, because Benzyl Benzoate is a good solvent itself to dissolve easily and disperse dye evenly. Relative products of same property to Benzyl Benzoate, are Methylnaphthalene, Dimethylnaphthalene, Methyl Salicylate, etc. Among of them, Benzyl Benzoate is more precise, thanks to its better overall-performance.",
        "typical_properties": "Colorless or light yellow transparent liquid; Boiling point: 324℃，Freezing point: 18℃. It's insoluble in water, but soluble in a variety of organic solvents like ethyl alcohol, ethyl ether and oils.",
        "packing": "In 220kgs/drum, 225kgs/drum,1100kgs/IBC drum, plastic drum, iron drum",
        "food_idustry": "Benzyl benzoate has a fragrant and mild fragrance, so it is widely used in fragrance products such as perfumes, soaps, shampoos and cosmetics to add fragrance to them.",
        "pharmaceutical_industry": "Benzyl benzoate is used as a solvent and carrier for drugs in the pharmaceutical field. It can help drugs dissolve, stabilize and deliver, and is commonly found in oral drugs, injections and topical ointments.",
        "other_industries": "Benzyl benzoate can be used as a solvent and diluent for pesticides, and is used to make pesticide sprays and liquid fertilizers."
    },
    {
        "name": "Benzyl chloride",
        "cas_no": "100-44-7",
        "cins_no": "202-853-6",
        "molecular_formula": "C7H7Cl",
        "discription": "Benzyl chloride is widely used as an intermediate for manufacturing organic compounds including benzyl alcohol, Benzyl Cyanide and other benzyl compounds. It is used in fuel as a gum inhibitor.Its oxidation reaction with an alkali produces Benzaldehyde, alpha-Chlorinated Toluenes, used in the end applications of perfumery, dyes, pharmaceuticals, synthetic resins, photographic chemicals, warfare chemicals, Penicillins, quaternary ammonium compounds, plasticizer and esters.",
        "typical_properties": "Clear liquid with unpleasant pungent smell.Boiling point:179.6℃, Freezing point:-39.2℃. It is not soluble in water, but soluble in benzene, ethanol, ether, choloroform and other organic solvents. Benzyl Chloride is flammable when near heat, open flame or oxidant.",
        "packing": "In 200kgs plastic drum, ISO tank, IBC drum.",
        "food_idustry": "",
        "pharmaceutical_industry": "Benzyl chloride is an important chemical and pharmaceutical intermediate, used as a dye intermediate and in the synthesis of tannins, spices, and medicines. In the pharmaceutical and pesticide industries, benzyl chloride can be used to synthesize benzyl nitrile, phenylacetic acid, etc.",
        "other_industries": ""
    },
    {
        "name": "Caffeine anhydrous",
        "cas_no": "58-08-2",
        "cins_no": "200-362-1",
        "molecular_formula": "C8H8O3",
        "discription": "Caffeine anhydrous is derived from the same plants as caffeine. In fact, caffeine anhydrous and caffeine are essentially the same thing. The difference is that when it comes to anhydrous caffeine, all additional chemical components and water are filtered out in a lab. Anhydrous means, by definition, containing no water.",
        "typical_properties": "Transparent colorless to light yellow liquid. Very slightly soluble in water, miscible with ethanol (96%) as well as fats and essential oils.",
        "packing": "In 25kgs/drum,250kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Caffeine (1,3,7-trimethylxanthine) is a principle member of methylated xanthine alkaloid. Examples of structurally similar substance are theobromine (3,7-dimethylxanthine) and theophylline (1,3-Dimethylxanthine). They stimulates the heart and central nervous system, dilates bronchi and blood vessels, and causes diuresis.",
        "other_industries": ""
    },
    {
        "name": "Camphor",
        "cas_no": "76-22-2",
        "cins_no": "200-945-0",
        "molecular_formula": "C10H16O",
        "discription": "Camphor is a white crystalline bicyclic. Camphor was formerly obtained from the wood of the Taiwanese camphor laurel tree ( cinnamomum camphora ), but now is synthesized from pinene which is obtained by refining crude turpentine oil. It is used as a plasticizer in the manufacture of celluloid film and some lacquers. It is used as an insect repellent and in pyrotechnics. It provides cooling effect when applied to the skin.",
        "typical_properties": "White crystals. Melting point: 174-179 °C, Boiling point: 204 °C. Soluble in acetone, ethanol, diethylether, chloroform and acetic acid.",
        "packing": "In 25kgs/carton",
        "food_idustry": "",
        "pharmaceutical_industry": "Camphor is commonly used in creams, ointments, and lotions. Camphor oil is the oil extracted from the wood of camphor trees and processed by steam distillation. It can be used topically to relieve pain, irritation, and itching. Camphor is also used to relieve chest congestion and inflammatory conditions.",
        "other_industries": ""
    },
    {
        "name": "Crotonic acid",
        "cas_no": "3724-65-0",
        "cins_no": "223-077-4",
        "molecular_formula": "C4H6O2",
        "discription": "Crotonic acid is a short-chain unsaturated carboxylic acid. It is used in organic synthesis, manufacture of resins, pharmaceuticals. It reacts violently with bases, oxidants, reducing agents. It is found in croton oil used as a standard irritant in pharmacological research; laxative and poisonous to human.There are two isomers of crotonic acid, cis and trans, and the common crotonic acid is trans-crotonic acid.",
        "typical_properties": "White to light yellow crystalline powder. Soluble in water, ethanol, ether, toluene, acetone, etc.",
        "packing": "In 25kgs bag",
        "food_idustry": "",
        "pharmaceutical_industry": "It is mainly used to prepare various resins, fungicides, surface coatings, bactericides, plasticizers; it can also be used as important pharmaceutical intermediates, pesticide intermediates and other organic chemical intermediates. The most important use is as a raw material for polyvinyl acetate coatings.",
        "other_industries": ""
    },
    {
        "name": "DL-Tartaric Acid",
        "cas_no": "133-37-9",
        "cins_no": "201-766-0",
        "molecular_formula": "C4H6O6",
        "discription": "DL-tartaric acid is also called 2,3-dihydroxysuccinic acid, with the molecular formula: C4H6O6nH2O (crystalline product: n=1, anhydrous product n=0), It is a mixture of equal amounts of right-handed and left-handed tartaric acid, often containing one or two crystal waters, and loses water when heated to 100°C. It is widely used in the food industry, such as as a beer foaming agent, food acidulant, flavoring agent, used in refreshing drinks, candies, fruit juices, sauces, cold dishes, baking powder, etc. Its sourness is 1.3 times that of citric acid, and it is particularly suitable as a grape juice acidulant.",
        "typical_properties": "Colorless transparent crystal or white crystalline powder, odorless, sour taste, the sourness and sourness intensity are the same as L-tartaric acid. Melting point 205-206℃. Soluble in water, slightly soluble in ethanol.",
        "packing": "In 25kgs/bag",
        "food_idustry": "In the food industry used as beer foaming agent, food sour agent, flavor correction agent, etc.It also plays a very important role in tanning leather, photography, glass, enamel, telecommunications equipment and other industries.",
        "pharmaceutical_industry": "Widely used in food, medicine, chemical, light industry and other industries. Mainly used in the manufacture of Tartrate salts, such as pPotassium Antimony Tartrate, Sodium Potassium Tartrate and so on.",
        "other_industries": ""
    },
    {
        "name": "DMSO ( Dimethyl sulfoxide)",
        "cas_no": "67-68-5",
        "cins_no": "200-664-3",
        "molecular_formula": "C2H6OS",
        "discription": "Dimethyl sulfoxide (DMSO) is a sulfur-containing organic compound with the molecular formula (CH3)2SO. It is a colorless, odorless, transparent liquid at room temperature and a hygroscopic flammable liquid. It has the characteristics of high polarity, high boiling point, aprotic, miscible with water, extremely low toxicity, good thermal stability, and can be dissolved in most organic substances such as ethanol, propanol, benzene and chloroform. It is known as the \"\"universal solvent.\"\"",
        "typical_properties": "Colorless, odorless, hygroscopic and flammable transparent liquid at room temperature. It has both high polarity as well as high-boiling point. It also has aprotic and water-miscible characteristics. It has low toxicity, good thermal stability, and is not miscible with paraffin. It is soluble in water, ethanol, propanol, ether, benzene and chloroform and many other kinds of organic substance.",
        "packing": "In 225 kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "A wide range of primary pharmacological actions of Dimethyl Sulfoxide (DMSO) has been documented in laboratory studies: membrane transport, effects on connective tissue, anti-inflammation, nerve blockade (analgesia), bacteriostasis, diuresis, enhancements or reduction of the effectiveness of other drugs, cholinesterase inhibition, nonspecific enhancement of resistance to infection, vasodilation, muscle relaxation, antagonism to platelet aggregation, and influence on serum cholesterol in emperimental hypercholesterolemia. This substance induces differntiation and function of leukemic and other malignant cells. DMSO also has prophylactic radioprotective properties and cryoprotective actions. It protects against ischemic injury",
        "other_industries": ""
    },
    {
        "name": "EDTA-2Na  (  Tetrasodium ethylenediamine tetraacetate)",
        "cas_no": "6381-92-6",
        "cins_no": "205-358-3",
        "molecular_formula": "C10H14N2Na2O8",
        "discription": "The sodium salt of EDTA is used as an antidote for metal poisoning, an anticoagulant, and an ingredient in a variety of detergents. It is an important chelating agent that can chelate metal ions in the solution. It can prevent discoloration, deterioration, turbidity and oxidative loss of vitamin C caused by metals, and can also improve the antioxidant properties of oils and fats (trace metals in oils and fats, such as iron and copper, can promote the oxidation of oils and fats).Chelating agents are important in the field of soap, detergents, textile dyeing, water softening, metal finishing and plating, pulp and paper, enzyme deactivation, photo chemistry, and bacteriocides.",
        "typical_properties": "White crystalline powder. Soluble in water, able to chelate with a variety of metal ions.",
        "packing": "In 25kgs/bag, 250kgs/drum, IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used in detergents, dyeing auxiliaries, fiber treatment agents, cosmetic additives, food additives, agricultural micro-fertilizers and marine aquaculture. Disodium ethylenediaminetetraacetate (EDTA-2Na) can be used as an additive in industrial cleaners to effectively remove pollutants such as metal ions and help cleaners to better perform their cleaning effects. In the leather processing process, disodium ethylenediaminetetraacetate is used as an additive in immersion tanning agents and chrome leathers to help improve the texture and performance of leather.\n"
    },
    {
        "name": "EDTA-4Na (  Tetrasodium ethylenediamine tetraacetate)",
        "cas_no": " 64-02-8",
        "cins_no": "200-573-9",
        "molecular_formula": "C10H12N2Na4O8",
        "discription": "As one chelating agent, EDTA-4Na can be used in industrial cleaning, personal and household uses, Bleaching of pulp and textile,Micronutrients for agriculture, Polymer processing and Metalplating etc.It also used in water treatment, color sensitization, ect. By wayof additive, active agent, clarifier, metalremover.\n40% Solution is a sequestering Agent, used in various Industries such as Pharmaceutical, Photography, Textile, Boiler Turbine scale removal, Agriculture as  a Micronutrient for Plant Growth, Water Treatment, Laboratory Reagent, Food & Beverages, Cosmetics, Soaps & Detergents, etc. It is used for removing unwanted inorganic impurities present in the system, which helps in getting superior performance & cost saving.",
        "typical_properties": "White crystalline powder. Melting point (℃): 248℃， Ignition temperature (℃): 450℃. Soluble in water, slightly soluble in alcohol.",
        "packing": "In 25kgs/bag, 250kgs/drum, IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is used as a water softener, chelating agent, polymerization initiator for styrene-butadiene rubber, initiator for acrylic fiber, printing and dyeing auxiliaries, detergent auxiliaries, etc. It is also used for titration in chemical analysis, and can accurately titrate a variety of metal ions, and is widely used."
    },
    {
        "name": "Folic acid",
        "cas_no": " 59-30-3",
        "cins_no": "201-939-0",
        "molecular_formula": "C19H19N7O6",
        "discription": "Folic acid is a derivative of pteridine, originally isolated from the liver and later found to be abundant in the green leaves of plants, hence the name folic acid. It is widely found in meat, fresh fruits, vegetables.",
        "typical_properties": "Yellow or orange crystalline powder, odorless, tasteless. Insoluble in water, ethanol, acetone or ether, soluble in alkali hydroxide or carbonate.",
        "packing": "In 25kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "1. Anti-anemia drug, used for symptomatic or nutritional megaloblastic anemia.\n2. Used as a biochemical reagent, also used in the pharmaceutical industry, etc.\n3. Folic acid is an anti-anemia drug. When livestock and poultry lack folic acid, their appetite decreases, growth is stunted, and feather growth is poor. Dosage 0.5-1.0 mg/kg.\n4. As a food fortifier.\n5. Biochemical research; clinical drugs are vitamin B group, used for the treatment of pregnancy and infant megaloblastic anemia and other diseases.\n6. Folic acid is used in feed, medicine and food, but mainly in feed.\n",
        "other_industries": " Used in the polyamide industry to prepare nylon, and also used as a raw material for saturated polyurethane."
    },
    {
        "name": "Glutaraldehyde",
        "cas_no": "111-30-8",
        "cins_no": "203-856-5",
        "molecular_formula": "C5H8O2",
        "discription": "Glutaraldehyde is an organic compound with the chemical formula C5H8O2.   It is often used as a fungicide, food industry processing aid, disinfectant, tanning agent, wood preservative, medicine and raw material for polymer synthesis, etc.\n",
        "typical_properties": "Colorless or light yellow transparent liquid. It is soluble in water and easily soluble in organic solvents such as ethanol and ether.\n",
        "packing": "In 220kgs drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "Glutaraldehyde containing two aldehyde groups, it is used as a disinfectant. It is used in sterilizing medical and dental equipment which cannot be heat sterilized. It is used as a fixative for biological tissues and for leather tanning. It is used as a chemical intermediate to produce other compounds.",
        "other_industries": ""
    },
    {
        "name": " Glyoxal",
        "cas_no": "107-22-2",
        "cins_no": "203-474-9",
        "molecular_formula": "C2H2O2",
        "discription": "Glyoxal is an organic compound with a molecular formula of C2H2O2 and a molecular weight of 58.036. It is a white or off-white crystalline powder (yellow prisms or irregular flakes, turning white after cooling). It is used as a pharmaceutical intermediate, fabric finishing agent, dye and dye intermediate.\n",
        "typical_properties": "Colorless or yellow deliquescent crystals or liquids, with green vapor. Soluble in ethanol, ether, and water.\n",
        "packing": "In 250kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Glyoxal, difunctional low mole weight aldehyde, is a highly reactive intermediate used for the preparation of copolymers, dyes, pharmaceuticals, pesticides, corrosion inhibitors and photographic chemicals. It is used as a dispersant water soluble polymers, starches, cellulosic materials, proteins (casein, gelatin and animal glue), and polyhydroxyl groups. It is used in soil and cement stabilizing. It is also used to improve moisture resistance in paper, leather and glue. It is used in embalming fluids, for leather tanning, and for rayon shrink-proofing. It is used as a sulfide scavenger."
    },
    {
        "name": "Imidazole",
        "cas_no": "288-32-4",
        "cins_no": "206-019-2",
        "molecular_formula": "C3H4N2",
        "discription": "Imidazole is a heterocyclic compound of five-membered diunsaturated ring structure composed of three carbon atoms and two nitrogen atoms at nonadjacent positions. The simplest member of the imidazole family is imidazole itself, colorless to pale yellow crystalline solid with a weak aminelike odor; soluble in water and alcohol, melts at 89 C, boils at 256 C. Imidazoles are poorly soluble in water generally, but are dissolved in organic solvents, such as chloroform, propylene glycol, and polyethoxylated castor oil. Imidazole ring is found in histidine (an essential amino acid) and histamine, the decarboxylated compound from histamine. Some imidazole compounds inhibit the biosynthesis of ergosterol, required in cell membrane in fungal. They have antibacterial, antifungal, antiprotozoal, and anthelmintic activity. Imidazole and its derivatives are widely used as intermediates in synthesis of organic target compounds including pharmaceuticals, agrochemicals, dyes, photographic chemicals, corrosion inhibitors, epoxy curing agents, adhesives and plastic modifiers.\n",
        "typical_properties": "Clear to pale yellow crystalline flake. It has an ammonia smell.   Melting point 89～91℃, boiling point 255-256℃. Flash point 145℃. Slightly soluble in benzene and petroleum ether, soluble in ether, acetone, chloroform, pyridine, and easily soluble in water (70°C at room temperature) and ethanol.\n",
        "packing": "In 25kgs/bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "It is also used as a raw material and organic synthesis intermediate for urea-formaldehyde resin curing agents, photographic drugs, adhesives, coatings, rubber vulcanizers, antistatic agents, etc., and is also widely used as a preservative for fruits.",
        "other_industries": "Imidazole is an important fine chemical raw material, mainly used in the synthesis of medicines and pesticides and epoxy resin curing agent, used as a pesticide raw material, used as a synergist for boric acid preparations, and used to prepare insecticides and fungicides. As an epoxy resin curing agent, it can improve the mechanical properties of products such as bending, stretching, and compression, improve the electrical properties of insulation, and improve the chemical resistance of chemical agents. It is widely used in computers and electronic devices. In medicine, it is used in imidazole antifungal drugs. It is one of the main raw materials for drugs such as dichlorobenzamide, econazole, ketoconazole, and clotrimazole. It can be used as a copper rust inhibitor for printed circuit boards and integrated circuits."
    },
    {
        "name": "Mannitol",
        "cas_no": " 87-78-5",
        "cins_no": "   201-770-2",
        "molecular_formula": "C6H14O6",
        "discription": "Mannitol is a hexanol with a sweet taste. Because of the absorption of heat during the dissolution, it has a comfortable feeling to the mouth, so it is widely used in the manufacture of chewing tablets such as antialcoholic medicine and mouth cooling agent Mannitol granules are used as excipients for direct compression in tablets and Mannitol can be used as base materials for nitroglycerin tablets.\n",
        "typical_properties": "White crystals or crystalline powder, odorless, sweet. This product is easily soluble in water, slightly soluble in ethanol, and almost insoluble in ether.",
        "packing": "In 25kg/drum, 25kg/carton\n",
        "food_idustry": "Mannitol as food additives, are allowed in the cold drinks, cakes, fruit juice, biscuits, bread, pickles, candy, can according to production needs to determine the dosage, When manufacturing suspended juice drinks or lactic acid drinks, add Mannitol to replace part of sugar, can make the drink taste full lubrication.",
        "pharmaceutical_industry": "Mannitol is used as raw materials for large volume parenterals, to produce Mannitol Injection, which has the efficacy of reducing intracranial pressure, intraocular pressure and diuresis. As filler and excipient Mannitol is used in tablets for Anticancer medicine, Antibacterial medicine. Antihistamines medicine, Vitamins, Antialcoholic medicine, Refreshing agent. As cerebral vasodilator, Mannitol is for the treatment of cerebral vascular infarction, As diuretics, Mannitol is a mild laxative, it has special effects on oliguria and renal function deline caused by edema and burns.",
        "other_industries": ""
    },
    {
        "name": "  Methane sulfonic acid",
        "cas_no": "75-75-2",
        "cins_no": "200-898-6",
        "molecular_formula": "CH4O3S",
        "discription": "Methane sulfonic acid is an organic compound with the chemical formula CH4O3S. Methanesulfonic acid is a raw material for medicine and pesticides. It can also be used as a dehydrating agent, coating curing accelerator, fiber treatment agent, solvent, and catalyst for esterification, esterification and polymerization reactions.\n",
        "typical_properties": "Clear, colorless liquid, soluble in water, alcohol and ether, but insoluble in alkanes, benzene, toluene, etc. It does not decompose in boiling water or hot alkali solution, and has a strong corrosive effect on metals such as iron, copper and lead.\n",
        "packing": "In 250kgs drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Methylsulfonic acid has applications in the fields include: Electroplating and electrochemical processes/Alkylation, esterification and condensation reactions/Lead recovery/Chemical intermediate for manufacture of drugs and pesticides/Petroleum refining and lube oil additives /Extraction and process solvent/Plastic stabilizers."
    },
    {
        "name": "Methyl Salicylate",
        "cas_no": " 119-36-8",
        "cins_no": "204-317-7",
        "molecular_formula": "C8H8O3",
        "discription": "Methyl salicylate is the main component of wintergreen oil, which is found in trees, legumes, and exotic plants. It is produced from salicylic acid. Methyl salicylate acts as a flavoring agent in chewing gum, syrups, and ice cream. It has anti-irritant and anti-inflammatory properties.",
        "typical_properties": "Transparent colorless to light yellow liquid. Very slightly soluble in water, miscible with ethanol (96%) as well as fats and essential oils.\n",
        "packing": "In 25kgs/drum,250kgs/drum\n",
        "food_idustry": " Used in organic synthesis: mainly used for synthetic plastics, especially for the synthesis of diazonium ketone polyaryletherketone polyaryletherketone polymers. Due to their excellent heat resistance, water resistance, chemical corrosion resistance, heat aging resistance and good processing and forming properties, the fibers, coatings and composite materials made from them are quickly widely used in electronic appliances, mechanical equipment, transportation, aerospace, atomic energy engineering and military fields.",
        "pharmaceutical_industry": "Pharmaceutical raw materials in the pharmaceutical industry: suitable for habitual and stubborn constipation, with tablets, suppositories and other dosage forms.",
        "other_industries": "Used as acid-base indicators, indicators for non-aqueous solution titration, and reagents for chromatographic analysis."
    },
    {
        "name": "Phenolphthalein ",
        "cas_no": "77-09-8",
        "cins_no": "  201-004-7",
        "molecular_formula": "C20H14O4",
        "discription": "Phenolphthalein is a compound with the molecular formula C20H14O4, commonly represented by \"\"PP\"\", \"\"HIn\"\", \"\"HPh\"\", \"\"phph\"\" or \"\"Ph\"\" as shorthand symbols. Phenolphthalein is commonly used as an acid-base indicator and has also been used as a stimulant laxative. Phenolphthalein becomes colorless in acidic solutions and pink in alkaline solutions. It belongs to the phthalein dyes.",
        "typical_properties": "White powder. Melting point 258-262℃, relative density 1.27. Soluble in 10 parts of alcohol, dark red in dilute alkali solution, slightly soluble in ether, insoluble in water, odorless and tasteless.\n",
        "packing": "In 25kgs/drum",
        "food_idustry": "Used in organic synthesis: mainly used for synthetic plastics, especially for the synthesis of diazonium ketone polyaryletherketone polyaryletherketone polymers. Due to their excellent heat resistance, water resistance, chemical corrosion resistance, heat aging resistance and good processing and forming properties, the fibers, coatings and composite materials made from them are quickly widely used in electronic appliances, mechanical equipment, transportation, aerospace, atomic energy engineering and military fields.",
        "pharmaceutical_industry": " Pharmaceutical raw materials in the pharmaceutical industry: suitable for habitual and stubborn constipation, with tablets, suppositories and other dosage forms.",
        "other_industries": "Used as acid-base indicators, indicators for non-aqueous solution titration, and reagents for chromatographic analysis."
    },
    {
        "name": " Potassium acetate",
        "cas_no": "0127-08-02",
        "cins_no": " 204-822-2",
        "molecular_formula": "CH3CO2K",
        "discription": "Potassium acetate is a colorless crystalline solid with a pungent taste. It is a salt compound of acetic acid and potassium ions. Potassium acetate solution is a catalyst that has catalytic effect on the reaction of isocyanate trimerization to form polyisocyanurate. It can be used together with other catalysts such as tertiary amines and potassium isooctanoate to meet various rigid foam casting and spraying processes, and has the characteristics of fast foaming and gelling. The cost of this catalyst is relatively low. Potassium acetate powder is mainly used in the production of potassium salt of penicillin and as a chemical reagent.\n",
        "typical_properties": "White crystalline powder, easily deliquescent, with alkaline taste. Soluble in water and ethanol, insoluble in ether.\n",
        "packing": "In 25kgs/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "In pharm industry, Potassium Acetate is used in the synthesis of medicines ( antibiotics, potassium penicillins).",
        "other_industries": "It is used as a textile conditioner, catalyst in the production of polyurethanes, polymers and carbon black, It is also used in manufacturing of crystal glass."
    },
    {
        "name": "Propyl P-Hydroxybenzoate",
        "cas_no": "0127-08-02",
        "cins_no": " 202-307-7",
        "molecular_formula": "C10H12O3",
        "discription": "Propyl p-hydroxybenzoate is an organic compound with the molecular formula C10H12O3. It is a small colorless crystal or white powder. It is almost insoluble in cold water. It is odorless and slightly astringent. It is esterified by p-hydroxybenzoic acid and n-propanol in the presence of sulfuric acid, and then neutralized, washed, dried and refined into a finished product. It is mainly used as a preservative for food, cosmetics, feed, etc. It can improve the preservative ability and solubility when used in combination with ethyl p-hydroxybenzoate.",
        "typical_properties": "It is white crystalline and easily dissolved in alcohol and ether, but not dissolved in water. Its relative density (d102 4) is 1.0630 and index of refraction is (nD102) 1.5050\n",
        "packing": "10kgs or 25kgs cardboard drum. It is also packed in carton containing 20 plastic bags, 1 kg per bag.\n",
        "food_idustry": "This product is mainly used as antiseptics in foodstuff, medicine and cosmetics.",
        "pharmaceutical_industry": "It can also be used in feed as antiseptics.",
        "other_industries": ""
    },
    {
        "name": "Pyrogallol",
        "cas_no": "87-66-1",
        "cins_no": "201-762-9",
        "molecular_formula": "C6H6O3",
        "discription": "It is used in as a reagent for pentoses, pentosans, glycuronates, hydrochloric acid in gastric juice. It is an excellent bone decalcifying agent and a floral preservative. It is used in the manufacture of pharmaceuticals. The 1,2,4- isomer is hydroxyquinol ( or called hydroxyhydroquinone ). Trihydroxybenzenes have three hydroxyl groups in one benzene ring. They can derive numerous esters and salts. They are used as chemical intermediate to synthesis target molecules of pharmaceuticals, pesticides, stabilizer, antioxidant, colorants, perfumes, photoinitiators, and other organic compounds.\n",
        "typical_properties": "Very Fine Crystalline Powder, soluble in water，Stable, but decolourises in light. Combustible. Incompatible with strong oxidising agents, alkalies, metal oxides, ammonia, antipyrine, phenol, iodine, lime water, menthol, potassium permanganate, strong bases.",
        "packing": "In 25kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is used for preparing colloidal metal solutions, coloring leather, dyeing fur and hair, etching, etc. It can also be used as a developer for film, infrared photography thermosensitive agent, styrene and polystyrene polymerization inhibitor, intermediate for medicine and dyes, and analytical reagent, etc. In cosmetics, it is used in face powder, hair conditioner, hair dye, etc. As a metal complexing agent, it is used for gravimetric determination of bismuth and antimony; it is a reducing agent for gold, silver, mercury salts, phosphomolybdic acid and phosphotungstic acid, and is used to absorb oxygen in gas analysis; it is used to separate titanium, iron and aluminum when determining tantalum and niobium; it is used in the color development reaction of nitrite, molybdenum, niobium, titanium, cerium, bismuth, copper, vanadium, iron, iodate, etc."
    },
    {
        "name": "Sodium acetate",
        "cas_no": "0127-09-03",
        "cins_no": "204-823-8",
        "molecular_formula": "C2H3NaO2",
        "discription": "Sodium acetate is an organic substance that can be used as a buffer, mordant, for the determination of lead, copper, nickel, and iron, culture medium preparation, organic synthesis, and film printing.",
        "typical_properties": "Colorless and odorless, transparent crystals or white granules, easily soluble in water, slightly soluble in ethanol and ether.",
        "packing": "In 25kg bag",
        "food_idustry": "Sodium acetate is used as buffers in petroleum production and drilling muds, in food preservations, and in electroplating.",
        "pharmaceutical_industry": "",
        "other_industries": "It is used as a retardant in elastomer industry. It is used in tanning to effect a more even and rapid penetration of the tan in the leather industry. It is also used as a mordant in dyeing processes. Sodium Acetate is an intermediate to manufacture organic compounds like dyes, pigments, pharmaceuticals, cinnamic acid. It is also used in soap industry and purification of glucose."
    },
    {
        "name": "D-Sorbitol",
        "cas_no": "50-70-4",
        "cins_no": "200-061-5",
        "molecular_formula": "C6H14O6",
        "discription": "Sorbitol is a type of carbohydrate that falls into a category of sugar alcohols called polyols. It's found in some fruits and is also   commercially manufactured to preserve moisture and add sweetness. It is colorless, odorless, clear and sweet. It is a thick liquid or white crystalline powder with excellent freshness, fragrance, color and moisture retention properties. It is widely used in food, medicine, chemical and other industries.\n",
        "typical_properties": "As a white crystalline powder, odorless, taste slightly sweet, slightly hygroscopic. Soluble in water, soluble in ethanol. 5.48% aqueous solution of isotonic solution. Injection system: colorless clear liquid.\n",
        "packing": "Powder:   25kg/bag\nLiquid:     250 or 270kg/steel drum\n",
        "food_idustry": "All kinds of candies: good taste, anti-cracking, anti-oxidation, quality preservation, fragrance preservation, sugar-free. All kinds of cakes and biscuits: good flavor, anti-cracking, extended storage period, appearance preservation, sugar-free. Fish products: good freezing protection, good moisturizing effect, low sweetness, anti-browning. Beverages, ice cream, jelly, etc.: moisturizing, low sweetness, anti-caries, sugar-free.",
        "pharmaceutical_industry": "As raw material for vitamin C production.\nAs raw material for syrup, injection infusion, and pharmaceutical tableting.\nAs drug dispersant, filler, cryoprotectant, anti-crystallization agent, wetting agent, sweetener.",
        "other_industries": "Used in the production of surfactants such as Span and Tween, polyether, and plastic additives. Used in toothpaste, it can keep the toothpaste lubricated, with good color and taste.\nUsed in cosmetics, it can enhance the stretchability and lubricity of emulsifiers and adapt to long-term storage.\nUsed in cigarettes, making the winding line soft and not producing empty heads."
    },
    {
        "name": " Succinic acid",
        "cas_no": "  1210-15-6",
        "cins_no": "203-740-4",
        "molecular_formula": "C4H6O4",
        "discription": "Succinic acid, also known as butyric acid, is a dicarboxylic acid. An important use of succinic acid is to prepare five-membered heterocyclic compounds. For example, succinic acid loses water rapidly when heated to form succinic anhydride, which is a furan ring compound. Succinic anhydride is an important raw material for manufacturing drugs, dyes and alkyd resins. Succinic anhydride and ammonia are heated together to form succinimide. The hydrogen on the imino group of succinimide can be replaced by bromine to form N-bromosuccinimide, which is a brominating agent and mild oxidant for organic synthesis. Succinic acid has antispasmodic, expectorant and diuretic effects in medicine. Diethyl succinate is an important intermediate in organic synthesis. Dibutyl succinate and dioctyl succinate are plasticizers for plastics. Diallyl succinate is copolymerized with 1,3-butadiene to make artificial rubber.\n",
        "typical_properties": "Colorless crystals, flammable, soluble in water, ethanol, ether, insoluble in carbon tetrachloride.\n",
        "packing": "In 25 kgs bag，1,000 kgs jumbo bag\n",
        "food_idustry": "Succinic acid is commonly used in various industries. Used as an intermediate in the production of various chemicals. Also used in the food industry as a flavoring agent and acidity regulator.",
        "pharmaceutical_industry": "In the pharmaceutical industry, succinic acid is used as an excipient in the formulation of drugs. It can be used as a pH regulator, buffering agent, and solubilizing agent. The mechanism of action in pharmaceutical applications involves succinic acid's ability to maintain the stability and efficacy of drugs.",
        "other_industries": ""
    },
    {
        "name": "Taurine",
        "cas_no": " 107-35-7",
        "cins_no": "203-483-8",
        "molecular_formula": "C2H7NO3S",
        "discription": "Taurine exists in almost all organisms among the mammals of the major organs, such as: heart, brain, liver and higher levels; Taurine is the most abundant fish, shellfish class, such as cuttlefish, octopus, shrimp, shellfish, oysters, conch, clams, etc. Fish in the mackerel, horse mackerel, sardines and other Taurine content is very rich. In fish, the fish back blackened parts Taurine levels are more. It can prevent cardiovascular disease and improve the endocrine status, and enhance the body immunity, anti-fatigue,\nsuppress the development of cataracts, has a strong role in health care.",
        "typical_properties": "White crystals or crystalline powder, odorless, chemically stable, soluble in organic solvents such as ether.\n",
        "packing": "In 25kgs/drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Taurine, as a product of methionine and cysteine metabolism, functions in a wide array of animals' (including human) metabolic physical phenomena. It is also known as it reduces blood sugar level.\nTaurine is used as a functional food in many energy drinks and energy products. In medicine, taurine is contained in some drugs for common cold, fever, neuralgia, tonsillitis, bronchitis, rheumatic arthritis, eye disease and medicine poisoning.\n",
        "other_industries": ""
    },
    {
        "name": " Triclosan",
        "cas_no": "  3380-34-5",
        "cins_no": "222-182-2",
        "molecular_formula": "C12H7Cl3O2",
        "discription": "Triclosan (TCS) is a broad-spectrum antibacterial agent that can kill microorganisms indiscriminately and rapidly. It is widely used in daily necessities such as soap and toothpaste.\n",
        "typical_properties": "Triclosan, a derivative of diphenyl ether, is a very popular antibacterial agent. It is insoluble in water; but fat-soluble. It disables the activity of the enzyme called ENR (enoyl-acyl carrier-protein reductase) which humans don't have. (So triclosan is harmless to human). This enzyme is vital in building cell membranes of many bacteria and funguses. Both are used in hospitals for cleansing and disinfecting the skin of patients and surgeons. It is used in cosmetics, household goods and personal care products. It is also used in plastics (children's toys) and textiles (kitchen and table goods) for antibacterial activity purpose.",
        "packing": "In 25kgs/drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": " Excellent chemical book storage stability: It will not decompose rapidly below 280-290℃; only 2% of active substances decompose when heated at 200℃ for 14 hours, and even only slightly decompose under long-term ultraviolet light. Its solution is stable to acids and alkalis.",
        "other_industries": ""
    },
    {
        "name": "ACETYL ACETONE",
        "cas_no": "123-54-6",
        "cins_no": "",
        "molecular_formula": "C5H8O2",
        "discription": "Acetylacetone (2,4-pentanedione) is a versatile diketone commonly used as a chelating agent and a building block in organic synthesis, particularly for heterocyclic compounds relevant to pharmaceuticals.",
        "typical_properties": "Colorless to pale yellow liquid with a pleasant, ketone-like odor. Exists in keto-enol tautomeric forms. Boiling point: ~140°C. Soluble in water and organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a precursor in the synthesis of various pharmaceutical active ingredients (APIs) and intermediates, especially for heterocyclic compounds (e.g., pyrimidines, pyrazoles). Also used in the formation of metal acetylacetonates which can act as catalysts or be part of drug delivery systems.",
        "other_industries": "Synthesis of metal acetylacetonate catalysts, extraction solvent, corrosion inhibitors, intermediate for pesticides and dyes."
    },
    {
        "name": "ISOPROPENYL ACETATE",
        "cas_no": "108-22-5",
        "cins_no": "",
        "molecular_formula": "C5H8O2",
        "discription": "Isopropenyl acetate is an enol ester that serves as an efficient acetylating agent, particularly for forming enol acetates from ketones, a reaction useful in pharmaceutical synthesis.",
        "typical_properties": "Colorless liquid with an ester-like odor. Boiling point: ~97°C. Immiscible with water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an acetylating agent and for the preparation of enol acetates which are versatile intermediates in the synthesis of steroids, prostaglandins, and other complex pharmaceutical molecules. It can be used to introduce an acetyl group under mild conditions.",
        "other_industries": "Monomer for polymers, intermediate in organic synthesis, production of acetic anhydride and acetone."
    },
    {
        "name": "OXALYL CHLORIDE",
        "cas_no": "79-37-8",
        "cins_no": "",
        "molecular_formula": "C2Cl2O2",
        "discription": "Oxalyl chloride is a highly reactive diacid chloride, primarily used as a reagent for the synthesis of other acid chlorides from carboxylic acids and for Swern oxidation, both critical reactions in pharmaceutical manufacturing.",
        "typical_properties": "Colorless fuming liquid with a pungent odor. Boiling point: ~63-64°C. Reacts violently with water and alcohols. Soluble in chlorinated solvents, ethers.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Key reagent in pharmaceutical synthesis for converting carboxylic acids to acyl chlorides (intermediates for amides, esters). Widely used in Swern oxidation to convert primary and secondary alcohols to aldehydes and ketones, respectively, essential for synthesizing many APIs.",
        "other_industries": "Reagent in organic synthesis, preparation of dyes and other chemical intermediates."
    },
    {
        "name": "METHYL OXALYL CHLORIDE",
        "cas_no": "5781-53-3",
        "cins_no": "",
        "molecular_formula": "C3H3ClO3",
        "discription": "Methyl oxalyl chloride is an acylating reagent used to introduce the methoxyoxalyl group (CH3OC(O)C(O)-) into organic molecules, a step often utilized in the construction of pharmaceutical intermediates.",
        "typical_properties": "Colorless to pale yellow liquid. Reactive towards water and nucleophiles. Boiling point: ~120°C (decomposes).",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a specialized acylating agent in the synthesis of various pharmaceutical compounds, including esters, amides, and ketoesters that are precursors to more complex APIs. It allows for the introduction of a C2 unit with differential reactivity.",
        "other_industries": "Fine chemical synthesis, research chemical."
    },
    {
        "name": "ETHYL OXALYL CHLORIDE",
        "cas_no": "4755-77-5",
        "cins_no": "",
        "molecular_formula": "C4H5ClO3",
        "discription": "Ethyl oxalyl chloride is an acylating reagent used for the introduction of the ethoxyoxalyl group (CH3CH2OC(O)C(O)-) into organic compounds, facilitating the synthesis of various pharmaceutical building blocks.",
        "typical_properties": "Colorless to light yellow liquid. Reactive, particularly with water and nucleophiles. Boiling point: ~135-137°C.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Serves as an acylating agent to introduce the ethoxyoxalyl moiety, which is a valuable building block for synthesizing α-keto esters, amides, and heterocyclic compounds used as intermediates in drug development (e.g., in the synthesis of quinolones).",
        "other_industries": "Fine chemical synthesis, intermediate for agrochemicals."
    },
    {
        "name": "4-CHLORONITROBENZENE",
        "cas_no": "100-00-5",
        "cins_no": "",
        "molecular_formula": "C6H4ClNO2",
        "discription": "4-Chloronitrobenzene (p-Chloronitrobenzene) is a key aromatic intermediate, with its nitro and chloro groups providing versatile reaction sites for further elaboration into pharmaceutical compounds.",
        "typical_properties": "Pale yellow crystalline solid with a characteristic odor. Melting point: ~83-86°C. Insoluble in water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Crucial intermediate in the manufacture of numerous pharmaceuticals. The nitro group can be reduced to an amino group (e.g., to form p-chloroaniline, an intermediate for dapsone or chlorzoxazone), and the chlorine can be displaced by nucleophiles. Used in the synthesis of paracetamol, phenacetin, and other APIs.",
        "other_industries": "Intermediate for dyes (azo dyes), pigments, rubber chemicals, pesticides, and corrosion inhibitors."
    },
    {
        "name": "1-BROMO-5-CHLOROPENTANE",
        "cas_no": "54512-75-3",
        "cins_no": "",
        "molecular_formula": "C5H10BrCl",
        "discription": "1-Bromo-5-chloropentane is a difunctional haloalkane used as an alkylating agent and a C5 building block in pharmaceutical synthesis, allowing for the construction of carbon chains or cyclic systems.",
        "typical_properties": "Colorless to pale yellow liquid. Boiling point: ~195-200°C. Immiscible with water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a bifunctional alkylating agent in the synthesis of pharmaceutical intermediates. The differential reactivity of bromine and chlorine can be exploited for sequential reactions. It can be used to form piperidine rings or other cyclic structures, or to link molecular fragments in API synthesis.",
        "other_industries": "General organic synthesis, intermediate for other fine chemicals."
    },
    {
        "name": "1-BROMO-4-CHLOROBUTANE",
        "cas_no": "6940-78-9",
        "cins_no": "",
        "molecular_formula": "C4H8BrCl",
        "discription": "1-Bromo-4-chlorobutane is a C4 bifunctional haloalkane, serving as a versatile building block for creating various carbon skeletons and heterocyclic rings in pharmaceutical synthesis.",
        "typical_properties": "Colorless to light yellow liquid. Boiling point: ~175-177°C. Insoluble in water, soluble in common organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Employed as a bifunctional alkylating agent to synthesize pharmaceutical intermediates. Useful for creating C4 chains or for cyclization reactions, such as forming pyrrolidine or tetrahydrofuran rings, which are common moieties in many drugs (e.g., intermediates for Buspirone).",
        "other_industries": "Organic synthesis intermediate."
    },
    {
        "name": "ETHYL BROMOACETATE",
        "cas_no": "105-36-2",
        "cins_no": "",
        "molecular_formula": "C4H7BrO2",
        "discription": "Ethyl bromoacetate is a reactive α-haloester and a lachrymator, widely used as an alkylating agent to introduce the carboxymethyl (-CH2COOEt) group in the synthesis of pharmaceutical compounds.",
        "typical_properties": "Colorless to pale yellow liquid with a pungent, irritating odor. Boiling point: ~159°C. Lachrymator. Slightly soluble in water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Key C2 electrophilic building block for alkylating various nucleophiles (amines, phenols, thiols, carbanions). Used in the Reformatsky reaction, synthesis of β-keto esters, glycine derivatives, coumarins, and various heterocyclic systems crucial for many APIs (e.g., barbiturates, some NSAIDs intermediates).",
        "other_industries": "Intermediate in organic synthesis, preparation of pesticides and fragrances. Historically used as a tear gas component."
    },
    {
        "name": "1,6 – DICHLOROHEXANE",
        "cas_no": "2163-00-0",
        "cins_no": "",
        "molecular_formula": "C6H12Cl2",
        "discription": "1,6-Dichlorohexane is a difunctional alkylating agent providing a C6 linear chain, used in pharmaceutical synthesis for forming larger rings, polymers, or linking molecular units.",
        "typical_properties": "Colorless liquid. Boiling point: ~203-205°C. Insoluble in water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a bifunctional building block or cross-linking agent in the synthesis of various pharmaceutical compounds and polymers. It can facilitate the formation of macrocycles or link two different pharmacophoric units, essential for creating some API structures.",
        "other_industries": "Monomer for the synthesis of polymers (e.g., polyamides, polyurethanes), solvent, organic synthesis intermediate."
    },
    {
        "name": "VALERONITRILE",
        "cas_no": "110-59-8",
        "cins_no": "",
        "molecular_formula": "C5H9N",
        "discription": "Valeronitrile (pentanenitrile) is an aliphatic nitrile that serves as an intermediate and solvent in organic synthesis, with the nitrile group offering a pathway to amines, amides, or carboxylic acids important for pharmaceutical derivatives.",
        "typical_properties": "Colorless liquid with an almond-like odor. Boiling point: ~140-141°C. Sparingly soluble in water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an intermediate in the synthesis of various pharmaceutical compounds. The nitrile group can be hydrolyzed to valeric acid (pentanoic acid), reduced to pentylamine, or react with Grignard reagents, providing access to precursors for drugs like valproic acid derivatives or other APIs.",
        "other_industries": "Solvent for some polymers and resins, intermediate for rubber chemicals, plasticizers, and agrochemicals."
    },
    {
        "name": "DIPHENYL CHLOROPHOSPHATE",
        "cas_no": "2524-64-3",
        "cins_no": "",
        "molecular_formula": "C12H10ClO3P",
        "discription": "Diphenyl chlorophosphate is a reactive phosphorylating agent used to introduce a diphenyl phosphate group to alcohols or amines, a key step in the synthesis of biologically active phosphate esters or phosphoramidates.",
        "typical_properties": "Colorless to pale yellow oily liquid with a pungent odor. Boiling point: ~185-190°C at reduced pressure. Reacts with water. Soluble in aprotic organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a phosphorylating agent in the synthesis of phosphate esters and phosphoramidates, which are important motifs in nucleoside analogs (antiviral, anticancer drugs), phospholipids, and enzyme inhibitors. Also employed in peptide synthesis for activating amino acids.",
        "other_industries": "Reagent in organic synthesis, intermediate for flame retardants and plasticizers."
    },
    {
        "name": "TRIETHYLSILANE",
        "cas_no": "617-86-7",
        "cins_no": "",
        "molecular_formula": "C6H16Si",
        "discription": "Triethylsilane (TESH) is a hydridosilane commonly used as a mild and selective reducing agent in organic synthesis, particularly for ionic hydrogenations and deoxygenations relevant to pharmaceutical intermediate preparation.",
        "typical_properties": "Colorless liquid with a characteristic pungent odor. Boiling point: ~107-109°C. Highly flammable. Reacts with water to release hydrogen. Soluble in many organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a reducing agent, especially in combination with strong acids (e.g., trifluoroacetic acid) for the reduction of alkenes, aldehydes, ketones, imines, and ethers to alkanes or alcohols. It is also used for the deprotection of certain silyl ethers and in hydrosilylation reactions.",
        "other_industries": "Reducing agent in organic synthesis, silylating agent, component in silicone polymer chemistry."
    },
    {
        "name": "TRIETHYLCHLOROSILANE",
        "cas_no": "994-30-9",
        "cins_no": "",
        "molecular_formula": "C6H15ClSi",
        "discription": "Triethylchlorosilane (TESCl) is a silyl halide used to introduce the triethylsilyl (TES) protecting group onto hydroxyl, amino, and thiol groups in pharmaceutical synthesis. TES ethers are moderately stable and easily cleaved.",
        "typical_properties": "Colorless, fuming liquid with a pungent odor. Boiling point: ~144-146°C. Reacts with water and protic solvents. Soluble in aprotic organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a silylating agent to protect alcohols as TES ethers, amines as TES amines, etc., during multi-step syntheses of active pharmaceutical ingredients (APIs). The TES group offers different stability and cleavage conditions compared to other silyl groups.",
        "other_industries": "Silylating agent in organic synthesis, surface modification, intermediate for other silicon compounds."
    },
    {
        "name": "TERT-BUTYLDIMETHYLCHLOROSILANE",
        "cas_no": "18162-48-6",
        "cins_no": "",
        "molecular_formula": "C6H15ClSi",
        "discription": "Tert-butyldimethylchlorosilane (TBDMSCl or TBSCl) is one of the most common silylating reagents used to introduce the tert-butyldimethylsilyl (TBDMS or TBS) protecting group onto primary and secondary alcohols. TBDMS ethers are robust and widely used in pharmaceutical synthesis.",
        "typical_properties": "White to off-white crystalline solid or colorless liquid (melts around room temperature, ~28-32°C). Pungent odor. Reacts with moisture. Soluble in aprotic organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Extensively used to protect hydroxyl groups as TBDMS ethers during the synthesis of complex APIs like prostaglandins, macrolides, and nucleosides. TBDMS ethers are stable to many reaction conditions but can be selectively removed, making them ideal for multi-step transformations.",
        "other_industries": "Protecting group in organic synthesis, silylating agent for analytical derivatization."
    },
    {
        "name": "TERT-BUTYLDIPHENYLCHLOROSILANE",
        "cas_no": "58479-61-1",
        "cins_no": "",
        "molecular_formula": "C16H21ClSi",
        "discription": "Tert-butyldiphenylchlorosilane (TBDPSCl) is a silylating agent that introduces the bulky tert-butyldiphenylsilyl (TBDPS) protecting group, which is significantly more stable than TBDMS, especially to acidic conditions. It is preferred for protecting primary alcohols selectively.",
        "typical_properties": "Colorless to pale yellow liquid or low-melting solid. Pungent odor. Reacts with moisture. Soluble in aprotic organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used to protect hydroxyl groups, particularly primary alcohols, as TBDPS ethers in the synthesis of complex pharmaceutical molecules where high stability of the protecting group is required. The steric bulk allows for selective protection. Cleaved under harsher conditions (e.g., fluoride ions like TBAF).",
        "other_industries": "Protecting group in organic synthesis, particularly for primary alcohols."
    },
    {
        "name": "N,O-BIS(TRIMETHYLSILYL)ACETAMIDE",
        "cas_no": "10416-59-8",
        "cins_no": "",
        "molecular_formula": "C8H21NOSi2",
        "discription": "N,O-Bis(trimethylsilyl)acetamide (BSA) is a powerful silylating agent used to introduce trimethylsilyl (TMS) groups onto various functional groups like hydroxyls, carboxyls, amines, and amides. It produces volatile byproducts, making it ideal for derivatization.",
        "typical_properties": "Colorless to pale yellow liquid. Pungent, amine-like odor. Moisture sensitive. Boiling point: ~71-73°C at 35 mmHg. Soluble in most aprotic organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Widely used as a silylating reagent for protecting functional groups during pharmaceutical synthesis and for derivatizing polar compounds (e.g., drugs, metabolites, amino acids, steroids) to increase their volatility and thermal stability for analysis by gas chromatography (GC) and GC-mass spectrometry (GC-MS).",
        "other_industries": "Silylating agent in organic synthesis, derivatization reagent for chromatography."
    },
    {
        "name": "BIS(TRIMETHYLSILYL)TRIFLUOROACETAMIDE",
        "cas_no": "25561-30-2",
        "cins_no": "",
        "molecular_formula": "C8H18F3NOSi2",
        "discription": "Bis(trimethylsilyl)trifluoroacetamide (BSTFA) is a highly reactive and powerful silylating agent, even more so than BSA. It is particularly effective for derivatizing a wide range of polar compounds by converting active hydrogens to trimethylsilyl ethers, esters, or amines.",
        "typical_properties": "Colorless liquid. Pungent odor. Highly moisture sensitive. Often supplied with 1% TMCS as a catalyst. Soluble in many aprotic organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Predominantly used as a derivatization reagent for GC and GC-MS analysis of pharmaceuticals, illicit drugs, metabolites, natural products, and other biologically active compounds. It rapidly silylates hydroxyl, carboxyl, amine, thiol, and phosphate groups, enhancing volatility and detectability.",
        "other_industries": "Strong silylating agent, derivatization reagent for analytical chemistry."
    },
    {
        "name": "HEXAMETHYLDISILAZANE",
        "cas_no": "999-97-3",
        "cins_no": "",
        "molecular_formula": "C6H19NSi2",
        "discription": "Hexamethyldisilazane (HMDS) is a versatile organosilicon compound used as a silylating agent, a precursor to silylating bases (like LiHMDS, NaHMDS, KHMDS), and a surface treatment agent.",
        "typical_properties": "Colorless liquid with an ammonia-like odor. Boiling point: ~125-126°C. Moisture sensitive, reacts with water to form hexamethyldisiloxane and ammonia. Soluble in many organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a silylating agent to protect hydroxyl groups or to derivatize compounds for GC analysis. Crucially, it's a precursor to strong, non-nucleophilic bases (LiHMDS, NaHMDS, KHMDS) widely employed in deprotonation and C-C bond-forming reactions in pharmaceutical synthesis. Used as an adhesion promoter for photoresists in microfabrication relevant to medical devices.",
        "other_industries": "Silylating agent, surface modification (hydrophobization), adhesion promoter in photolithography, precursor to silicone polymers."
    },
    {
        "name": "HEXAMETHYLDISILOXANE",
        "cas_no": "107-46-0",
        "cins_no": "",
        "molecular_formula": "C6H18OSi2",
        "discription": "Hexamethyldisiloxane (HMDSO) is the simplest member of the silicone fluid family. It is a volatile, low-viscosity liquid with excellent dielectric properties and low surface tension. Less reactive as a silylating agent than HMDS or chlorosilanes.",
        "typical_properties": "Colorless, odorless liquid. Boiling point: ~99-101°C. Insoluble in water, soluble in many organic solvents. Chemically inert under many conditions.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a solvent or dispersing medium in some pharmaceutical formulations, especially topical preparations or aerosols due to its volatility and skin feel. Can act as an end-capping agent in the synthesis of specialized silicone polymers used in medical devices or drug delivery. Sometimes used for silylation under specific conditions.",
        "other_industries": "Solvent, standard for 1H NMR, component in silicone oils and elastomers, cleaning agent in semiconductor industry, defoamer, hydraulic fluid."
    },
    {
        "name": "1,1,3,3-TETRAMETHYLDISILOXANE",
        "cas_no": "3277-26-7",
        "cins_no": "",
        "molecular_formula": "C4H14OSi2",
        "discription": "1,1,3,3-Tetramethyldisiloxane (TMDS) is a disiloxane containing Si-H bonds, making it useful as a mild reducing agent (hydrosilylation) and a reactive intermediate for silicone chemistry.",
        "typical_properties": "Colorless liquid. Boiling point: ~70-71°C. Reactive Si-H bonds. Moisture sensitive, especially in the presence of catalysts. Soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a reducing agent in hydrosilylation reactions to reduce carbonyl compounds or for C-C bond formation, often catalyzed by transition metals. It can also serve as a precursor for various silylating agents or silicone-based materials used in pharmaceutical applications.",
        "other_industries": "Reducing agent, crosslinking agent for silicone elastomers, precursor for silicone polymers and other organosilicon compounds."
    },
    {
        "name": "CHLOROTRIMETHYLSILANE",
        "cas_no": "75-77-4",
        "cins_no": "",
        "molecular_formula": "C3H9ClSi",
        "discription": "Chlorotrimethylsilane (TMSCl) is a highly versatile and common organosilicon compound used as a silylating agent to introduce the trimethylsilyl (TMS) protecting group, and as an activating agent or Lewis acid catalyst.",
        "typical_properties": "Colorless, volatile, fuming liquid with a pungent odor. Boiling point: ~57-58°C. Highly flammable. Reacts vigorously with water and protic solvents to form HCl and hexamethyldisiloxane. Soluble in aprotic organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Extensively used to protect alcohols, amines, thiols, and carboxylic acids as TMS derivatives, which are easily formed and cleaved. Used as a reagent to generate trimethylsilyl enol ethers from ketones/aldehydes, important intermediates in C-C bond formation. Employed for derivatization for GC/GC-MS analysis. Activates certain reactions by scavenging byproducts or acting as a Lewis acid.",
        "other_industries": "Silylating agent, surface treatment agent (hydrophobization), intermediate for silicone fluids and resins, analytical derivatization reagent."
    },
    {
        "name": "Sodium Nitroprusside",
        "cas_no": "13755-38-9",
        "cins_no": "",
        "molecular_formula": "C5FeN6Na2O",
        "discription": "A potent vasodilator, administered intravenously, primarily used to treat hypertensive emergencies and severe heart failure.",
        "typical_properties": "Reddish-brown crystals or powder, soluble in water, sensitive to light. Decomposes in solution.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of acute hypertension (hypertensive crisis), controlled hypotension during anesthesia, and acute congestive heart failure.",
        "other_industries": "Analytical reagent (for detection of ketones, aldehydes, and sulfur compounds)."
    },
    {
        "name": "Regadenoson API",
        "cas_no": "313348-27-5",
        "cins_no": "",
        "molecular_formula": "C15H18N8O2",
        "discription": "A selective A2A adenosine receptor agonist used as a pharmacologic stress agent for myocardial perfusion imaging.",
        "typical_properties": "White to off-white crystalline powder. Soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a pharmacologic stress agent in radionuclide myocardial perfusion imaging (MPI) in patients unable to undergo adequate exercise stress.",
        "other_industries": ""
    },
    {
        "name": "Indocyaninegreen API",
        "cas_no": "3599-32-4",
        "cins_no": "",
        "molecular_formula": "C43H47N2NaO6S2",
        "discription": "A tricarbocyanine dye used as a diagnostic agent for determining cardiac output, liver function, and ophthalmic angiography.",
        "typical_properties": "Dark green, blue, or black powder. Soluble in water and methanol.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Indicator dye for determining cardiac output, hepatic function, liver blood flow, and for ophthalmic angiography.",
        "other_industries": ""
    },
    {
        "name": "Brivaracetam API",
        "cas_no": "357336-20-0",
        "cins_no": "",
        "molecular_formula": "C11H20N2O2",
        "discription": "An anticonvulsant medication used for the treatment of partial-onset seizures.",
        "typical_properties": "White to off-white crystalline powder. Soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of partial-onset seizures in patients with epilepsy.",
        "other_industries": ""
    },
    {
        "name": "Amifostine API",
        "cas_no": "112901-68-5",
        "cins_no": "",
        "molecular_formula": "C5H15N2O3PS (for Amifostine free base, CAS 20537-88-6; the given CAS is often for trihydrate)",
        "discription": "A cytoprotective adjuvant used in cancer chemotherapy and radiotherapy to reduce certain side effects.",
        "typical_properties": "White crystalline powder. Soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used to reduce nephrotoxicity associated with cisplatin in advanced ovarian cancer or non-small cell lung cancer, and to reduce xerostomia in patients undergoing postoperative radiation treatment for head and neck cancer.",
        "other_industries": ""
    },
    {
        "name": "Nicardipine Hydrochloride API",
        "cas_no": "54527-84-3",
        "cins_no": "",
        "molecular_formula": "C26H30ClN3O6",
        "discription": "A calcium channel blocker of the dihydropyridine class, used to treat high blood pressure and angina.",
        "typical_properties": "Light yellow crystalline powder. Slightly soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of hypertension and chronic stable angina. Intravenous form used for short-term treatment of hypertension when oral therapy is not feasible.",
        "other_industries": ""
    },
    {
        "name": "Iopromide API",
        "cas_no": "73334-07-3",
        "cins_no": "",
        "molecular_formula": "C18H24I3N3O8",
        "discription": "A non-ionic, low-osmolar iodinated contrast agent used in radiographic procedures.",
        "typical_properties": "White to off-white powder. Soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a contrast medium for various X-ray examinations, including angiography, urography, and computed tomography (CT).",
        "other_industries": ""
    },
    {
        "name": "Gadoteric Acid Meglumine Salt API",
        "cas_no": "92943-93-6",
        "cins_no": "",
        "molecular_formula": "C16H28GdN5O8·C7H17NO5 (Gadoteric acid + Meglumine)",
        "discription": "A gadolinium-based contrast agent (GBCA) used in magnetic resonance imaging (MRI).",
        "typical_properties": "White or almost white powder. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a contrast agent for cranial and spinal magnetic resonance imaging (MRI) and for general MRI of the body.",
        "other_industries": ""
    },
    {
        "name": "Mivacurium Chloride API",
        "cas_no": "106861-44-3",
        "cins_no": "",
        "molecular_formula": "C58H80Cl2N2O14",
        "discription": "A short-acting, non-depolarizing neuromuscular blocking agent used to induce muscle relaxation during surgery.",
        "typical_properties": "White to off-white powder.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an adjunct to general anesthesia to facilitate endotracheal intubation and to provide skeletal muscle relaxation during surgery or mechanical ventilation.",
        "other_industries": ""
    },
    {
        "name": "Isavuconazonium Sulfate API",
        "cas_no": "946075-13-4",
        "cins_no": "",
        "molecular_formula": "C35H35F2N8O5S·HSO4 (Sulfate salt of Isavuconazonium prodrug)",
        "discription": "An azole antifungal prodrug, converted in the body to isavuconazole, used to treat invasive aspergillosis and mucormycosis.",
        "typical_properties": "White to yellowish-white powder.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of invasive aspergillosis and invasive mucormycosis in adults.",
        "other_industries": ""
    },
    {
        "name": "Gadoxetic Acid Disodium API",
        "cas_no": "135326-22-6",
        "cins_no": "",
        "molecular_formula": "C23H28GdN3Na2O11",
        "discription": "A liver-specific gadolinium-based contrast agent used for magnetic resonance imaging (MRI) of the liver.",
        "typical_properties": "White to off-white powder. Soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a contrast agent for detection and characterization of focal liver lesions in T1-weighted magnetic resonance imaging.",
        "other_industries": ""
    },
    {
        "name": "Gadodiamide API",
        "cas_no": "131410-48-5",
        "cins_no": "",
        "molecular_formula": "C16H26GdN5O8",
        "discription": "A non-ionic gadolinium-based contrast agent used in magnetic resonance imaging (MRI). Associated with a higher risk of nephrogenic systemic fibrosis (NSF) in certain patient populations.",
        "typical_properties": "White or almost white powder. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a contrast agent for magnetic resonance imaging (MRI) of the central nervous system and other body regions. Its use has become limited due to NSF risk.",
        "other_industries": ""
    },
    {
        "name": "Doxercalciferol API",
        "cas_no": "54573-75-0",
        "cins_no": "",
        "molecular_formula": "C28H44O2",
        "discription": "A synthetic vitamin D analog (1α-hydroxyvitamin D2) used to treat secondary hyperparathyroidism in patients with chronic kidney disease.",
        "typical_properties": "White or almost white crystalline powder. Practically insoluble in water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Management of secondary hyperparathyroidism in patients with chronic kidney disease on dialysis or pre-dialysis.",
        "other_industries": ""
    },
    {
        "name": "Acetylcysteine API",
        "cas_no": "616-91-1",
        "cins_no": "",
        "molecular_formula": "C5H9NO3S",
        "discription": "A mucolytic agent and an antidote for acetaminophen (paracetamol) overdose.",
        "typical_properties": "White crystalline powder with a slight acetic odor. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as a mucolytic agent to break down mucus in respiratory conditions (e.g., bronchitis, cystic fibrosis) and as an antidote for acetaminophen poisoning.",
        "other_industries": ""
    },
    {
        "name": "Salbutamol Sulfate API",
        "cas_no": "51022-70-9",
        "cins_no": "",
        "molecular_formula": "(C13H21NO3)2·H2SO4",
        "discription": "A short-acting β2-adrenergic receptor agonist used for the relief of bronchospasm in conditions such as asthma and chronic obstructive pulmonary disease (COPD). Also known as Albuterol Sulfate.",
        "typical_properties": "White or almost white crystalline powder. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment or prevention of bronchospasm in patients with reversible obstructive airway disease (e.g., asthma, COPD).",
        "other_industries": ""
    },
    {
        "name": "Ivabradine Hydrochloride API",
        "cas_no": "148849-67-6",
        "cins_no": "",
        "molecular_formula": "C27H37ClN2O5",
        "discription": "A heart rate lowering agent acting by selectively inhibiting the If current in the sinoatrial node, used for symptomatic treatment of chronic stable angina and chronic heart failure.",
        "typical_properties": "White to off-white crystalline powder.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of chronic stable angina pectoris in patients with normal sinus rhythm who have a contraindication or intolerance to beta-blockers; treatment of chronic heart failure.",
        "other_industries": ""
    },
    {
        "name": "Vardenafil Hydrochloride API",
        "cas_no": "224785-91-5",
        "cins_no": "",
        "molecular_formula": "C23H33ClN6O4S",
        "discription": "A PDE5 inhibitor used for the treatment of erectile dysfunction.",
        "typical_properties": "White to off-white crystalline powder.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of erectile dysfunction.",
        "other_industries": ""
    },
    {
        "name": "Metoclopramide Hydrochloride API",
        "cas_no": "224785-91-5",
        "cins_no": "",
        "molecular_formula": "C14H23Cl2N3O2 (for monohydrate, CAS: 7232-21-5. Base is C14H22ClN3O2)",
        "discription": "An antiemetic and prokinetic agent used to treat nausea, vomiting, gastroparesis, and to facilitate small bowel intubation. (CAS discrepancy noted; image shows this CAS).",
        "typical_properties": "White or almost white, crystalline powder. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of nausea and vomiting associated with various conditions (e.g., chemotherapy, post-operative); symptomatic treatment of diabetic gastroparesis; gastroesophageal reflux.",
        "other_industries": ""
    },
    {
        "name": "Leukoguanine API",
        "cas_no": "54143-57-6",
        "cins_no": "",
        "molecular_formula": "C5H5N5O (This is the CAS for Guanine, Leukoguanine may refer to this or a derivative not easily found)",
        "discription": "This CAS (54143-57-6) is for Guanine, a fundamental component of nucleic acids (DNA and RNA). 'Leukoguanine' might refer to Guanine or a specific derivative/application not commonly indexed. (Guanine is not typically directly used as an 'API' in the common sense, but rather its derivatives are). This could also be the CAS for Metoclopramide Hydrochloride (anhydrous).",
        "typical_properties": "White amorphous powder or crystals (Guanine). Insoluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Guanine itself is a building block for antiviral drugs (e.g., acyclovir, ganciclovir). If referring to Metoclopramide HCl Anhydrous: antiemetic, prokinetic.",
        "other_industries": "Research chemical, biochemical studies."
    },
    {
        "name": "Naproxen API",
        "cas_no": "22204-53-1",
        "cins_no": "",
        "molecular_formula": "C14H14O3",
        "discription": "A nonsteroidal anti-inflammatory drug (NSAID) used to relieve pain, fever, inflammation, and stiffness.",
        "typical_properties": "White to off-white crystalline powder. Practically insoluble in water, soluble in organic solvents.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Relief of pain, tenderness, swelling, and stiffness caused by osteoarthritis, rheumatoid arthritis, juvenile arthritis, ankylosing spondylitis, tendinitis, bursitis, and gout.",
        "other_industries": ""
    },
    {
        "name": "Loxoprofen sodium API",
        "cas_no": "80382-23-6",
        "cins_no": "",
        "molecular_formula": "C15H17NaO3 (typically dihydrate, formula is C15H17NaO3·2H2O)",
        "discription": "A nonsteroidal anti-inflammatory drug (NSAID) of the propionic acid derivative class, used for pain relief, fever reduction, and anti-inflammatory effects.",
        "typical_properties": "White to yellowish-white crystals or crystalline powder. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of pain and inflammation in conditions such as rheumatoid arthritis, osteoarthritis, lower back pain, and for post-operative or post-traumatic pain relief.",
        "other_industries": ""
    },
    {
        "name": "Deferasirox Dispersible API",
        "cas_no": "201530-41-8",
        "cins_no": "",
        "molecular_formula": "C21H15N3O4",
        "discription": "An oral iron chelator used to treat chronic iron overload, particularly in patients receiving long-term blood transfusions. The dispersible form is designed for suspension.",
        "typical_properties": "White to slightly yellow powder. 'Dispersible' indicates formulation for easy suspension in liquid.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of chronic iron overload due to blood transfusions (transfusional hemosiderosis) in adults and pediatric patients.",
        "other_industries": ""
    },
    {
        "name": "Phloroglucinol API",
        "cas_no": "108-73-6",
        "cins_no": "",
        "molecular_formula": "C6H6O3",
        "discription": "An organic compound used as an antispasmodic agent and in chemical synthesis.",
        "typical_properties": "White or yellowish crystalline powder or flakes. Sparingly soluble in water, soluble in ethanol.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Used as an antispasmodic for the treatment of gastrointestinal, biliary, and urinary tract spasms.",
        "other_industries": "Coupling agent in printing (diazo printing); chemical intermediate; reagent for detecting aldehydes and lignin."
    },
    {
        "name": "Epinephrine API",
        "cas_no": "51-43-4",
        "cins_no": "",
        "molecular_formula": "C9H13NO3",
        "discription": "A hormone and neurotransmitter, also known as adrenaline. Used as a medication to treat severe allergic reactions (anaphylaxis), cardiac arrest, and superficial bleeding.",
        "typical_properties": "White to nearly white, microcrystalline powder or granules. Darkens on exposure to air and light. Sparingly soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of anaphylaxis, cardiac arrest (asystole and pulseless electrical activity), superficial bleeding, and to delay absorption of local anesthetics.",
        "other_industries": ""
    },
    {
        "name": "Isoproterenol Hydrochloride API",
        "cas_no": "949-36-0",
        "cins_no": "",
        "molecular_formula": "C11H18ClNO3",
        "discription": "A non-selective β-adrenergic agonist used to treat bradycardia (slow heart rate), heart block, and rarely for asthma.",
        "typical_properties": "White to practically white, crystalline powder. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of bradycardia, heart block, and as a bronchodilator in asthma (use for asthma is now less common).",
        "other_industries": ""
    },
    {
        "name": "Phenylephrine Hydrochloride API",
        "cas_no": "61-76-7",
        "cins_no": "",
        "molecular_formula": "C9H14ClNO2",
        "discription": "A selective α1-adrenergic receptor agonist used primarily as a decongestant, to increase blood pressure, and as a mydriatic (to dilate pupils).",
        "typical_properties": "White or practically white, crystalline powder. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Nasal decongestant (oral and topical), vasopressor to treat hypotension (e.g., during anesthesia), mydriatic for eye examinations.",
        "other_industries": ""
    },
    {
        "name": "Vitamin K1 API",
        "cas_no": "84-80-0",
        "cins_no": "",
        "molecular_formula": "C31H46O2",
        "discription": "Also known as phylloquinone or phytomenadione, a fat-soluble vitamin essential for blood clotting and bone health.",
        "typical_properties": "Clear, yellow to amber, viscous, odorless or nearly odorless oil. Insoluble in water, soluble in organic solvents. Sensitive to light.",
        "packing": "No information available",
        "food_idustry": "Used as a nutritional supplement, food fortification.",
        "pharmaceutical_industry": "Prevention and treatment of vitamin K deficiency bleeding in newborns and adults; antidote for anticoagulant overdose (e.g., warfarin).",
        "other_industries": ""
    },
    {
        "name": "Famotidine API",
        "cas_no": "76824-35-6",
        "cins_no": "",
        "molecular_formula": "C8H15N7O2S3",
        "discription": "A histamine H2 receptor antagonist that inhibits stomach acid production, used to treat peptic ulcers, gastroesophageal reflux disease (GERD), and Zollinger-Ellison syndrome.",
        "typical_properties": "White to pale yellow crystalline powder. Sparingly soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of gastric and duodenal ulcers, GERD, heartburn, and conditions involving excessive stomach acid production like Zollinger-Ellison syndrome.",
        "other_industries": ""
    },
    {
        "name": "Levosimendan API",
        "cas_no": "141505-33-1",
        "cins_no": "",
        "molecular_formula": "C14H12N6O",
        "discription": "A calcium sensitizer and potassium channel opener used in the short-term management of acutely decompensated severe chronic heart failure.",
        "typical_properties": "Yellow to orange crystalline powder.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Short-term treatment of acutely decompensated severe chronic heart failure in situations where conventional therapy is not sufficient.",
        "other_industries": ""
    },
    {
        "name": "Landiolol Hydrochloride API",
        "cas_no": "144481-98-1",
        "cins_no": "",
        "molecular_formula": "C25H40ClN3O5S",
        "discription": "An ultra-short-acting, highly cardioselective beta-1 adrenergic receptor blocker used for rapid control of ventricular rate in atrial fibrillation or atrial flutter during surgery.",
        "typical_properties": "White crystalline powder.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of tachyarrhythmias (atrial fibrillation, atrial flutter, sinus tachycardia) especially in perioperative and postoperative settings.",
        "other_industries": ""
    },
    {
        "name": "Norepinephrine Bitartrate",
        "cas_no": "51-40-1",
        "cins_no": "",
        "molecular_formula": "C8H11NO3·C4H6O6·H2O (for monohydrate, the common form with CAS 69815-49-2. CAS 51-40-1 is for Norepinephrine itself)",
        "discription": "A potent vasopressor, similar to epinephrine, used to treat life-threatening low blood pressure (hypotension) that can occur with certain medical conditions or surgical procedures.",
        "typical_properties": "White or faintly grayish crystalline powder. Darkens on exposure to light and air. Freely soluble in water.",
        "packing": "No information available",
        "food_idustry": "",
        "pharmaceutical_industry": "Treatment of acute hypotensive states (e.g., septic shock, myocardial infarction, cardiac arrest) to raise blood pressure.",
        "other_industries": ""
    },
    {
        "name": "Sodium Hyaluronate",
        "cas_no": "9067-32-7",
        "cins_no": "",
        "molecular_formula": "(C14H20NNaO11)n (Polymer)",
        "discription": "The sodium salt of hyaluronic acid, a glycosaminoglycan found throughout connective, epithelial, and neural tissues. Used for its viscoelastic and moisturizing properties.",
        "typical_properties": "White to off-white powder or granules. Soluble in water forming a viscous solution.",
        "packing": "No information available",
        "food_idustry": "Used as a dietary supplement for joint health; some food applications as a functional ingredient (less common).",
        "pharmaceutical_industry": "Ophthalmic surgery (viscoelastic agent), treatment of osteoarthritis (intra-articular injections), topical preparations for wound healing and skin hydration, eye drops for dry eyes.",
        "other_industries": "Cosmetics (moisturizer, anti-aging products)."
    },
    {
        "name": "Castor oil",
        "cas_no": "8001-79-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A vegetable oil obtained by pressing the seeds of the castor oil plant (Ricinus communis). It is known for its high content of ricinoleic acid.",
        "typical_properties": "Pale yellow or almost colorless, transparent, viscous liquid. Slight characteristic odor. Insoluble in water, miscible with alcohol.",
        "packing": "No information available",
        "food_idustry": "Used as a food additive (E1503 - release agent, glazing agent), in flavorings, and in some candy manufacturing.",
        "pharmaceutical_industry": "Stimulant laxative; pharmaceutical excipient (emulsifier, solvent); component in some topical medications.",
        "other_industries": "Production of lubricants, hydraulic and brake fluids, paints, dyes, coatings, inks, cold resistant plastics, waxes and polishes, nylon, perfumes, soaps."
    }
]