[
  {
    "name": "Sodium Nitroprusside",
    "cas_no": "13755-38-9",
    "cins_no": "",
    "molecular_formula": "C5FeN6Na2O",
    "discription": "A potent vasodilator, administered intravenously, primarily used to treat hypertensive emergencies and severe heart failure.",
    "typical_properties": "Reddish-brown crystals or powder, soluble in water, sensitive to light. Decomposes in solution.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of acute hypertension (hypertensive crisis), controlled hypotension during anesthesia, and acute congestive heart failure.",
    "other_industries": "Analytical reagent (for detection of ketones, aldehydes, and sulfur compounds)."
  },
  {
    "name": "Regadenoson API",
    "cas_no": "313348-27-5",
    "cins_no": "",
    "molecular_formula": "C15H18N8O2",
    "discription": "A selective A2A adenosine receptor agonist used as a pharmacologic stress agent for myocardial perfusion imaging.",
    "typical_properties": "White to off-white crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a pharmacologic stress agent in radionuclide myocardial perfusion imaging (MPI) in patients unable to undergo adequate exercise stress.",
    "other_industries": ""
  },
  {
    "name": "Indocyaninegreen API",
    "cas_no": "3599-32-4",
    "cins_no": "",
    "molecular_formula": "C43H47N2NaO6S2",
    "discription": "A tricarbocyanine dye used as a diagnostic agent for determining cardiac output, liver function, and ophthalmic angiography.",
    "typical_properties": "Dark green, blue, or black powder. Soluble in water and methanol.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Indicator dye for determining cardiac output, hepatic function, liver blood flow, and for ophthalmic angiography.",
    "other_industries": ""
  },
  {
    "name": "Brivaracetam API",
    "cas_no": "357336-20-0",
    "cins_no": "",
    "molecular_formula": "C11H20N2O2",
    "discription": "An anticonvulsant medication used for the treatment of partial-onset seizures.",
    "typical_properties": "White to off-white crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of partial-onset seizures in patients with epilepsy.",
    "other_industries": ""
  },
  {
    "name": "Amifostine API",
    "cas_no": "112901-68-5",
    "cins_no": "",
    "molecular_formula": "C5H15N2O3PS (for Amifostine free base, CAS 20537-88-6; the given CAS is often for trihydrate)",
    "discription": "A cytoprotective adjuvant used in cancer chemotherapy and radiotherapy to reduce certain side effects.",
    "typical_properties": "White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used to reduce nephrotoxicity associated with cisplatin in advanced ovarian cancer or non-small cell lung cancer, and to reduce xerostomia in patients undergoing postoperative radiation treatment for head and neck cancer.",
    "other_industries": ""
  },
  {
    "name": "Nicardipine Hydrochloride API",
    "cas_no": "54527-84-3",
    "cins_no": "",
    "molecular_formula": "C26H30ClN3O6",
    "discription": "A calcium channel blocker of the dihydropyridine class, used to treat high blood pressure and angina.",
    "typical_properties": "Light yellow crystalline powder. Slightly soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of hypertension and chronic stable angina. Intravenous form used for short-term treatment of hypertension when oral therapy is not feasible.",
    "other_industries": ""
  },
  {
    "name": "Iopromide API",
    "cas_no": "73334-07-3",
    "cins_no": "",
    "molecular_formula": "C18H24I3N3O8",
    "discription": "A non-ionic, low-osmolar iodinated contrast agent used in radiographic procedures.",
    "typical_properties": "White to off-white powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a contrast medium for various X-ray examinations, including angiography, urography, and computed tomography (CT).",
    "other_industries": ""
  },
  {
    "name": "Gadoteric Acid Meglumine Salt API",
    "cas_no": "92943-93-6",
    "cins_no": "",
    "molecular_formula": "C16H28GdN5O8·C7H17NO5 (Gadoteric acid + Meglumine)",
    "discription": "A gadolinium-based contrast agent (GBCA) used in magnetic resonance imaging (MRI).",
    "typical_properties": "White or almost white powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a contrast agent for cranial and spinal magnetic resonance imaging (MRI) and for general MRI of the body.",
    "other_industries": ""
  },
  {
    "name": "Mivacurium Chloride API",
    "cas_no": "106861-44-3",
    "cins_no": "",
    "molecular_formula": "C58H80Cl2N2O14",
    "discription": "A short-acting, non-depolarizing neuromuscular blocking agent used to induce muscle relaxation during surgery.",
    "typical_properties": "White to off-white powder.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as an adjunct to general anesthesia to facilitate endotracheal intubation and to provide skeletal muscle relaxation during surgery or mechanical ventilation.",
    "other_industries": ""
  },
  {
    "name": "Isavuconazonium Sulfate API",
    "cas_no": "946075-13-4",
    "cins_no": "",
    "molecular_formula": "C35H35F2N8O5S·HSO4 (Sulfate salt of Isavuconazonium prodrug)",
    "discription": "An azole antifungal prodrug, converted in the body to isavuconazole, used to treat invasive aspergillosis and mucormycosis.",
    "typical_properties": "White to yellowish-white powder.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of invasive aspergillosis and invasive mucormycosis in adults.",
    "other_industries": ""
  },
  {
    "name": "Gadoxetic Acid Disodium API",
    "cas_no": "135326-22-6",
    "cins_no": "",
    "molecular_formula": "C23H28GdN3Na2O11",
    "discription": "A liver-specific gadolinium-based contrast agent used for magnetic resonance imaging (MRI) of the liver.",
    "typical_properties": "White to off-white powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a contrast agent for detection and characterization of focal liver lesions in T1-weighted magnetic resonance imaging.",
    "other_industries": ""
  },
  {
    "name": "Gadodiamide API",
    "cas_no": "131410-48-5",
    "cins_no": "",
    "molecular_formula": "C16H26GdN5O8",
    "discription": "A non-ionic gadolinium-based contrast agent used in magnetic resonance imaging (MRI). Associated with a higher risk of nephrogenic systemic fibrosis (NSF) in certain patient populations.",
    "typical_properties": "White or almost white powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a contrast agent for magnetic resonance imaging (MRI) of the central nervous system and other body regions. Its use has become limited due to NSF risk.",
    "other_industries": ""
  },
  {
    "name": "Doxercalciferol API",
    "cas_no": "54573-75-0",
    "cins_no": "",
    "molecular_formula": "C28H44O2",
    "discription": "A synthetic vitamin D analog (1α-hydroxyvitamin D2) used to treat secondary hyperparathyroidism in patients with chronic kidney disease.",
    "typical_properties": "White or almost white crystalline powder. Practically insoluble in water, soluble in organic solvents.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Management of secondary hyperparathyroidism in patients with chronic kidney disease on dialysis or pre-dialysis.",
    "other_industries": ""
  },
  {
    "name": "Acetylcysteine API",
    "cas_no": "616-91-1",
    "cins_no": "",
    "molecular_formula": "C5H9NO3S",
    "discription": "A mucolytic agent and an antidote for acetaminophen (paracetamol) overdose.",
    "typical_properties": "White crystalline powder with a slight acetic odor. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as a mucolytic agent to break down mucus in respiratory conditions (e.g., bronchitis, cystic fibrosis) and as an antidote for acetaminophen poisoning.",
    "other_industries": ""
  },
  {
    "name": "Salbutamol Sulfate API",
    "cas_no": "51022-70-9",
    "cins_no": "",
    "molecular_formula": "(C13H21NO3)2·H2SO4",
    "discription": "A short-acting β2-adrenergic receptor agonist used for the relief of bronchospasm in conditions such as asthma and chronic obstructive pulmonary disease (COPD). Also known as Albuterol Sulfate.",
    "typical_properties": "White or almost white crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment or prevention of bronchospasm in patients with reversible obstructive airway disease (e.g., asthma, COPD).",
    "other_industries": ""
  },
  {
    "name": "Ivabradine Hydrochloride API",
    "cas_no": "148849-67-6",
    "cins_no": "",
    "molecular_formula": "C27H37ClN2O5",
    "discription": "A heart rate lowering agent acting by selectively inhibiting the If current in the sinoatrial node, used for symptomatic treatment of chronic stable angina and chronic heart failure.",
    "typical_properties": "White to off-white crystalline powder.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of chronic stable angina pectoris in patients with normal sinus rhythm who have a contraindication or intolerance to beta-blockers; treatment of chronic heart failure.",
    "other_industries": ""
  },
  {
    "name": "Vardenafil Hydrochloride API",
    "cas_no": "224785-91-5",
    "cins_no": "",
    "molecular_formula": "C23H33ClN6O4S",
    "discription": "A PDE5 inhibitor used for the treatment of erectile dysfunction.",
    "typical_properties": "White to off-white crystalline powder.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of erectile dysfunction.",
    "other_industries": ""
  },
  {
    "name": "Metoclopramide Hydrochloride API",
    "cas_no": "224785-91-5",
    "cins_no": "",
    "molecular_formula": "C14H23Cl2N3O2 (for monohydrate, CAS: 7232-21-5. Base is C14H22ClN3O2)",
    "discription": "An antiemetic and prokinetic agent used to treat nausea, vomiting, gastroparesis, and to facilitate small bowel intubation. (CAS discrepancy noted; image shows this CAS).",
    "typical_properties": "White or almost white, crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of nausea and vomiting associated with various conditions (e.g., chemotherapy, post-operative); symptomatic treatment of diabetic gastroparesis; gastroesophageal reflux.",
    "other_industries": ""
  },
  {
    "name": "Leukoguanine API",
    "cas_no": "54143-57-6",
    "cins_no": "",
    "molecular_formula": "C5H5N5O (This is the CAS for Guanine, Leukoguanine may refer to this or a derivative not easily found)",
    "discription": "This CAS (54143-57-6) is for Guanine, a fundamental component of nucleic acids (DNA and RNA). 'Leukoguanine' might refer to Guanine or a specific derivative/application not commonly indexed. (Guanine is not typically directly used as an 'API' in the common sense, but rather its derivatives are). This could also be the CAS for Metoclopramide Hydrochloride (anhydrous).",
    "typical_properties": "White amorphous powder or crystals (Guanine). Insoluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Guanine itself is a building block for antiviral drugs (e.g., acyclovir, ganciclovir). If referring to Metoclopramide HCl Anhydrous: antiemetic, prokinetic.",
    "other_industries": "Research chemical, biochemical studies."
  },
  {
    "name": "Naproxen API",
    "cas_no": "22204-53-1",
    "cins_no": "",
    "molecular_formula": "C14H14O3",
    "discription": "A nonsteroidal anti-inflammatory drug (NSAID) used to relieve pain, fever, inflammation, and stiffness.",
    "typical_properties": "White to off-white crystalline powder. Practically insoluble in water, soluble in organic solvents.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Relief of pain, tenderness, swelling, and stiffness caused by osteoarthritis, rheumatoid arthritis, juvenile arthritis, ankylosing spondylitis, tendinitis, bursitis, and gout.",
    "other_industries": ""
  },
  {
    "name": "Loxoprofen sodium API",
    "cas_no": "80382-23-6",
    "cins_no": "",
    "molecular_formula": "C15H17NaO3 (typically dihydrate, formula is C15H17NaO3·2H2O)",
    "discription": "A nonsteroidal anti-inflammatory drug (NSAID) of the propionic acid derivative class, used for pain relief, fever reduction, and anti-inflammatory effects.",
    "typical_properties": "White to yellowish-white crystals or crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of pain and inflammation in conditions such as rheumatoid arthritis, osteoarthritis, lower back pain, and for post-operative or post-traumatic pain relief.",
    "other_industries": ""
  },
  {
    "name": "Deferasirox Dispersible API",
    "cas_no": "201530-41-8",
    "cins_no": "",
    "molecular_formula": "C21H15N3O4",
    "discription": "An oral iron chelator used to treat chronic iron overload, particularly in patients receiving long-term blood transfusions. The dispersible form is designed for suspension.",
    "typical_properties": "White to slightly yellow powder. 'Dispersible' indicates formulation for easy suspension in liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of chronic iron overload due to blood transfusions (transfusional hemosiderosis) in adults and pediatric patients.",
    "other_industries": ""
  },
  {
    "name": "Phloroglucinol API",
    "cas_no": "108-73-6",
    "cins_no": "",
    "molecular_formula": "C6H6O3",
    "discription": "An organic compound used as an antispasmodic agent and in chemical synthesis.",
    "typical_properties": "White or yellowish crystalline powder or flakes. Sparingly soluble in water, soluble in ethanol.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Used as an antispasmodic for the treatment of gastrointestinal, biliary, and urinary tract spasms.",
    "other_industries": "Coupling agent in printing (diazo printing); chemical intermediate; reagent for detecting aldehydes and lignin."
  },
  {
    "name": "Epinephrine API",
    "cas_no": "51-43-4",
    "cins_no": "",
    "molecular_formula": "C9H13NO3",
    "discription": "A hormone and neurotransmitter, also known as adrenaline. Used as a medication to treat severe allergic reactions (anaphylaxis), cardiac arrest, and superficial bleeding.",
    "typical_properties": "White to nearly white, microcrystalline powder or granules. Darkens on exposure to air and light. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of anaphylaxis, cardiac arrest (asystole and pulseless electrical activity), superficial bleeding, and to delay absorption of local anesthetics.",
    "other_industries": ""
  },
  {
    "name": "Isoproterenol Hydrochloride API",
    "cas_no": "949-36-0",
    "cins_no": "",
    "molecular_formula": "C11H18ClNO3",
    "discription": "A non-selective β-adrenergic agonist used to treat bradycardia (slow heart rate), heart block, and rarely for asthma.",
    "typical_properties": "White to practically white, crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of bradycardia, heart block, and as a bronchodilator in asthma (use for asthma is now less common).",
    "other_industries": ""
  },
  {
    "name": "Phenylephrine Hydrochloride API",
    "cas_no": "61-76-7",
    "cins_no": "",
    "molecular_formula": "C9H14ClNO2",
    "discription": "A selective α1-adrenergic receptor agonist used primarily as a decongestant, to increase blood pressure, and as a mydriatic (to dilate pupils).",
    "typical_properties": "White or practically white, crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Nasal decongestant (oral and topical), vasopressor to treat hypotension (e.g., during anesthesia), mydriatic for eye examinations.",
    "other_industries": ""
  },
  {
    "name": "Vitamin K1 API",
    "cas_no": "84-80-0",
    "cins_no": "",
    "molecular_formula": "C31H46O2",
    "discription": "Also known as phylloquinone or phytomenadione, a fat-soluble vitamin essential for blood clotting and bone health.",
    "typical_properties": "Clear, yellow to amber, viscous, odorless or nearly odorless oil. Insoluble in water, soluble in organic solvents. Sensitive to light.",
    "packing": "No information available",
    "food_idustry": "Used as a nutritional supplement, food fortification.",
    "pharmaceutical_industry": "Prevention and treatment of vitamin K deficiency bleeding in newborns and adults; antidote for anticoagulant overdose (e.g., warfarin).",
    "other_industries": ""
  },
  {
    "name": "Famotidine API",
    "cas_no": "76824-35-6",
    "cins_no": "",
    "molecular_formula": "C8H15N7O2S3",
    "discription": "A histamine H2 receptor antagonist that inhibits stomach acid production, used to treat peptic ulcers, gastroesophageal reflux disease (GERD), and Zollinger-Ellison syndrome.",
    "typical_properties": "White to pale yellow crystalline powder. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of gastric and duodenal ulcers, GERD, heartburn, and conditions involving excessive stomach acid production like Zollinger-Ellison syndrome.",
    "other_industries": ""
  },
  {
    "name": "Levosimendan API",
    "cas_no": "141505-33-1",
    "cins_no": "",
    "molecular_formula": "C14H12N6O",
    "discription": "A calcium sensitizer and potassium channel opener used in the short-term management of acutely decompensated severe chronic heart failure.",
    "typical_properties": "Yellow to orange crystalline powder.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Short-term treatment of acutely decompensated severe chronic heart failure in situations where conventional therapy is not sufficient.",
    "other_industries": ""
  },
  {
    "name": "Landiolol Hydrochloride API",
    "cas_no": "144481-98-1",
    "cins_no": "",
    "molecular_formula": "C25H40ClN3O5S",
    "discription": "An ultra-short-acting, highly cardioselective beta-1 adrenergic receptor blocker used for rapid control of ventricular rate in atrial fibrillation or atrial flutter during surgery.",
    "typical_properties": "White crystalline powder.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of tachyarrhythmias (atrial fibrillation, atrial flutter, sinus tachycardia) especially in perioperative and postoperative settings.",
    "other_industries": ""
  },
  {
    "name": "Norepinephrine Bitartrate",
    "cas_no": "51-40-1",
    "cins_no": "",
    "molecular_formula": "C8H11NO3·C4H6O6·H2O (for monohydrate, the common form with CAS 69815-49-2. CAS 51-40-1 is for Norepinephrine itself)",
    "discription": "A potent vasopressor, similar to epinephrine, used to treat life-threatening low blood pressure (hypotension) that can occur with certain medical conditions or surgical procedures.",
    "typical_properties": "White or faintly grayish crystalline powder. Darkens on exposure to light and air. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "Treatment of acute hypotensive states (e.g., septic shock, myocardial infarction, cardiac arrest) to raise blood pressure.",
    "other_industries": ""
  },
  {
    "name": "Sodium Hyaluronate",
    "cas_no": "9067-32-7",
    "cins_no": "",
    "molecular_formula": "(C14H20NNaO11)n (Polymer)",
    "discription": "The sodium salt of hyaluronic acid, a glycosaminoglycan found throughout connective, epithelial, and neural tissues. Used for its viscoelastic and moisturizing properties.",
    "typical_properties": "White to off-white powder or granules. Soluble in water forming a viscous solution.",
    "packing": "No information available",
    "food_idustry": "Used as a dietary supplement for joint health; some food applications as a functional ingredient (less common).",
    "pharmaceutical_industry": "Ophthalmic surgery (viscoelastic agent), treatment of osteoarthritis (intra-articular injections), topical preparations for wound healing and skin hydration, eye drops for dry eyes.",
    "other_industries": "Cosmetics (moisturizer, anti-aging products)."
  },
  {
    "name": "Castor oil",
    "cas_no": "8001-79-4",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A vegetable oil obtained by pressing the seeds of the castor oil plant (Ricinus communis). It is known for its high content of ricinoleic acid.",
    "typical_properties": "Pale yellow or almost colorless, transparent, viscous liquid. Slight characteristic odor. Insoluble in water, miscible with alcohol.",
    "packing": "No information available",
    "food_idustry": "Used as a food additive (E1503 - release agent, glazing agent), in flavorings, and in some candy manufacturing.",
    "pharmaceutical_industry": "Stimulant laxative; pharmaceutical excipient (emulsifier, solvent); component in some topical medications.",
    "other_industries": "Production of lubricants, hydraulic and brake fluids, paints, dyes, coatings, inks, cold resistant plastics, waxes and polishes, nylon, perfumes, soaps."
  }
]