[
    {
        "name": "Rubber antioxidant\n6PPD(4020)",
        "cas_no": "793-24-8\n",
        "cins_no": "",
        "molecular_formula": "C18H24N2",
        "discription": "6PPD antioxidant (N-1, 3-dimethylbutyl-N’-phenyl-p-phenylenediamine) is an aromatic amine known as a potent antioxidant or an antiozonant for polymer elastomeric compounds. It is one of several additives used to protect various rubber products. These antioxidants are stronger than the antioxidants quinoline or diphenylamine.\n",
        "typical_properties": "Soluble in Gasoline, Benzene, Acetone and etc. It is insoluble in water. It will become black\non exposure to air, but there is no effect on its properties. Due to low melting point, it should be stored\naway from high temperature.\nAppearance        Dark purple to dark brown granules or flakes\nAssay(%)        96 min\nMelting point (℃)        45 min\nSolidifying Point(℃)        45 min\nLoss on drying (%)        0.40 max\nAsh(%)        0.15 max",
        "packing": "In 20kg, 25kg kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "An Antioxidant used for rubber products with high efficiency, low poison and low solvent-extraction amount. Also used as stabilizer in Synthetic Rubber. It is widely applied in many\nkinds of rubber products"
    },
    {
        "name": "Azodicarbonamide",
        "cas_no": "123-77-3",
        "cins_no": "204-650-8",
        "molecular_formula": "C2H4N4O2",
        "discription": "Azodicarbonamide(AC or ADCA) is the most popular chemical blowing agent.\nUnlike a number of other chemical blowing agent, AC is self- extinguishing when flame is removed. The decomposition residues are odorless. non-toxic, non-coloring and non-straining. The particle size and distribution can be controlled with widely different ranges.The particle size and distribution is one of the significant factors.",
        "typical_properties": "Orange to pale yellow, crystalline solid with a decomposition temperature in air of 201~205ºC.\nAppearance\nLight yellow powder\nContent\n97.0% min\nGas emitting, ml/g (20℃,101325pa)\n220 min\nDecomposing temperature（℃）\n200 min\nSize\n12um, 3/4um or 4/5 um or 5/6 um as buyer's option\nLoss on drying\n0.3% max\nAsh\n0.2% max",
        "packing": "It can be packed in polyethylene-film lined iron barrel, cardboard barrel, carton or woven bag or compound paper bag.\nSpecial packing is negotiable separately.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1.Chemical azodicarbonamide ADC blowing agent is a universal high temperature foaming agent and has good compatibility and dispersity.\n2.Azodicarbonamide is used in extensive range like PVC, PS, PP, PE. It widely used in plastics and rubber foam\n(PE, PS, EVA, PVC), it also used in NBR, SBR .\n3.Azodicarbonamide is especially suitable for molding foaming of PE; It often used in foaming of EVA (large\nmode hot pressing) and PVC molding; It can be used for foaming of molding or free-mode of rubber and plastic."
    },
    {
        "name": "Antioxidant 168",
        "cas_no": "",
        "cins_no": "250-709-6",
        "molecular_formula": "C42H63O3P",
        "discription": "Antioxidant 168 is an excellent phosphite antioxidant. It has strong anti-extraction properties, stable hydrolysis, and can significantly improve the photostability of products. It can be used in combination with various phenolic antioxidants.\n",
        "typical_properties": "Melting point, 181-184 °C(lit.) Boiling point, 594Appearance\nWhite crystallize powder\nAssay\n≥99.0%\nMelting range °C\n183-187℃\nVolatility\n≤0.3%\nAsh\n≤0.1%\nDissolvability\nClear\nTransmittance\n425nm   ≥98.0%\n500nm   ≥98.0%.2±50.0 °C(Predicted). Density, -0.98. Flash point, 46°C (115°F). storage temp. 2-8°C.\n",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Antioxidant 168 is sterically hindered phenolic antioxidant, exhibiting its highly effective, non discoloring and low volatility character for organic substrates. As a stabilizer, it is recommended and protects organic substrates against thermo-oxidative degradation. it’s widely used for additives of Rubber or plastics.\n"
    },
    {
        "name": "Pentaerythritol Tetrakis (3-(3,5-di- tert-butyl-4-hydroxyphenyl) Propionate)\nAntioxidant 1010\nIrganox1010",
        "cas_no": "6683-19-8\n",
        "cins_no": "",
        "molecular_formula": "C73H108O12",
        "discription": "This product is white powder, odorless.Melting point 110 ℃ to 125 ℃, the nature is stable.Soluble in benzene, acetone and ester solvent, insoluble in water, slightly soluble in alcohol.This product no pollution, heat resistance and good compatibility, good resistance to water extraction.With antioxidant 168, DLTDP etc and can play a synergistic effect, improve the effect of antioxidant.\n",
        "typical_properties": "Appearance\nWhite crystallize powder\nAssay\n≥98.0%\nWelting range °C\n110.0-125.0\nVolatility\n≤0.5%\nAsh\n≤0.1\nDissolvability\nClear\nLight permeation\n425nm   ≥96.0%\n500nm   ≥98.0%\n",
        "packing": "25kg/carton or as required.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "This product is a typical representative of hindered phenolic antioxidants, with no efficiency, no color, no pollution and other excellent performance, is internationally recognized as a high-quality antioxidants.In PP, PE, polyester, polyurethane, PS, POM, PBT, ABS, PA, synthetic rubber, such as polymer materials is widely used.This product is synthesis of natural and synthetic oils high antioxidant.\nName:\nAntioxidant 1010\nPacking:\n25kg/carton\n20’fcl:\n10 tons\nCertificate\n"
    },
    {
        "name": "  Octadecyl-β-( 3, 5-di-tert-butyl-4-hydroxyphenyl)-propionate (Antioxidant 1076)\n",
        "cas_no": " 2082-79-3",
        "cins_no": "218-216-0",
        "molecular_formula": "C35H62O3",
        "discription": "Antioxidant 1076 is a hindered phenolic antioxidant commonly used as a stabilizer in various materials. Its structure combines an octadecyl chain, a phenolic group with tert-butyl substituents, and a propionate ester group. The propionate ester group in Antioxidant 1076 enhances its solubility in polymers and other organic materials, making it easier to incorporate during processing and improving its distribution within the material. Antioxidant 1076 is odorless and tasteless. It is stable against light and can be used in polymer materials such as polyethylene, polystyrene, polyamide, ABS, synthetic rubber, etc.\n",
        "typical_properties": "Antioxidant 1076 is odorless, tasteless and less toxicity and stable to light so that it can widely used in polymer materials, such as polypropylene polyethylene, polystyrene, polyamide, polyoxymethylene, ABS, synthetic rubber and so on.\nAppearance\nWhite powder\nDissolvability\nClear\nMelting point\n50-55℃\nAsh content\n≤0.1%\nVolatiles\n≤0.2%\nMain content\n≥ 98%\nDiaphaneity,%   (10g/100mLToluene)\n425nm   ≥97.0%",
        "packing": "In 25kg bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is a kind of multivariate hindered phenolic antioxidant, has the very good compatibility with most polymers.Good to prevent discoloration effect caused by light and heat.Widely used in PE, PP, PS, POM, PA, ABS , PVC, synthetic rubber etc, are also used to prevent oil and coating hot oxygen aging.\n"
    },
    {
        "name": "Calcium bis[monoethyl(3,5-di-tert-butyl-4-hydroxylbenzyl)phosphonate] (Antioxidant 1425)",
        "cas_no": " 65140-91-2",
        "cins_no": "250-709-6",
        "molecular_formula": "C17H28CaO4P",
        "discription": "Antioxidant 1425 is a kind of multifunctional high efficiacy phosphorus contained hindered phenols antioxidant with high M.W..it can be used in rosin and rosin ester resin,polypropylene,lanon,ABS resin,polyamide resin,polyolefine and its polymerized matters etc.it is with high efficiacy and has great synergistic with other secondary antioxidant such as 168 and lubricant agent Tissuemat E.\n",
        "typical_properties": "White, free flowing powder, odorless, stable   to light   and   has excellent   color   retention.   It has good compatibility with   most   substrates   and   high resistance to extraction.\nMelting   Range(°C)\n260 min\nFlashpoint(°C)\n150 min\nSpecific Gravity (20°C,g/cm3)\n1.21\nVapor Pressure (20°C,Pa)\n0.01 max\nSolubility (20°C)\n% w/w\nWater\n0.01 max\nAcetone\n0.02\nChloroform\n0.01\nEthanol\n0.1 max\nEthyl acetate\n0.03\nn-Hexane\n0.02\nMethanol\n8\nMethylene chloride\n0.01\nToluene\n～0.5",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Antioxidant 1425   imparts   processing   and   good   long-term stability   to   polyolefins.   It   is particularly suitable   for   use   in   polypropylene fibers.   It   is also   an   effective stabilizer   for polyesters, crosslinked   elastomers (e.g.   NBR), specialty   adhesives, natural and synthetic   tackifier   resins.   It   is   used   as   esterification   catalyst    for   the preparation of rosin esters.\n"
    },
    {
        "name": "Benzotriazole",
        "cas_no": "95-14-7",
        "cins_no": "202-394-1",
        "molecular_formula": "C6H5N3\n",
        "discription": "Benzotriazole is a useful corrosion inhibitor, especially for copper. It can form an insoluble layer of benzotriazole copper with copper. It also has the same corrosion protection effect on aluminum, cast iron, steel, nickel, zinc and other metal materials. It can be added to the antifreeze of automobile engines, lubricating oil for grinding and cutting, and cleaning fluid for copper and copper alloys to prevent corrosion and improve the corrosion inhibition effect.\n",
        "typical_properties": "The pure product is white needle-shaped crystals, slightly soluble in water, soluble in alcohol, benzene, toluene, chloroform and other organic solvents.\nAppearance\nGood clarity, with a pricking sensation when touched; the velvet is long, without cotton wool, flakes, or foreign matter.\nMoisture(%)\n0.10 max\nBurning residue(%)\n0.03 max\nContent(%)\n99.5 min\nPH（25℃）\n5.0～6.0\nMelting point(℃)\n97～99.5\n10% ethanol color number(Hazen)\n20 max\nAlcohol soluble\nClear and transparent, without impurities",
        "packing": "Plastic woven bags, composite bags, cardboard drums, iron drums, container bags, plastic lined bags or aluminum foil inner bags.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "This product is widely used in rust inhibitors, antifreeze fluids, oil antioxidants (various lubricating oils, hydraulic oils, brake oils, transformer oils), emulsifiers, water stabilizers, UV-resistant or antistatic additives for polymer materials such as polyamide and polyester, photographic antifogging agents, emulsified mordants, PVC foaming inhibitors, analytical reagents, copper ore flotation agents and metal corrosion inhibitors.\n"
    },
    {
        "name": "(Butadiene rubber BR9000) Polybutadiene Rubber/Butadiene Rubber",
        "cas_no": "9003-17-2",
        "cins_no": "",
        "molecular_formula": "C4H6",
        "discription": "Butadiene rubber BR9000 has high elasticity, excellent cold resistance, wear resistance, flexure resistance, aging resistance and heat resistance. Used in tire industry to manufature tread and sidewall, also other wear -resisting rubber products such as cycle tire, plastic, transport belt, shoes,etc.\n",
        "typical_properties": "Butadiene rubber has high elasticity, excellent cold resistance, wear resistance, flexure resistance, aging resistance and heat resistance.\nVolatile matter(%)        0.50 max\nAsh(%)        0.2 max\nRaw Mooney (100°C)        45±4ml(1+4)\nCompound Mooney (100°C)        65ml(1+4) max\nTensile stress at 300% (25min,MPa)        7.0-12.0\nTensile stress at 300% (35min,Mpa)        8.0-13.0\nTensile stress at 300% (50min,Mpa)        8.0-13.0\nTensile strength (35min,Mpa)        13.2 min\nElongation at break (35min,%)        \n330 min\n",
        "packing": "In 25 kgs bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Butadiene rubber is mainly used in tire industry, can be used to manufacture rubber hose, rubber belt, rubber shoes, rubber stick, toys and so on. It can also be used for all kinds of cold-resistant products and used as shockproof materials.\n"
    },
    {
        "name": "C5 Hydrocarbon Resin",
        "cas_no": "64742-16-1",
        "cins_no": "265-116-8",
        "molecular_formula": "",
        "discription": "C5 hydrocarbon resin, also known as petroleum resin, is a non -toxic substance in granular form, with a color close to light yellow. It isn't a high polymer but a low polymer with the molecular weight between 300-3000. Featured by acid value, easy mutual solubility, resistant to water, resistant to ethanol and chemicals. It has the chemical stabilizing property to acid and alkaline, viscosity adjusting and thermal stabilizing. C5 resins are mainly used as tackifiers in adhesives (e.g. hot melt, pressure-sensitive adhesives, etc.), and also in road marking paints and rubber products, coating(especially traffic paint), printing ink, paper, etc.\n",
        "typical_properties": "Insoluble in water, ketone solvents, and glycol solutions, but it has very good solubility in aromatic hydrocarbons, esters, and chlorinated solvents such as chloroform. It benefits from excellent flexibility and adhesion properties. C5 petroleum resin belongs to the category of aliphatic resins with low molecular weight, capable of providing good chemical stability in acidic and alkaline environments, and can be blended with C9 petroleum resin.\nAppearance\nLight yellow granular\nSoftening point (℃)\n98-102\nColor number(Ga)\n4 ~ 6\nAcid value (%)\n0.5 max\nIodine value (mg BR/100g)\n20~45\nInsolubles acuities(%)\n0.1 max\nAsh(%)\n0.1 max\nBromine value (g Br/100g)\n70 max\nViscosity (190 ℃,MPa. S）\n1500~3000\nFire Point （℃）\n260",
        "packing": "In 25 kgs kraft paper bags, 500 kgs or 1,000 kgs jumbo bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Adhesives: Used as a tackifier in hot melt adhesives, pressure-sensitive adhesives, and solvent-based adhesives.\nCoatings: Used in the production of coatings for automotive, construction, and industrial applications, due to its excellent adhesion and compatibility with other materials.\nRubber: Used as a processing aid and tackifier in the production of rubber products, such as tires, hoses, and belts.\nPrinting inks: Used as a resin in the production of printing inks, due to its excellent compatibility with pigments and other additives."
    },
    {
        "name": " Carbon black N220",
        "cas_no": "1333-86-4",
        "cins_no": "215-609-9",
        "molecular_formula": "CH4",
        "discription": "Carbon Black N220 is a widely used high bolt-on furnace black with higher structural, its wear resistance between super wear-resisting furnace black and high abrasion furnace black and mainly used for all kinds of rubber. compared with N330 carbon\nblack, the N220 of carbon black rubber abrasion resistance is higher to 10% ~ 20%,and can give rubber high tensile strength and tear strength, and has a certain electrical conductivity, but heat and hardness is taller.",
        "typical_properties": "Carbon black is produced with high pure acetylene, which made from calcium carbide method, carbon black is made by the controlled combustion of acetylene in air under pressure.It is characterized by the highest degree of aggregation and crystallization orientation when compared with all types of carbon black. It has high iodine absorption, effective conductivity and steady chemical performance. It is not easy to react with acid, alkali and water and is an excellent raw material for battery, conductive rubber, plastic, cable, etc Test Items\nStandard\nIodine Adsorption (g/kg)\n121±7\nDBP Absorption (10-5m3/kg)\n114±6\nCDBP Absorption (10-5m3/kg)\n98±6\nCTAB Absorption Surface Area-N2          (103m2/kg)\n110±7\nN2SA (103m2/kg)\n114±7\nSTSA (103m2/kg)\n106±7\nTinting strength(%)\n116±8\nPH value\n8.0±2\nHeating Loss(%)\n≤1.0\nAsh Content(%)\n≤0.5\n45um Sieve Residue(mg/kg)\n≤0.05\n150μm Sieve Residue ( mg/kg)\n≤0.02\n500μm Sieve Residue ( mg/kg)\n≤0.0010\nImpurity\nNone\n300%Modulus (MPa)\n-1.9±1.5\nPour Density (kg/m3)\n355±40\nFine Content (%)\n≤10\nSize Distribution (%)\n2mm:\n0.25mm:",
        "packing": "In 25kgs/bag, 20kgs/bag, 500kgs/bag, 1000kgs/bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "N220 carbon black is widely used as a reinforcing agent and packing of rubber or plastic, such as rubber tire tread , sole, tape, heat resistant gaskets and other products.Can improve the processing performance,and used for soft PVC products,\nwire, cable sheath, artificial leather and other rolled products.Also used for coating,paint thickening agent and the ink pigment."
    },
    {
        "name": "Carbon black N330",
        "cas_no": " 1333-86-4",
        "cins_no": "215-609-9",
        "molecular_formula": "CH4",
        "discription": "Carbon Black N330 is most widely used type of high abrasion furnace black.It is a kind of good carbon black reinforcing performance , and can give a good rubber tensile properties, tear resistance, abrasion resistance and flexibility.\n",
        "typical_properties": "Carbon black is produced with high pure acetylene, which made from calcium carbide method, carbon black is made by the controlled combustion of acetylene in air under pressure.It is characterized by the highest degree of aggregation and crystallization orientation when compared with all types of carbon black. It has high iodine absorption, effective conductivity and steady chemical performance. It is not easy to react with acid, alkali and water and is an excellent raw material for battery, conductive rubber, plastic, cable, etc\nTest Items\nStandard\nIodine Adsorption (g/kg)\n82±6\nDBP Absorption (10-5m3/kg)\n102±6\nCDBP Absorption (10-5m3/kg)\n88±6\nCTAB Absorption Surface Area-N2          (103m2/kg)\n79±6\nN2SA (103m2/kg)\n78±6\nSTSA (103m2/kg)\n75±6\nTinting Strength ( %)\n104±8\nPH value\n8.0±2\nHeating Loss(%)\n≤1.0\nAsh Content(%)\n≤0.5\n45um Sieve Residue(mg/kg)\n≤0.05\n150μm Sieve Residue ( mg/kg)\n≤0.02\n500μm Sieve Residue ( mg/kg)\n≤0.0010\nImpurity\nNone\n300%Modulus (MPa)\n-0.5±1.5\nPour Density (kg/m3)\n380±40\nFine Content (%)\n≤10\nSize Distribution (%)\n2mm:\n0.25mm:",
        "packing": "In 25kgs/bag, 20kgs/bag, 500kgs/bag, 1000kgs/bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "N330 is suitable for all kinds of synthetic rubber and natural rubber,specially used in tire surface, shade cloth glue, the tire and all kinds of rubber industry products.\n"
    },
    {
        "name": "Carbon black N550",
        "cas_no": " 1333-86-4",
        "cins_no": "215-609-9",
        "molecular_formula": "CH4",
        "discription": "Carbon Black N550 is recommended to be used in cord layer of tires, sidewall of tires, the rubber material for extrusion or calendered goods.\n",
        "typical_properties": "Carbon black is produced with high pure acetylene, which made from calcium carbide method, carbon black is made by the controlled combustion of acetylene in air under pressure.It is characterized by the highest degree of aggregation and crystallization orientation when compared with all types of carbon black. It has high iodine absorption, effective conductivity and steady chemical performance. It is not easy to react with acid, alkali and water and is an excellent raw material for battery, conductive rubber, plastic, cable, etc\nIodine Absorption Value,g/kg\n\n43±5\nDBP Absorption Value,10-5m3/kg\n121±5\nDBP Absorption of Compressed Sample 10-5m3/kg\n80-90\nCTAB Absorption Area,103m2/kg\n36-48\nAdsorptive Specific Surface Area of Nitrogen,103m2/kg\n34-44\nNitrogen Absorption Surface Area,103m2/kg\n35-45\nTint Intensity,%\n--\nDecrement After Heating,%≤\n1.5\nAsh\n0.5\nPour density\n360+/- 40\nImpurities\n--\n300% Stretching Stress, Mpa≤\n-0.5±1.0",
        "packing": "In 25kgs/bag, 20kgs/bag, 500kgs/bag, 1000kgs/bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "N550 fits for nature rubber and all kinds of compound rubbers, easy dispersion, could provide rubber well inflexibility, fast extrusion, and smooth surface after extrusion with good reinforcing intensity, elasticity, and recovering intensity. It's better to mix with N660 when the N550 is used in butyl rubber (PIBI) inner tube.\n"
    },
    {
        "name": "  Carbon black N660",
        "cas_no": "                  1333-86-4   ",
        "cins_no": " 215-609-9",
        "molecular_formula": "CH4",
        "discription": "Carbon black N660 is black bead or granular or grain and amorphous solid, it is odorless with burning point more than 400°C, water insoluble, non-poisonous, stable chemical properties, excellent weather and light fastness.\n",
        "typical_properties": "Carbon black N660 is suitable for various vulcanizates. Compared to semi-reinforcement blacks, carbon black N660 has\nhigher structure, smaller particle size, easy to disperse, higher tensile stress and strain at break, lower heat -up, good elasticity and fatigue properties. The deficiency carbon black N660 is the low elongation. Its iodine adsorption value is 36 g/kg, and DBP adsorption is 90cm3/100g.\nItem\nUnit\nGrade\nN660\nIodine Adsorption Number\ng/kg\nSuperior\n36±4\nQualified\n36±6\nDBP Absorption Number\n10-5m3/kg\nSuperior\n90±5\nQualified\n90±7\nCompressed DBP Absorption Number\n10-5m3/kg\n69~79\nQualified\n66~82\nCTAB Surface Area\n103m2/kg\nSuperior\n31~41\nQualified\n29~43\nNitrogen Surface Area\n103m2/Kg\nSuperior\n31~39\nQualified\n29~41\nSTSA\n103m2/Kg\nSuperior\n34±5\nQualified\n34±9\nPH Value\n　\nQualified\n7±1.5\nHeating Loss\n%≤\nQualified\n1.5\nAsh Content\n%\n≤\nQualified\n0.7\n45um mesh\n%\n≤\nsuperior\n0.05\nQualified\n0.10\nImpurity\n　\nQualified\nNO\nFines Content\n%≤\nQualified\n7\nToluene Discoloration\n%\nmax\n1618\nQualified\n80\nSulfur\n%\nmax\n1619\nQualified\n1.1\nPour density\nkg/m3\nQualified\n440±40\nModulus at 300%\nMpa\nsuperior\n-2.6±1.0\nQualified\n-2.6±1.6",
        "packing": "In 25kgs/bag, 20kgs/bag, 500kgs/bag, 1000kgs/bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Carbon Black N660 is recommended to be used in cord layer of tires, inner tubes, bicycle tires, rubber tubes, rubber tapes, cable ropes, shoes kind, and patterns.\nN660 fits for all kinds of rubber, it has more complicated structure, smaller particles, and higher dispersion than half-reinforcing carbon black. The tensile strength, the tear resistance, and the tensile stress at a given elongation of vulcanized rubber are very high."
    },
    {
        "name": "Rubber accelerator CBS (N-Cyclohexyl-2-Benzothiazole Sulfenamide)",
        "cas_no": " 95-33-0",
        "cins_no": "  202-411-2",
        "molecular_formula": "C13H16N2S2",
        "discription": "It is a highly flexible after-effect accelerator with typical advantages of sulfenamide accelerators, such as excellent anti-scorch performance, safe processing, short vulcanization time, etc. When the vulcanization temperature is above 138℃, the accelerator CBS has a strong promoting effect. It is often used as a second accelerator with alkaline accelerators such as TMTD and DPG, and some alkaline accelerators such as thiurams and dithiocarbamates can also enhance its activity as a compounding agent. It is mainly used in the manufacture of industrial rubber products such as tires, hoses, rubber shoes, cables, etc.\n",
        "typical_properties": "Gray, light yellow powder or granules with a little odor, no poison. The density is 1.31-1.34. And melting point 90-108oC.Soluble benzene, methylene chloride, carbon tetrachloride, ethyl acetate, acetone, ethanol-soluble and petrol do not dissolve in water.\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nGrayish\nInitial M.P. ℃≥\n98.0\n97.0\n97.0\nLoss on Drying %≤\n0.30\n0.30\n0.30\nAsh %≤\n0.30\n0.30\n0.30\nInsoluble Methanol%≤\n0.50\n0.50\n0.50\nFree Amine %≤\n0.50\n0.50\n0.50\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "A medium fast primary accelerator suitable for NR, IR, SBR, NBR, HR and EPDM. An outstanding delayed action accelerator. Be top effective and safe when used at ordinary processing temperatures, causing no scorches. Vulcanized show excellent physical property and quick complete."
    },
    {
        "name": "Coumarin",
        "cas_no": " 91-64-5",
        "cins_no": "202-086-7",
        "molecular_formula": "C9H6O2",
        "discription": "Coumarin, also known as 1,2-benzopyrone and o-oxonaphthone, is an organic compound with the chemical formula C9H6O2. It is an important fragrance and is often used as a fixative, deodorant, and in the preparation of perfumes and spices. It is also used as a flavor enhancer for beverages, foods, cigarettes, plastic products, rubber products, etc.\n",
        "typical_properties": "White crystalline powder, insoluble in cold water, easily soluble in hot water, alcohol, ether, chloroform and sodium hydroxide solution.\nOdor\nSimilar to the sweet aroma of tonka beans and fresh hay\nAppearance\nWhite crystal\nContent(%)\n99.0 min\nMoisture(%)\n0.2 max\nMelting point(℃)\n69 min\nLight Transmittance\n2 max",
        "packing": "In 25 kgs net drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Coumarin is an important flavoring agent, commonly used as a fixative, deodorant, and in the preparation of perfumes and spices. It is also used as a flavoring agent for beverages, foods, cigarettes, plastic products, rubber products, etc. In medicine, it is added to drugs as a flavoring agent.\nCoumarin derivatives are also used as rodenticides due to the property of causing fatal hemorrhaging. Coumarin has the characteristic odour like that of vanilla beans. It is used for the preparation of perfumes, soaps, flavourings. The coumarin nucleus (benzo-2-pyrone) is derived cinnamic acid (phenylacrylic skeleton) in the biosynthesis. Accordingly, the hydroxy group attached to coumarin structure at 7 position is important in biosynthesis pathway. Umbelliferone (7-hydroxy coumarin), esculetin (6,7-Dihydroxycoumarin), scopoletin (7-hydroxy-6-methoxycoumarin) are the widespread coumarins in nature. Synthetic 7-hydroxy coumarins are used to absorb ultraviolet rays in sunscreen cosmetics and used in the synthesis of drugs especially anticancer.\n"
    },
    {
        "name": " Coumarone resin",
        "cas_no": " 63393-89-5\n",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Coumarone resin is a brown to dark brown granule or flake thermoplastic resin, produced by ethylene and carbon fraction of C9fractions, coal tar and ethylene re-tar distillates as raw materials, mainly used in rubber, tire, ink, paint, adhesive, etc.\n",
        "typical_properties": "Brown to dark brown granule, softening point 75~135℃. Glass transition temperature 56℃. It looks like rosin, soluble in chlorinated hydrocarbons, esters, ketones, ethers, hydrocarbons, most resin oils, nitrobenzene, aniline and other organic solvents, insoluble in water and lower alcohols. \nColor number, sample: Toluene        1: 1: 18#\nSoftening point° C(ring and ball method)        7 max\nAcid Value(MgKOH/g)        70-80\nAsh content        0.2-0.5\nPH value        5-8\nAcid value (mgkOH/g)        1.0\nMoisture        0.1",
        "packing": "In 25kgs bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Commonly used as rubber softener, rubber additive, and is mainly used for making types, rubber tubes, covey belt, and triangle belt and rubber shoes. It may improve rubber process capability, intensify physical property of rubber, and improve the intensity, elasticity and antioxidant of manufacture. It also can be used as waterproof of polyurethane and antisepsis dope.\nTire and Rubber:\nTires and rubber are mainly the use of low softening point coumarone resin. It has a good miscibility with natural rubber particles, and the rubber vulcanization process is not a big impact, Tire and Rubber caused the resin can play a tackifying, reinforcement, softening effect.\nPaint and Ink:\nPaint mainly using high softening point coumarone resin, this resin can increase the added paint gloss paint, paint film adhesion, hardness, acid and alkali resistance."
    },
    {
        "name": "Chlorinated Polyethylene (CPE 135A)",
        "cas_no": "63231-66-3",
        "cins_no": "",
        "molecular_formula": "C4H7Cl",
        "discription": "Chlorinated polyethylene is a kind of random polymer material, composed of high density polyethylene (HDPE) through chlorination reaction and polymer modification, as the condition of chlorination, and the polyethylene chlorine content change in the material, can be made from rubber shape to hard plastic products, it is a kind of special rubber, it is a kind of excellent plastic modifier, and it is a permanent plasticizer of PVC rigid products.\nThis additive can be applied to all PVC rigid products, such as PVC pipe, conduit/trunking, profile, sheet/board, tile, seal strip etc.\nthat cannot be used.",
        "typical_properties": "Non-toxic and tasteless. It has excellent weather resistance, ozone resistance, chemical resistance and aging resistance.\nItem\nSpecification\nChlorine Content %\n35±2\nHeat of Fusion J/g ≤\n2.0\nThermal Decomposition ℃ >\n170\nResidue on Sieve (0.9mm mesh) %\n2.0\nColored Particles PCS/50g ≤\n10\nVolatile Content % ≤\n0.4\nShore Hardness Shore A ≤\n60\nMooney Viscosity ML(1+4)125℃ ≤\n100\nTensile Strength Mpa ≥\n8.0\nElongation at break % ≥\n600\n",
        "packing": "In 25kg, 500kg or 600kg plastic woven bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "CPE 135A is mainly used as impact modifier in rigid PVC products, such as PVC door and PVCwindow profile, U-PVC sewage pipes, PVC panels, PVC conduits, PVC extrusion board, laminate, etc.\n"
    },
    {
        "name": "Chlorinated Polyethylene (CPE 135B)",
        "cas_no": "63231-66-3\n",
        "cins_no": "",
        "molecular_formula": "C4H7Cl",
        "discription": "CPE 135B   is chlorinated polyethylene thermoelastomer. Acts as an impact modifier. Exhibits low temperature resistance, low plastic temperature, low ML viscosity and fine machining function. Possesses good heat resistance, heat deflection and fire resistance. It has an irregular structure without any crystals. It is compatible with CR, CSM, NBR, EPDM and SBR. Can be used for general-purpose synthetic rubber. CPE 135B is recommended for use in the manufacture of wire sleeve, sealing parts, conveyer belt, automobile rubber pipe and V-belt.",
        "typical_properties": "CPE-135B is a kind of saturated thermoplastic elastomer, almost no crystallization. With its characters of low mooney viscosity, low plasticizing temperature and mixability with natural or synthetic rubber (for example CR, CSM, NBR, EPDM, SBR), rubber products can finally get excellent properties of weatherability, flexibility and flame-resistance.\nItems\nIndex\nChlorine(%)\n35±1\nHeat of fusion(J/g)\n≤2.0\nResidue on sieve (0.9mm sieve,%)\n≤2.0\nColored particles(PCS/50g)\n≤10\nShore hardness\n≤60\nMooney viscosity(ML(1+4)125°C)\n≤75\nElongation at break(%)\n≥800",
        "packing": "In 25kg, 500kg or 600kg plastic woven bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "CPE-135B is widely used in wire and cable sheath, hoses, seals and other rubber field.\n"
    },
    {
        "name": "Chloroprene Rubber CR 232",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A xanthogen or dodecyl mercaptan modified polychloroprene rubber with medium crystallization rate. The density is 1.23. It has good heat resistance andhigh temperature stability. It is similar to Denka’s M-40 and Du Pont’s neoprene W.\n",
        "typical_properties": "Properties\nSpecification\nMooney viscosity (ML)\nCR 2321\nCR 2322\nCR2323\n30~45\n46~55\n70-130(customized)\nMooney burning,Mst5,Min ≥\n11\nTensile Strength,Mpa ≥\n12\n500% Stress at Definite Elongation,Mpa\n1~5\nElongation at Failure,%≥\n750\nVolatile matter,%≤\n1.5\nAsh,%≤\n1.0",
        "packing": "In 25kg kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used for manufacture of light-colored rubber products such as seals, dust cover, rubber covered roller, lining, rubber dams and hose outer sheath and etc.\n"
    },
    {
        "name": "Chloroprene Rubber (CR 244)",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A xanthogen-modified polychloroprene rubber with fast crystallization rate,high cohesioin force and adhesion strength at normal temperature. Fast crystallization rate, density 1.23, milky or light brown block, non-polluting. Its molecular structure is regular, its cohesion is high, and its adhesive strength is high at room temperature.   Used maily for production of adhesives. It is similar to Du Pont's neoprene type AD-20 and Denka A-90.\n",
        "typical_properties": "CR Series\nBrookfield\nViscosity In 5%   toluene solution (mPa.s at 23℃)\nBrookfield\nViscosity In 15% toluene solution (mPa.s at 23℃)\nCrystallization\nAsh\nContent%\n≤\nVolatiles\nContent%\n≤\nPeeling\nStrengthen/Cm\n≥\nCR-2441\n25-34\n1000-2000\nHigh\n1.0\n1.5\n90\nCR-2442\n35-53\n2000-3000\nCR-2443\n54-75\n3000-5000\nCR-2444\n76-115\n5000-7000\nCR-244A\n116-140\n7000-9000\nCR-244B\n≥140\n≥9000\n",
        "packing": "In 25kg kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is the main substrate for neoprene adhesives. Widely used for self-adhesion or mutual adhesion of rubber, leather, fiber, metal, wood, cement products, etc.\n"
    },
    {
        "name": "Cyclohexane",
        "cas_no": "110-82-7",
        "cins_no": "203-806-2",
        "molecular_formula": "C6H12",
        "discription": "Cyclohexane is a type of cycloalkane, also known as hexahydrobenzene. It is a colorless, flammable, slightly soluble in water, volatile, slightly pungent odor liquid, non-corrosive, with a molecular formula of C6H12.\n",
        "typical_properties": "Colorless liquid. With special smell. When the temperature is higher than 57℃, it is miscible with anhydrous ethanol, methanol, benzene, ether, acetone, etc., but insoluble in water. It is highly flammable, and its vapor can form an explosive mixture with air. It is very easy to burn and explode when exposed to open flames and high heat. It reacts violently with oxidants and even causes combustion.\nAppearance\nColorless and transparent\nContent(%)\n99.5 min\nColor(Hazen)\n35 max\nBoiling range(℃)\n80-82\nCrystallization point(℃)\n5.3 min\nBenzene content(mg/Kg)\n500 max\nMethylcycloalkanes(mg/Kg)\n700 max\nCyclohexene\n500 max\nEvaporation residue(%)\n0.002 max\nMoisture(%wt)\n0.02 max",
        "packing": "Cyclohexane is packaged in clean and dry tank trucks, galvanized tinplate barrels or iron barrels, with a net weight of 125 kg per barrel.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as the raw material of nylon 6 and nylon 66, and is also an excellent solvent for cellulose, resin, wax, grease, asphalt and rubber. When used as a solvent, it is usually a mixture of cyclohexane and other hydrocarbons. It can also be used as a polymerization diluent, such as a polymerization solvent for thermoplastic elastomer SBS, and can also be used as a pesticide and pharmaceutical intermediate.\n"
    },
    {
        "name": "Dark color C9 Hydrocarbon Resin",
        "cas_no": "64742-16-1",
        "cins_no": " 265-116-8\n",
        "molecular_formula": "",
        "discription": "Dark Color C9 petroleum resin,also known as Dark Color C9 Hydrocarbon Resin is a petroleum by-product of ethylene made of C9 fraction which is produced by pre-treatment, polymerization and distillation processes. It is not a high polymer but a low polymer molecular weight between 300-3000. It has the characteristics of low acid value, good miscibility, water,ethanol and chemical resistance, the chemical stability against acid, the good adjustment of viscosity and thermal stability. Generally, 9 petroleum resin is not used alone, but as promoters, regulators, modifiers used with other resin.It is mainly used in coatings, rubber additives, paper additives, inks, adhesives and other fields, and has a large market demand.\n",
        "typical_properties": "Soluble in acetone, methyl ethyl ketone, cyclohexane, ethylene dichloride, ethyl acetate, toluene, gasoline, etc. Insoluble in ethanol and water.\nItem\nDark color C9 hydrocarbon resin\nSoftening point( R & B, ℃)\n100\n110\n120\nGardner Color No. series (Resin:\ntoluene=1:1)\n15 - 18 #\n15 - 18 #\n15 - 18 #\nAcid Value (mgKOH/g\n0.5 max\nAsh Content %\n0.1 max",
        "packing": "In 25 kgs kraft paper bags, 500 kgs or 1,000 kgs jumbo bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1.Paints Industry:\nIn paint industry mainly use the high softening point of C9 petroleum resin which can increase the gloss of paint and improve the adhesion, the hardness and the resistance ability of ac id and alkali.\n2.Tire and Rubber Industry:\nIn tire and rubber industry, low softening point of C9 petroleum resin is mainly used which has a good miscibility with natural rubber particles, and little affect on rubber vulcanization. Adding in rubber and tires, petroleum resin can increase the adhesion and the reinforcement and can also play as softener.\n3. Adhesives Industry:\nC9 petroleum resin having good adhesion, added in the process of producing adhesives and pressure-sensitive adhesives can improve the adhesive bond strength, acid resistance, alkali resistance and water resistance, and also can reduce production costs effectively.\n4.Ink Industry:\nIn ink industry mainly use the high softening point of C9 petroleum resin which can reach the effect of show color, quick-drying and brightening and improve printing performance, etc.\n5.Others petroleum resin having certain characteristic of unsaturated, can be used as paper glue, plastic modifier etc."
    },
    {
        "name": "Chloroprene Rubber (DCR 114)",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A sulfur-modified copolymer made by copolymerization of chloroprene and dichloro -butadiene,a product that has excellent crystallization resistance and good molding adhesion,Used mainly for manufacture of dynamic products with high strength such as conveyer ,synchronous belt,etc.\nIt ls similar to Do Pont’t neoprene type GRT and Denka’s PS-40.",
        "typical_properties": "Properties\nSpecification\nMooney viscosity (ML)\nDCR 1141\nDCR 1142\n30~45\n46~60\nMooney burning,Mst5,Min ≥\n25\nTensile Strength,Mpa ≥\n20\n500% Stress at Definite Elongation,Mpa\n1~5\nElongation at Failure,%≥\n800\nVolatile matter,%≤\n1.5\nAsh,%≤\n1.5",
        "packing": "In 25kg kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used to manufacture belts, timing belts, multi-coupling belts and so on.\n"
    },
    {
        "name": "Chloroprene Rubber DCR 213",
        "cas_no": " 9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "A xanthogen-modified copolymer with excellent stability, crystallizing and cold resistance. Has excellent anti-crystallization properties. Mainly used for dust cover, bridge damping pads, sealing strips and soon. It’s similar to Do Pont’s Neoprene type WRT and Denka’s S-40.",
        "typical_properties": "Properties\nSpecification\nMooney viscosity (ML)\nDCR 2131\nDCR 2132\n30~45\n46~55\nMooney burning,Mst5,Min ≥\n14\nTensile Strength,Mpa ≥\n12\n500% Stress at Definite Elongation,Mpa\n1~5\nElongation at Failure,%≥\n700\nVolatile matter,%≤\n1.5\nAsh,%≤\n1.5",
        "packing": "In 25kg kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used in low-temperature products, anti-corrosive liners, such as vehicle sealing parts, rotating protective covers, hold-in belts, rubber fittings in recorders, vibration absorber for bridges etc."
    },
    {
        "name": "Diphenylamine",
        "cas_no": "  122-39-4",
        "cins_no": "204-650-8",
        "molecular_formula": "C12H11N",
        "discription": "Diphenylamine is an organic compound with the formula (C6H5)2NH. The compound is a derivative of aniline, consisting of an amine bound to two phenyl groups. The compound is a colorless solid, but commercial samples are often yellow due to oxidized impurities. Diphenylamine dissolves well in many common organic solvents, and is moderately soluble in water. It is used mainly for its antioxidant properties. Diphenylamine is widely used as an industrial antioxidant, dye mordant and reagent and is also employed in agriculture as a fungicide and antihelmintic.\n",
        "typical_properties": "White monoclinic flaky crystals, easily soluble in benzene, acetone, carbon tetrachloride and ethyl acetate, soluble in ether, ethanol, petroleum ether and glacial acetic acid. It is weakly alkaline and reacts with strong acid to form water-soluble salts.\nAppearance\nWhite and light brown flakiness\nDiphenylamine(%)\n\n99.60 min\nLow Boiling Point(%)\n0.30 max\nHigh Boiling Point(%)\n0.30 max\nAniline(%)\n0.10 max",
        "packing": "Composite paper bag lined with plastic film bag (net weight 25 kg) / galvanized iron drum (net weight 210 kg) / ISOTANK, or\ncan be packaged according to user requirements.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Diphenylamine is mainly used for synthesizing rubber antioxidant, dye, medicine intermediate, lubricating oil antioxidant and gunpowder stabilizer.\n"
    },
    {
        "name": "Dioctyl sebacate (DOS)",
        "cas_no": " 122-62-3",
        "cins_no": "  204-558-8",
        "molecular_formula": "C26H50O4",
        "discription": "Dioctyl sebacate, also known as dioctyl sebacate, has a molecular formula of C26H50O4 and is an ester organic compound, mainly used as a low-temperature plasticizer.",
        "typical_properties": "Transparent liquid. Insoluble in water, miscible with ethanol, ether and acetic acid. Has a foul odor, boiling point 109.7℃. Melting point -85℃.\nAppearance\nTransparent liquid, no suspension object\nColority ( Pt-Co )\n30 max\nPurity(%)\n99 min\nMoisture(%)\n0.1 max\nAcidity(mgKOH/g)\n0.04 max\nSpecific gravity(g/cm³)\n0.913-0.916",
        "packing": "In 200kgs drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Dioctyl Sebacate (DOS) is used as a plasticizer for PVC, Nitrocelluloses, Styrene resins, and synthetic rubbers where low temperature performance is required. DOS is also compliant with FDA CFR 21 for food contact materials. Dioctyl Sebacate can also be used in lubricants to allow more mobility at lower temperatures. DOS can be used as anti-frosting cable, artificial leather, outdoor cable, PVC linoleum, resins and synthetic rubbers. Dioctyl Sebacate provides a silky feel and spreads easily. Because of this, Dioctyl Sebacate finds use in the personal care industry and is found in deodorants and antiperspirants, makeup, skin conditioners, lotions, and sunscreens.\n"
    },
    {
        "name": " 1,3-Diphenylguanidine (Rubber accelerator DPG)",
        "cas_no": "0102-06-07",
        "cins_no": "203-002-1",
        "molecular_formula": "C13H13N3",
        "discription": "Rubber accelerator DPG is a medium-speed accelerator for rubber. Can be used as an activator for thiazole thiuram and sulfonamide accelerators. Used for continuous vulcanization when used with accelerators DM and TMTD. Has anti-aging properties. Commonly used for natural rubber and synthetic rubber, not suitable for latex. Mainly used in the manufacture of tires, rubber sheets, rubber shoes and other rubber industrial products.\n",
        "typical_properties": "Odorless and no- toxic. Soluble in chloroform, toluene benzene and ethanol; Insoluble in gasoline and water. Not hygroscopic.                       Item\nPowder\nOil-filled Powder\nGranule\nAppearance\nWhite to grey\nInitial M.P. ℃≥\n144.0\n144.0\n144.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.30\n0.30\n0.30\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Used as a medium-speed accelerator for natural rubber and synthetic rubber. It is often used as an active agent for thiazole, thiuram and hypoiodine accelerators. When used with accelerators DM and TMTD, it can be used for continuous vulcanization. When using thiazole accelerators as the second accelerator, the aging resistance of the vulcanized rubber is reduced, and it must be matched with an appropriate antioxidant.\n2. Used to manufacture tires, rubber plates, soles, industrial products, hard rubber and thick-walled products.\n3. Used as a plastic crosslinking agent, temperature indicating material, additive for ore flotation, coating additive, polishing material additive, metal analysis reagent and additive for building materials.\n4. In chloroprene rubber, this product has the function of plasticizer and peptizer; this product is not suitable for white or light-colored products and rubber products in contact with food."
    },
    {
        "name": "4,4'-dithiodimorpholine (Vulcanizing Agent DTDM)",
        "cas_no": "103-34-4",
        "cins_no": "",
        "molecular_formula": "C8H16N2O2S",
        "discription": "DTDM is used as a vulcanizing agent and accelerator for natural rubber and synthetic rubber. When used as a vulcanizing agent, active sulfur can only be decomposed at the vulcanization temperature, so the use of this product is safe and will not cause scorching. The vulcanization speed of this product is slow when used alone, but it can be increased when used in combination with accelerators such as thiazoles, thiurams or dithiocarbamates. Although salicylic acid acidic substances can promote the decomposition of this product and accelerate the vulcanization speed, they can reduce the physical properties of the vulcanized rubber. When used as an accelerator, due to the high effective sulfur content of this product, the amount of sulfur can be appropriately reduced. When using this product, the rubber material will not frost, pollute, or change color. When used in effective and semi-effective vulcanization systems, the resulting vulcanized rubber has good heat resistance and aging resistance.",
        "typical_properties": "The white either the buff color crystallize (powder). Specific gravity: 1.32-1.38. Nontoxic. Do not dissolve in water,micro-fat-soluble hydrocarbons, dissolved in hot ethanol, acetone and carbon tetrachloride, soluble in benzene.\nItem\n\nStandard\nAppearance\nThe white either the buff color crystallize\nInitial M.P. (℃ )\n120 min\nLoss on Drying(%)\n0.3 max\nAsh(%)\n0.3 max",
        "packing": "In 25kg bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Sulphur donor vulcanizing agent for efficient vulcanization and semi-efficient vulcanization cure system; provide heat reversion aging resistance in NR and synthetic rubbers; non-blooming; excellent storage safety.\n"
    },
    {
        "name": "N,N'-Ethylenebis(stearamide)",
        "cas_no": " 110-30-5",
        "cins_no": " 203-755-6",
        "molecular_formula": "C38H76N2O2",
        "discription": "Ethylene Bis(Atearamide) derived from Stearic acid with Ethylene Diamine is a synthetic was used as a dispersing agent or internal/external lubricant for benefits in plastic applications to facilitate and stabilize the dispersion of solid compounding materials to enhance processability, to decrease friction and abrasion of the Plolymer surface, and to contribute color stability and corrosion prevention. It is also used as a release agents, Antistats, and Antifoaming agent.\n",
        "typical_properties": "White powder or beads, insoluble in water, soluble in ketones, alcohols, organic solvents at high temperature).\nAppearance\nWhite powder or beads\nMelting point(°C)\n140 min\nAcidity(mgKOH/g)\n6 max\nAmide value(mgKOH/g)\n6 max\nClolority(#)\n4 max\nMoisture\n0.5 max",
        "packing": "In 25/20kgs bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as ABS and PE masterbatch. It is a lubricant for molding, polishing and injection molding of hard and transparent PVC, PS, PA, POM, PC, etc. Generally, 0.3-5% can be added without affecting the thermal stability, surface appearance, color tone, transparency of the film, etc. of the plastic. It is also used as a lubricant for highly filled PP, as a surface brightener, anti-sticking agent and leveling agent in inks, paints and coatings; as a wire drawing lubricant in metal processing and powder metallurgy industries; as a dispersant and lubricant for ABS masterbatch and PE functional modified masterbatch, a lubricant for plastic sheets, and a defoamer in the papermaking industry.\n"
    },
    {
        "name": " Ethylene Thiourea",
        "cas_no": "96-45-7",
        "cins_no": "202-506-9",
        "molecular_formula": "C3H6N2S",
        "discription": "Rubber accelerator ETU is an ultra-accelerator for polychloroprene rubber. It is also used in latex as a primary accelerator.   It is active even at low temperatures.   ETU can be used without zinc oxide for transportation articles.   It is an antioxidant in adhesive systems.\n",
        "typical_properties": "White powder. Little bitter. Density is 1.42-1.43. Soluble in water，alcohol, ethylene glycol and pyridine, do not dissolve ether, benzene, chloroform and petroleum ether.   No pollution to final products. Stabilization storage \nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nWhite\nInitial M.P. ℃≥\n193.0\n193.0\n193.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.30\n0.30\n0.30\nResidues (150μm) %≤\n0.10\n0.10\n--\nResidues (63μm) %≤\n0.50\n0.50\n--\nOil Content%\n--\n1.0-2.0\n--\nHardness   N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "The product can be used to chloroprene rubber, Epichlorohydrin rubber, chlorinated polyethylene, etc., are particularly suited to non-curing system of the chlorine-butylamine Hopewell accelerator. Can often 100-500 ℃, with the right selection system can be the best rapid curing, and the whole parade security. Its products vulcanized high tensile strength, permanent deformation small for W (54-1 type polychloroprene), a non-curing system into effect significantly. It usually with zinc oxide and magnesium oxide together with the use, mainly for industrial products, and coating lines, shoes and other clothing chloroprene rubber products.\n"
    },
    {
        "name": "Fumed silica (silicone dioxide)",
        "cas_no": "112945-52-5",
        "cins_no": "231-545-4",
        "molecular_formula": "O2Si",
        "discription": "Fumed silica is composed of submicron-sized spheres, which are 40-60% fused into short chains, very highly branched, 0.1-0.2 microns long. The spheres are quite uniform in size for a given product, but the chain lengths are quite variable, 10 to 30 units in length. The surface area, which varies with the particle size, gives a good approximation of the sphere diameter. The smaller the particles, the larger the estimated surface area.\n",
        "typical_properties": "White, non-toxic, tasteless, odorless, non-polluting non-metallic oxide. Small particle size, large specific surface area, high surface activity.\nAppearance\nWhite powder\nWhiteness\n98 min\nSiO2 content(%)\n99.99 min\npH value\n3.5-4.5\nAverage particle value um\n14 nm\nBulk density g/L\n40-50\nHeating loss (105 for 2h,%)\n0.5-1.0\nIgnition loss (1,000 for 2h,%)\n1.0-1.5\nBET specific surface area m2/g\n200±25\nWhiteness\n98 min",
        "packing": "In 10/20 kgs net plastic bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Paint and coating, unsaturated polyester resins, laminating resins and gel coat, HTV and RTV-2K silicon rubber, adhesive and fluid sealant, printing ink, cable rubber, plant protection, food and cosmetics, reinforce silicon rubber, improve the quality of the powder, and improve the liquidity and anti-blocking characteristic.\n"
    },
    {
        "name": " 4-Hydroxy-2,6-Tetra-Methyl-1-Piperidine-ethanol",
        "cas_no": " 65447-77-0",
        "cins_no": "",
        "molecular_formula": " C17H33NO6",
        "discription": "Light Stabilizer 622 is hindered amine light stabilizer, used in light aging inhibition of polyethylene, polypropylene, polyurethane, metaformaldehyde polyamine and polyester, also in ABS and engineering plastics.\n",
        "typical_properties": "White crystalline powder, soluble in methyl benzene, dimethyl benzene, chloroform and furan etc. insoluble in water, methanol, alcohol and hexane. Nitrogen Content:4.9% Softening Temperature:55-85℃\nItem\nStandard\nAppearance\nWhite or pale-yellow granule\nVolatile matter\n≤0.5 % (105℃ 2hrs\nTransmittance\n425nm ≥ 97%\n500nm ≥ 98%\nAsh\n≤0.1%\nMolecular weight (Mn)\n>2100 (contrast with polystyrene)",
        "packing": "In 25kg carton, or as customer's request\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Light Stabilizer 622 belongs to the newest generation of polymeric Hindered Amine Light Stabilizer, which has excellent hot processing stability. Terrific compatibility with resin, satisfying tractability against water and extreme low volatility and migratory. Light stabilizer 622 can be applied to PE.PP. Polystyrene, ABS, polyurethane and polyamide etc, optimum effects are obtained when used with antioxidants and UV-absorbers. Light stabilizer 622 is one of the light stabilizers that are sanctioned by FDA to be used in food packages. Reference dosage in PE agricultural film: 0.3-0.6%.cialty applications.\n"
    },
    {
        "name": " Bis (2,2,6,6-tetramethyl-4-Piperidinyl) sebacate",
        "cas_no": "",
        "cins_no": "",
        "molecular_formula": "C28H52O4N2",
        "discription": "Light Stabilizer 770   is a low molecular weight hindered amine light stabilizer with low volatility, migration resistance, and high temperature resistance. It has synergetic effect with antioxidants and UV absorbers.\n",
        "typical_properties": "It is a low molecular weight hindered amine lightstabilizer. lt has broad compatibility and can be easily dispersed in theresins. Benefits of using UV-770 is the high light-stabilizingperformance, particularly in PP thick sections to protect the surface.Theuse of UV-770 also provides good light stability in articles withhigher specific surface, such as films and tapes.\nItem\nStandard\nAppearance\nWhite powder\nInitial melting point（℃）\n181 min\nAsh content(%)\n0.05 max\nLoss on heating(%)\n1.0 max\nFe content, 10-6\n10 max\nColor value (APHA)\n100 max\nGrain size(1mm)\n1mm 100%",
        "packing": "In 25kg carton, or as customer's request\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is widely used in polypropylene, impact modified polypropylene,ethylene propylene rubber, styrene polymer, impact polystyrene,polyurethane, polyamide, polyacetal and other polymers. Combination of UV-770 with antioxidants or other light stabilizers in many casesresult in svneraistic effects effectively prevent the light aging of polymersand provide good light stability and long-term thermal stability.\n"
    },
    {
        "name": "  Poly {[6―[(1,1,3,3-tetramethylbutyl)amino]-1,3,5-triazine 2,4-diyl][(2,2,6,6-tetramethyl-4-piperidyl)imino]-1,6-hexanediyl[(2,2,6,6-tetramethyl-4-piperidyl)imino]}",
        "cas_no": "71878-19-8",
        "cins_no": "",
        "molecular_formula": "C35H69Cl3N8",
        "discription": "Light Stabilizer 944 is one kind of high molecular Light stabilizer, with multiple functional groups .It can be used in low density PE film, PP tape, EVA film, ABS, PP fiber PE, polyacetals ,polyamides, polyurethanes, PVC, PVC blending material, polystyrene, rubber and viscose, It can work with UV adsorbent because its special structure and large molecular weight(3000).It also can be used in film and fiber, also can be used as antioxidant and heat stabilizer of polymer.\n",
        "typical_properties": "Appearance: Light Yellow Particles Particle Size: 1-2MM Softening Temperature: 100-135°C Loss on Heating: 1% a300 °C. Item\nStandard\nAppearance\nWhite powder or granule\nVolatile matter\n≤1.0 %\nTransmittance\n425nm ≥ 93%\n500nm ≥ 95%\nAsh\n≤0.1%\nMolecular weight (Mn)\n>2000 Mn",
        "packing": "In 25kg carton, or as customer's request\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "UV Stabilizer 944 (HALS 944) areas of application include polyolefins (PP, PE), olefin copolymers such as EVA as well as blends of polypropylene with elastomers. In addition, in certain instances UV Stabilizer 944 (HALS 944) is highly effective in polyacetals, polyamides, polyurethanes, flexible and rigid PVC, as well as PVC blends and in certain styrenic elastomer and adhesive specialty applications."
    },
    {
        "name": " 2-Mercaptobenzothiazole",
        "cas_no": "149-30-4",
        "cins_no": "205-736-8",
        "molecular_formula": "C7H5NS2  ",
        "discription": "Rubber accelerator MBT is an accelerator for natural rubber and synthetic rubber, with a wide vulcanization range, can be used alone or in combination with sulfurized carbamates, thiurams, guanidines, and other alkaline accelerators. It has a rapid accelerating effect on natural rubber and general sulfur-sulfurized synthetic rubbers, and its critical temperature of sulfurization is low. It is easy to disperse in rubber and does not pollute. It is mainly used in the manufacture of tires, belts, rubber shoes and other industrial rubber products.\n",
        "typical_properties": "Light yellow or off-white powder, slightly smelly, bitter, non-toxic, specific gravity 1.42-1.52, melting point: above 170℃, easily soluble in ethyl acetate, acetone, sodium hydroxide and dilute sodium carbonate solution, soluble in ethanol, not easily soluble in benzene, insoluble in water and gasoline.\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nLight Yellow\nInitial M.P. ℃≥\n171.0\n170.0\n170.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.40\n0.40\n0.40\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nLight Yellow\nInitial M.P. ℃≥\n171.0\n170.0\n170.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.40\n0.40\n0.40\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nLight Yellow\nInitial M.P. ℃≥\n171.0\n170.0\n170.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.40\n0.40\n0.40\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nLight Yellow\nInitial M.P. ℃≥\n171.0\n170.0\n170.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.40\n0.40\n0.40\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used to manufacture tires, belts, rubber shoes and other industrial rubber products. For IR, NR, SBR, NBR, HR and EPDM systems, it is a major acidic vulcanizer with a medium vulcanization speed. It can achieve higher activity when used in combination with other vulcanizers such as DM and TMTD and other alkaline vulcanizers. It has a low vulcanization temperature, is easy to disperse in rubber and does not pollute. It is mainly used to manufacture tires, belts, rubber shoes and other industrial rubber products, but cannot be used as a food material.\n"
    },
    {
        "name": " 2,2'-Dithiobis(benzothiazole)",
        "cas_no": "120-78-5",
        "cins_no": "241-774-1",
        "molecular_formula": "C14H8N2S4",
        "discription": "Rubber accelerator MBTS is a universal accelerator for natural rubber, synthetic rubber and reclaimed rubber. It can be used to manufacture tires, hoses, tapes and general industrial rubber products. MBTS can also act as a plasticizer or delay agent in chloroprene rubber.\n",
        "typical_properties": "Slightly foul odor and bitter taste, nonpoisonous. Soluble in ethyl acetone, acetone, dilute\nsolution of sodium hydroxide and sodium carbonate, ethyl alcohol. Not easily soluble in benzene.\nInsoluble in water and gasoline. Item\nPowder\nOil-filled Powder\nGranule\nAppearance\nLight Yellow\nInitial M.P. ℃≥\n166.0\n165.0\n165.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.50\n0.50\n0.50\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used for NR, IR, SBR, NBR, HR and EPDM. One of the mainly used acidic accelerators\ncurrently and a medium fast primary accelerator. Imparts excellent aging properties, when used both\nalone and in combination with DM, TT and many others, mainly basic accelerators for higher activity. But\ncare should be taken because it has a slight tendency to scorch. Unsuitable for use in the manufacture of\nfood contact materials. Mainly used in the manufacture of tires, tubes, footwear, rubber belts and hoses\netc."
    },
    {
        "name": " 4,4'-Methylene bis(2-chloroaniline)",
        "cas_no": "101-14-4",
        "cins_no": "202-918-9",
        "molecular_formula": "C13H12Cl2N2",
        "discription": "MOCA,4,4'-Methylene-bis(2-chloroaniline), chlorinated analogue of 4,4’-methylenedianiline, is an aromatic diamine used in the plastics industry as curing agent for epoxy resins and urethane rubbers. Aromatic diamines are used as a monomer to form copolymers like nylons, polyesters and polyurethanes for characteristic properties. They can form a protein-like structure at both ends of each monomer. The chain length characteristics with recurring amide groups provide a variety physical properties and are further processed into various applications including plastics, oil-modified and moisture-area types of urethane coatings, polyamides for printing inks, dimer acids, textiles, lubricant additive as scale and corrosion inhibitor, epoxy curing agent, isocyanates, water treatment chemicals, biocides, and pharmaceutical intermediates.",
        "typical_properties": "White to light yellow granule, insoluble in water, slightly soluble in Acetonitrile, DMSO, Methanol.\nAppearance\nWhite to light yellow granule\nMelting point(ºC)\n98 min\nMoisture(%)\n0.3 max\nPurity(%)\n86 min\nBulk density(g/ml)\n1.44\nFree Aniline(%)\n1 max\n",
        "packing": "In 50kgs net fiber drum\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as ABS and PE masterbatch. It is a lubricant for molding, polishing and injection molding of hard and transparent PVC, PS, PA, POM, PC, etc. Generally, 0.3-5% can be added without affecting the thermal stability, surface appearance, color tone, transparency of the film, etc. of the plastic. It is also used as a lubricant for highly filled PP, as a surface brightener, anti-sticking agent and leveling agent in inks, paints and coatings; as a wire drawing lubricant in metal processing and powder metallurgy industries; as a dispersant and lubricant for ABS masterbatch and PE functional modified masterbatch, a lubricant for plastic sheets, and a defoamer in the papermaking industry.\n"
    },
    {
        "name": " N-(Oxidiethylene)-2-benzothiazolyl sulfenamide",
        "cas_no": "102-77-2",
        "cins_no": " 241-774-1",
        "molecular_formula": "C11H12N2OS2",
        "discription": "Rubber accelerator NOBS is a sulfonamide vulcanization accelerator, a delayed-acting high-speed vulcanization accelerator, which has a very slow initial vulcanization but excellent after-effect. It is a light yellow flake or granular solid with a bitter taste. It is insoluble in water and gasoline, soluble in benzene, and easily soluble in chloroform. It can be used as a vulcanization accelerator for most rubbers, but not for chloroprene rubber.\n",
        "typical_properties": "Light yellow granules, non-toxic, slight ammonia smell, melting point: above 78℃, specific gravity 1.34-1.40, soluble in benzene, acetone, chloroform, insoluble in water and dilute acid and alkali. Gradually decomposed when heated above 60℃.\nItem\n\nStandard\nAppearance\nLight yellow or orange granular\nInitial M.P. (℃ )\n80 min\nLoss on Drying(%)\n0.5 max\nAsh(%)\n0.3 max",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Provides fast cure rate and high modulus development in NR, SBR, BR and blends. Normally used alone or with small quantities of ultra Accelerators in tire compounds or industrial rubber products.\nIt is a post-effect vulcanization accelerator with low activity, large ductility, short vulcanization time, excellent anti-scorch performance, safe processing, easy dispersion, no blooming, slight discoloration, suitable for natural rubber and synthetic rubber. Mainly used in the manufacture of industrial rubber products such as tires, hoses, rubber shoes, and conveyor belts."
    },
    {
        "name": "1,3:2,4-bis-O-( 4-methylbenzylidene )-D-sorbitol ( MDBS )",
        "cas_no": "54686-97-4",
        "cins_no": "",
        "molecular_formula": "C22H26O6",
        "discription": "",
        "typical_properties": "",
        "packing": "10 kgs paper bag with pallet\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Secondary ( MDBS ) and Third ( DMDBS ) generation of sorbierite type of polyolefine Nucleating agent, dosage in polyolefine is about 0.25%. Moreover, also can be used in rubber, chemical fiber, textile, printing, coating, and pigment, etc.\n"
    },
    {
        "name": "1,3:2,4-bis-O-( 3,4-dimethylbenzylidene )-D-sorbitol ( DMDBS )",
        "cas_no": "135861-56-2",
        "cins_no": "",
        "molecular_formula": "C24H30O6",
        "discription": "",
        "typical_properties": "",
        "packing": "10 kgs paper bag with pallet\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Secondary ( MDBS ) and Third ( DMDBS ) generation of sorbierite type of polyolefine Nucleating agent, dosage in polyolefine is about 0.25%. Moreover, also can be used in rubber, chemical fiber, textile, printing, coating, and pigment, etc.\n"
    },
    {
        "name": "Oleamide",
        "cas_no": "301-02-0",
        "cins_no": "206-103-9",
        "molecular_formula": "C18H35NO",
        "discription": "Oleamide is an organic compound with the formula CH3(CH2)7CH=CH(CH2)7CONH2. It is the amide derived from the fatty acid oleic acid. It is a colorless waxy solid and occurs in nature. Sometimes labeled as a fatty acid primary amide (FAPA), it is biosynthesized from N-oleoylglycine\n",
        "typical_properties": "White powder or granules，insoluble in water, but has certain solubility in solvents such as alcohol, ester, ketone, benzene, etc. \nAmide content(%)\n98.5 min\nAcidity(mgKOH/g)\n0.2 max\nIodine value(gl2/100g)\n72-78\nColority(#)\n2 max\nMelting point(°C)\n77-85\nC22(%)\n90 min\nSize\n20 mesh/40-50 mesh/180-200 mesh",
        "packing": "In 25/20 kgs bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. it is the chemical additives which must been added to the low-density polyethylene (LDPE) film material.\n2. it is also the modifying agent of the plastic ink.\n3. it can also be used as the lubricants such as polypropylene (PP), polystyrene (GPPS), phenol (PF) resin, antistatic agents and anti-caking additives.  \n4.it can also be used as polyethylene, polypropylene, synthetic fibers and other color concentrates and cables (insulation) material lubricant and release agent.5.it can also be used as the additive for polypropylene (seal) tabletting, efficient heat sheet and sealed material.   6. metal protective agent; stabilizer of the melamine tableware products; lubricants, antifreeze additives of the brake; lubricants of the coatings and dispersion stabilizer of the aluminum coating as well as oil drilling auxiliaries."
    },
    {
        "name": "4-Tert-Butybenzoic acid",
        "cas_no": "98-73-7",
        "cins_no": " 202-696-3",
        "molecular_formula": "C11H14O2",
        "discription": "4-Tert-butylbenzoic acid is is an important organic synthesis intermediate, used in polypropylene nucleating agent, PVC heat stabilizer, additives for metal processing cutting and lubricating oil, antioxidants, alkyd resin modifiers, flux and dyes, etc. Among them, polyvinyl chloride is divided into soft and hard, and its stabilizers are divided into powder and liquid. PTBBA is mainly used for barium-zinc and calcium-zinc liquid stabilizers suitable for soft polyvinyl chloride, and can also be used for barium-cadmium-zinc stabilizers. The performance is far better than benzoic acid, with good thermal stability, transparency and weathering resistance, etc., suitable for advanced stabilizers (or polyvinyl chloride) and other products.\n",
        "typical_properties": "Colorless needle-shaped crystals or crystalline powder. Melting point 164-166℃, relative density 1.142 (20/4℃). Soluble in alcohol and benzene, insoluble in water. This product has moderate toxicity.\nAppearance\nWhite crystalline powder\nAssay(%)\n99 min\nAsh(%)\n0.01max\nMoisture(%)\n0.1 max\nAcidity(mg KOH/g)\n312.0-315.0\nMelting point(℃)\n164.0-166.0\nFe(ppm)\n3 max\nColor(Hazen)\n20 max",
        "packing": "In 25kgs/bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Used as an improver in the production of alkyd resins\n2. Used as a cutting oil and lubricant additive;\n3. Used as a polypropylene nucleating agent;\n4. Its barium salt, sodium salt, zinc salt, etc. can be used as a stabilizer for polyvinyl chloride;\n5. Used as a food preservative;\n6. A regulator for polyester polymerization, etc."
    },
    {
        "name": "Polyethylene Wax",
        "cas_no": " 9002-88-4",
        "cins_no": "618-339-3",
        "molecular_formula": "（C2H4）n",
        "discription": "Polyethylene Wax, also known as PE Wax, is an ultra low molecular weight polyethylene consisting of ethylene monomer chains. PE wax has a large variety of uses and applications. PE Wax is available from on-purpose production and as a byproduct of polyethylene production. This material is available in both HDPE and LDPE forms. As there are many grades and types available, please inquire so that one of our knowledgeable representatives can assist you in locating the correct grade that matches your requirements.",
        "typical_properties": "Polyethylene wax is a white granule, nontoxic, not dissolved in water and stable to acid, alkali and aqueous medium. At room temperature, insoluble in most common solvents such as ethanol, acetone, carbon tetrachloride, etc.\nTechnical index\n\nTest Method\nH110\nSoftening point(℃)\nASTM D3954\n110±5\nViscosity cps @149℃\nASTM D3236\n10-20\nDensity g/cm3 @25℃\nASTM D1505\n0.95\nPenetration (dmm)\nASTM D1321\n1-2\nGargner\nASTM D1544\n1\nAppearance\nFlake\nMolecular Weight\n3500-4000",
        "packing": "In 25 kgs bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Color Masterbatch, Filler Masterbatch，High-grade Masterbatch, Non-woven Fabric\n2. PVC Films, Pipes, Profiles, Sheets, PE/PVC WPC，Foamed Board, Cable Material\n3. PVC Stabilizer, Hot-melt Adhesive，Powder Coating, Road Marking Paint，Rubber Products and other products."
    },
    {
        "name": "Phenolic Resin 2402",
        "cas_no": " 115-77-5",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Phenolic resin 2402 is a 100% fat-soluble phenolic resin. It is used as a rubber vulcanizer for butyl rubber, natural rubber, styrene-butadiene rubber (SBR), silicone, and is particularly suitable for vulcanizing butyl rubber.Tertiary butyl phenol and methanal polycondensation under the action of alkaline medium, to get oily pure phenolic resin. Soluble in butyl,acetate, xylene, vegetable oil.Phenolic Resin 2402 is mainly used in adhesive foe bonding leather,rubber-to-rubber,or rubber-to-metal surfaces.It is ideally suited for this because it has very good binding qualities and has a particular tackiness for the surface of leather and rubber.\n",
        "typical_properties": "Appearance\nLight yellow to amber white transparent lumpish solid\nSoftening Point(R&B),℃\n85~120\nMethylol Content,%\n9~15\nLipid Solubility(1:2Tung oil,240℃）\nTotal Soluble\nFree Phenol,%,max\n1\nWater Content,%\n1\nAsh Content,wt.%,max\n0.3",
        "packing": "In 25kgs karft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. This product is a rubber vulcanizer for butyl rubber, natural rubber, styrene-butadiene rubber, silicone rubber, etc. It is especially used for the vulcanization of butyl rubber to improve the heat resistance of butyl rubber. It has excellent properties such as small deformation, good heat resistance, high tensile strength, and low elongation. It is used to manufacture heat-resistant butyl rubber products. The reference dosage is 5-10 parts. 2. In the production of chloroprene rubber adhesives, this resin is compatible with chloroprene rubber. The formulated chloroprene rubber adhesive can increase the heat resistance temperature of the adhesive and increase adhesion. 3. In the coating industry, it can be used to produce external magnetic paint, floor paint, ship paint, anti-rust paint, water-based ink and thin-layer anti-rust oil products. The nitro paint made by heating with drying oil has good gloss in the paint film, and has the characteristics of water resistance, weather resistance, UV resistance, chemical corrosion resistance and electrical insulation. 4. It can be used as a vulcanizer, reinforcing agent, and tackifier in the production of polyester insulating tape, oil pipe anticorrosive tape, etc. to improve product performance and life. This product also has broad development prospects in other industrial products. 2402 resin is especially effective when mixed with terpene resin."
    },
    {
        "name": "RED 48:2",
        "cas_no": "7023-61-2\n",
        "cins_no": "230-303-5",
        "molecular_formula": "C18H15ClN2O6S",
        "discription": "Pigment Red 48:2 is a red pigment with bright bluish shade. Its color shade is much bluer than Pigment Red 48:1 and Pigment Red 48:4. It has both transparent and semi-transparent type. PR48:2 can be used as standard color in the application of gravure printing ink. The main application is NC based package printing ink, as it will turn thick in water based ink. In soft PVC, it doesn’t have color penetrating. And its heat resistance in HDPE is 230℃/5min, and is often used in the coloring of LDPE. PR48:2 has better light fastness than PR48:1.\n",
        "typical_properties": "The color strength of Pigment Red 48:2 is high and its dispersibility is good. It has good heat resistance and good resistance in the system of aliphatic and aromatic hydrocarbons, but not good in acid and alkali resistance. PR48:2 is purple red in sulfuric acid and after diluted it will be blue red precipitation.Color Shade\nSimilar to the standard\nVolatile matter at 105℃\n3.0% max\nFluidity mm\n31-35\nResidue on 230 mesh sieve\n0.1% max\nWater soluble\n3.0% max\nOil absorption(ml/100g)\n50 max\npH\n6.5-7.5\nFiltering value bar\n2\nResistance to\nLight\n5\nHeat\n220℃\nWater\n4\nOil\n5\nAcid\n5\nAlkalis\n4\n",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Water based ink, Solvent based ink, Plastic, Paint, Textile printing.\n"
    },
    {
        "name": "RED 57:1",
        "cas_no": "5281-04-09",
        "cins_no": "226-109-5",
        "molecular_formula": "C18H16CaN2O6S",
        "discription": "Pigment Red 57:1, used in gravure solvent based ink, PA ink, CLPP ink, NC ink, TIN printing ink, toluene base ink, polyurethane PU ink, UV curing ink.\n",
        "typical_properties": "It's a calcium salt pigment with high transparent and gloss, low viscosity, bluish shade, good resistance to solvents.\nColor Shade\n\nSimilar to the standard\nVolatile matter at 105℃\n4.5% max\nFluidity mm\n43-47\nResidue on 230 mesh sieve\n0.1% max\nWater soluble\n3.0% max\nOil absorption(ml/100g)\n60 max\npH\n6.5-7.5\nFiltering value bar\n2\nResistance to\nLight\n5\nHeat\n180℃\nWater\n5\nOil\n4\nAcid\n4\nAlkalis\n4",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Recommended for gravure solvent based inks, PA inks, CLPP inks, NC inks, TIN printing inks, toluene base inks, polyurethane inks, UV curing inks.\n"
    },
    {
        "name": "Polyethylene Wax (PE WAX)",
        "cas_no": "",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "",
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Applications:\n1. Color master batch.\n2. It is lubricant for processing\nPVC pipe processing\nwhich improving the plastic’s hardness, surface smoothing, and high plasticizing degree.\n3.\nIt can be used for dispersant of\nprinting ink and oil paint\nto make the presswork glossy and tridimensional.\n4.\nHolt-melt adhesive.\n5.\nMany\nPlastic industries\n6. Wood plastic composition (WPC)\n7. Our engineer designed new products\nfor Road paint\n8. Rubber industry"
    },
    {
        "name": "Polyvinyl Alcohol",
        "cas_no": "9002-89-5",
        "cins_no": " 209-183-3",
        "molecular_formula": "C2H4O",
        "discription": "Polyvinyl alcohol (PVOH, PVA, or PVAl) is a water-soluble synthetic polymer. It has the idealized formula [CH2CH(OH)]n, with properties between those of plastics and rubber. It is used in papermaking, textile warp sizing, as a thickener and emulsion stabilizer in polyvinyl acetate (PVAc) adhesive formulations, in a variety of coatings, and 3D printing. It is colourless (white) and odorless. It is commonly supplied as beads or as solutions in water.Without an externally added crosslinking agent, PVA solution can be gelled through repeated freezing-thawing, yielding highly strong, ultrapure, biocompatible hydrogels which have been used for a variety of applications such as vascular stents, cartilages, contact lenses, etc.\n",
        "typical_properties": "White flake, flocculent or powdery solid, odorless. Soluble in water (above 95°C), slightly soluble in dimethyl sulfoxide, insoluble in gasoline, kerosene, vegetable oil, benzene, toluene, ethylene dichloride, carbon tetrachloride, acetone, ethyl acetate, methanol, ethylene glycol, etc.\n \nAppearance\nWhite granular\nPurity(%)\n93.5 min\nViscosity ( mpa.s )\n44.0-56.0\nAlcoholysis Degree [%(mol/mol)]\n86.0 - 89.0\nMoisture(%)\n5.0 max\nAsh(%)\n0.5 max\nPH Value\n5.0-7.0",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Poly Vinyl Alcohol is a tough, whitish polymer that can be formed into strong films, tubes, and fibers that are highly resistant to hydrocarbon solvents. Mainly used in the textile industry, as the raw materials of warp pulp, Fabric finishing agent, Vinylon Fiber; Interior and exterior wall paint of the building, adhesives; Chemical industry use it as a polymerization emulsifier, Dispersant and polyvinyl formal, Acetal, Butyrate Aldehyde Resin; Paper industry use it as a paper binder; Agriculture use it as soil improvers, pesticide adhesion synergist and polyvinyl alcohol film; It can also be used for daily cosmetics and high-frequency quenching agent and so on.\n"
    },
    {
        "name": "Cyclohexylthiophthalimide (Antiscorching agent CTP ( PVI ))",
        "cas_no": " 17796-82-6",
        "cins_no": " 241-774-1",
        "molecular_formula": "C14H15NO2S",
        "discription": "PVI or CTP also known as N-(Cyclohexylthio)phthalimide used as ant scorching agent, is an flame retardant for NR and synthetic diene rubbers. PVI is a pre-vulcanization inhibitor which enables processing safety to be controlled in a predictable manner in sulphur curable compounds.\n",
        "typical_properties": "White or light yellow crystals, easily soluble in benzene, ether, acetone and ethyl acetate, soluble in warm n-heptane and carbon tetrachloride. Slightly soluble in gasoline, insoluble in kerosene and water.\n Item\nPowder\n\nOil-filled powder\nGranule\nAppearance   \nWhite crystals\nInitial.M.P. ℃≥\n90.0-94.0\n89.0-94.0\n88.0-94.0\nLoss on Drying %≤\n0.30\n0.30\n0.30\nAsh %≤\n0.10\n0.10\n0.10\nToluene Insoluble %≤\n0.50\n0.50\n0.50\nResidues (150μm) %≤\n1.00\n1.00\n--\nResidues (63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-1.5\n--\nHardness   N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Hexamethoxy methyl melamine",
        "cas_no": "3089-11-0",
        "cins_no": " 221-422-3",
        "molecular_formula": "C15H30N6O6",
        "discription": "The chemical name of Rubber adhesive A is hexamethoxymethylmelamine. It is a methylene donor in the direct bonding system between rubber and skeleton materials and is soluble in water and general organic solutions. Rubber adhesive A is a direct bonding agent for inter-, inter-, and inter -platinum bonding systems. It is a formaldehyde donor with excellent performance and is a similar product to the adhesive A of Bayer Company in Germany. The main compone啊？nt is methoxymethyl melamine, which is used in combination with formaldehyde acceptor adhesives RS, RH, RE, etc. It is suitable for bonding various rubbers with various skeleton materials.",
        "typical_properties": "Water-white viscous liquid or waxy solid, easily soluble in water, alcohol, ester, with formaldehyde odor.\nAppearance\nColorless transparent liquid or waxy solid\nFree formaldehyde content, %\n5.0 max\nCombined formaldehyde content, %\n40.0 min\nDensity, g/cm3\n1.18—1.21",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Rubber adhesive A reacts with methylene acceptors at vulcanization temperature to bond rubber and skeleton materials. For example, it reacts with resorcinol formaldehyde resin GLR-20, adhesive RE, adhesive RS, etc. to form thermosetting resin. If the reaction occurs before vulcanization, the bonding effect of the system will be lost. Usually, the rubber, filler and methylene acceptor are prepared at a higher temperature; then, adhesive A and other compounding agents are added during the final mixing of the late rubber mixing.\n2. The recommended ratio is 1.5-3 parts of rubber adhesive A and 2-5 parts of GLR-20 resin or other methylene acceptors."
    },
    {
        "name": "Hexamethoxy methyl melamine",
        "cas_no": " 3089-11-0",
        "cins_no": "221-422-3",
        "molecular_formula": "C15H30N6O6",
        "discription": "Rubber adhesive RA is the improved product of Rubber Adhesive A. The appearance of this product is one kind of white powder and gives off methanal upon heating. It is hypo-methanal donator among double functioning adhesive system for rubber.\n",
        "typical_properties": "White flowing powder, no flying, easy to disperse; stable in storage. Easy to absorb moisture, release formaldehyde when heated, a good methylene donor. A composite adhesive system with dual functions of filler and adhesive.\nAnalysis Items\nSpecification\nAppearance\nwhite powder\nAsh%\n30-38\nMoisture%   \n≤4.5\nResidue on sieve %\n≤0.3\nFree formaldehyde content %\n≤0.1",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Rubber Adhesive RA reacts with methylene acceptors to produce adhesion, such as adhesive RF resin, adhesive RE, adhesive RS, etc. The reaction will occur quickly at the vulcanization temperature. If the reaction occurs before vulcanization, the bonding effect of the compounding system will be lost. When the temperature is below 90°C, the adhesive RA and the methylene acceptor are mixed together in a dispersed state. Be very careful at this time. In short, it should be dispersed very evenly in the system. Usually, the rubber, filler and methylene acceptor are prepared at a higher temperature, and then the adhesive RA and other compounding ingredients are added at about 90°C.\nThe recommended ratio is 2.5-5phr of adhesive RA and 2-5phr of RF resin or other methylene acceptors."
    },
    {
        "name": "SBS rubber 791",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "SBS is styrene -butadiene block copolymer in the form of whiteporous particle or powder, with advantages of elasticity of rubber and workability of plastics, also with good low-temperature resistance, good air permeability and wet skid resistance. It can be widely applied to the materials of shoe sole, plastic modification, binding agent and asphalt modification.\n",
        "typical_properties": "rand\nS/B ratio\nOil\ncontent\n(%)\nVoliatility\n(≤%)\nTotal\nash   (≤%)\nStress at 300%\n(≥MPa)\nTensile strenth\n(≥MPa)\nElongation\n(≥%)\nPemanent deformation\n(≤%)\nHardness\n(A）\nMelt flow rate (g/10min)\nStructure   \nSBS791\n30/70\n0\n0.7\n0.20\n2.0\n15.0\n700\n40\n≥68\n0.10∽5.00\nPorous round bar or wafer form small particles\n",
        "packing": "In 20kgs net weight in PP woven or PE plastic bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1.Adhesive industry:\nIt can produce all types of adhesives, especially hot-melt pressure-sensitive, pressure-sensitive, solvent-based adhesive, with strong adhesion, non-toxic, no environmental pollution and so on.\n2. Coating ink:\nSBS, the production of paint, ink in some areas have better performance, such as coating surface elasticity, coating low temperature performance, the rubber substrate better adhesion, but also can The production of low temperature transparent oil."
    },
    {
        "name": " Sebacic acid",
        "cas_no": "111-20-6",
        "cins_no": " 203-845-5",
        "molecular_formula": "C10H18O4",
        "discription": "Sebacic acid is an aliphatic dibasic acid and is found in flue-cured tobacco leaves, burley tobacco leaves, and oriental tobacco leaves.Sebacic Acid and its derivatives such as Azelaic Acid have a variety of industrial uses as plasticizers, lubricants, hydraulic fluids, cosmetics, candles, etc. It is used in the synthesis of polyamide and alkyd resins. It is also used as an intermediate for aromatics, antiseptics and painting materials.\n",
        "typical_properties": "White powder or granules, slightly soluble in water, poorly soluble in benzene, petroleum ether, carbon tetrachloride, and easily soluble in ethanol and ether.\nAppearance\nWhite powder, granules\nSebacic acid(%)\n99.5 min\nAsh(%)\n0.02 max\nMoisture(%)\n0.15 max\nMelting point(°C)\n131 - 134.5",
        "packing": "In 25 kg, 500 kg, 1,000 kg in bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used to prepare esters of sebacic acid, and its esters are widely used, such as dibutyl sebacate, dioctyl sebacate, and diisooctyl sebacate. These esters can be used as plasticizers for plastics and cold-resistant rubbers, and can also be used to make polyamides, polyurethanes, alkyd resins, synthetic lubricants, lubricant additives, as well as fragrances, coatings, cosmetics, etc. It can also be used as a raw material for the production of nylon 1010, nylon 910, nylon 810, nylon 610, nylon 9, and a raw material for high-temperature resistant lubricant diethylhexyl ester. It is also a raw material for the production of alkyd resins (used as surface coatings, plasticized nitrocellulose coatings, and urea resin varnishes) and plasticizers, softeners, and solvents for polyurethane rubber, cellulose resins, vinyl resins, and synthetic rubbers.\n"
    },
    {
        "name": "Chloroprene Rubber SN232",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Chloroprene rubber SN232 is a general purpose, it is obtained by mercaptan modified and choroprene monomer by emulsion polymerization with medium rate of crystallization, for using a Nairit recipe and process technology. It can be seen as an equivalent to Dupont W of the Unite States.\nSN232, which   has good   properties of physical   mechanics   and   plastication, compared with   CR232,   is   superior   in   processability,   can   be   mixed   without mastication, the surface of sheet is flat and smooth and non-stick to the mill rolls, is used in the form   of a blend with many type of chloroprene rubber, has very   lower    compression   set   and   excellent    elasticity,   has    the   same processability   as   Dupont   W   of   the   Unite   State.   It   exhibits   resistant   to   oil, chemical, sunlight, abrasion, as well as extension of the fine is not flammable and better storage stability, is widely used in general rubber products.",
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Chloroprene Rubber SN242",
        "cas_no": "9010-98-4",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "SN-242 is a mercaptan modified chloroprene rubber with excellent adhesive strength and produced using a Nairit recipe\nand process technology. SN-242 has a high crystallization rate and can be seen as an equivalent to the AD-20 grade\nfrom DuPont.\nSN-242 grade polychloroprene has a fast rate of crystallization, stronger cohesion, and good storage stability. Of the SN-24 series,this grade has a medium viscosity and has a much better solubility and uniformity than CR-244. SN-242 can be dissolved in tolueneor mixed solvents. Preparing adhesive cements by SN-242 is light in color and high bonding strength, quick good grips, easy handling,the adhesion layer to keep a long time. It exhibits the good resistant to ozone, weather, oil, chemical corrosion and fire. SN-242 canbe divided into SN-242A and SN-242B; SN-242A is closer to A-90 and can be used as applicable grade of preparing grafted adhesive;SN242B is closer to AD-20, mainly preparing decoration adhesive and so on.",
        "typical_properties": "Item\nStandard\nBroodfield solution viscosity(MPa.s,5% toluene solution at 25℃）\nSN242A\nSN242B\n34~40\n41~52\nMass fraction of volatiles,wt.% ≤\n1.3\nMass fraction of ash,wt.% ≤\n1.0",
        "packing": "In 25kg kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "SN242,which is a basic raw material of preparing adhesive cements,can be used alone or combination with other types,is the most typical grade of preparing adhesive.Adhesive is suitable for bonding of the shoe industry,rubber leather,wood,metal and construction materials.\n"
    },
    {
        "name": "Oil Red BR (Solvent Red 24)",
        "cas_no": "85-83-6",
        "cins_no": "201-635-8",
        "molecular_formula": "C24H20N4O",
        "discription": "Solvent Red 24 which is also known as Oil Red 2B, Oil Red BR, Scarlet Red, Oil Scarlet, is one of the most demanded products from our solvent dyes product list. Solvent Red 24 (Oil Red 24) has various applications including coloring for grease, liquid medicine soap, wax, rubber toys, plastics, PS, HIPS, ABS, RPVC,PMMA, SAN, printing inks, transparent paints.\n",
        "typical_properties": "The product is bluish transparent scarlet oil solvent dye. It is of good heat resistance, good light fastness and strong coloring power.\nSpecification\nValue\nAppearance\nBluish red powder\nDensity, g/cm3\n0.33\nMelting Point, °C\n180\nLight Fastness in PS\n5-6\nHeat Resistance in PS, °C\n250\nDegree of Pigmentation\n0.05% dyes + 0.1% TiO2\nSolubility at 20°C\nAcetone\n20.2\nButyl Acetate\n21.7\nMethylbenzene\n37.3\nDichloromethane\n32.8\nEthyl Alcohol\n21.1\nRecommended Dosage\nTransparent\n0.025\nNon-transparent\n0.10",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Mainly used in coloring of grease, liquid medicine,soap, wax, rubber toys, plastics, printing ink and transparent paint etc.\n"
    },
    {
        "name": "Transparent Red GS (Solvent Red 111)",
        "cas_no": "82-38-2",
        "cins_no": " 201-417-2",
        "molecular_formula": "C15H11NO2",
        "discription": "Solvent Red 111, disperse Red 9, also called C.I. 60505 and 1 methylamino anthraquinone, is a red dye derived from anthraquinone, is used in coloring for fiber, plastic, PS, HIPS, ABS, PC, RPVC, PMMA, SAN, AS, PA6, PET, paint, ball pen ink, signaling smoke, firework and in the pyrotechnics industries.",
        "typical_properties": "Red oil solvent dye with yellow light. It is of good heat resistance, light fastness and its color is bright.\nSpecification\nValue\nAppearance\nRed powder\nDensity, g/cm3\n0.36\nMelting Point, °C\n169\nSublimation Point, °C\n219\nGPPS\nLight Fastness\n7\nHeat Resistance\n300°C, 10min.\nHIPS\nLight Fastness\n5-6\nHeat Resistance\n280°C, 10min.\nAS\nLight Fastness\n3-4\nHeat Resistance\n280°C, 10min.\nPMMA\nLight Fastness\n7\nHeat Resistance\n300°C, 10min.\nPBT\nLight Fastness\n3-4\nHeat Resistance\n300°C, 3min.\nPC\nLight Fastness\n6-7\nHeat Resistance\n300°C, 10min.\nRPVC\nLight Fastness\n7\nHeat Resistance\n300°C, 20min.\nPET\nLight Fastness\n7\nHeat Resistance\n280°C, 10min.\nPA\nLight Fastness\n3-4\nHeat Resistance\n280°C, 10min.",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Can be used in coloring of resin and fibre.\n"
    },
    {
        "name": "Stearic acid",
        "cas_no": "57-11-4",
        "cins_no": "266-928-5",
        "molecular_formula": "C18H36O2",
        "discription": "Stearic acid, another name for octadecanoic acid CH3(CH2)16COOH, is one of the most common fatty acids. It exists as a glycerol ester in most animal and plant fats (Beare-Rogers, Dieffenbacher, & Holm, 2001). It is an ingredient found in skin care products for protection against dryness or irritation.\n",
        "typical_properties": "A waxy solid that is insoluble in water, with the chemical formula C18H36O2. It is soluble in ethanol and acetone, and easily soluble in solvents such as ether, chloroform, carbon tetrachloride, benzene and carbon disulfide.\nIterm\nIndex\nSA1845 Type\nIodine Value，g/100g\n5.0\nSaponification Value ，mg/g\n199 ~ 217\nAcid Value，mg/g\n198 ~ 216\nColor (Hazen)\n400\nFreezing Point℃\n>52\nMoisture%\n0.30\nInorganic   Acid%\n0.001",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is widely used for cosmetics, plastic cold resistant plasticizer, release agent, stabilizer, surfactant, rubber vulcanization accelerator, waterproofing agent, polishing agent, metal soap, metal mineral flotation agent, softener, pharmaceuticals and other organic chemicals.\nIn addition, also can be used as oil soluble pigment solvent, crayons, paper lighting agent transfer slip agent, stearic acid glyceride emulsifier etc..\nThe products in the food industry as a lubricant, defoaming agent and food additive monostearate, stearic acid, sorbitan esters, sucrose ester as raw material. Used as auxiliary raw materials and chemical products for daily use of raw materials.\nStearic acid is widely used in the manufacture of PVC plastic pipe, sheet, profiles, thin films. PVC heat stabilizer, with lubrication and good optical, thermal stability."
    },
    {
        "name": "N-tert-Butyl-2-benzothiazolesulfenamide (Rubber Antioxidant\nTBBS)",
        "cas_no": " 95-31-8",
        "cins_no": " 202-409-1",
        "molecular_formula": "C11H14N2S2",
        "discription": "TBBS is a post-curing vulcanization accelerator with short vulcanization time, excellent anti-scorch performance and safe processing. It's an excellent delayed accelerator. Widely used in NR, IR, SBR, NBR and EPDM. Can be used alone or with those vulcanization accelerators such as thiurams, guanidines and dithiocarbamates to improve the activity. Mainly used in manufacture of tires, shoes and belts. Non-blooming. It's widely used in the processing of various rubber products and tires, especially radial tires. It has the advantages of post-curing and high speed.\n",
        "typical_properties": "Soluble in benzene, acetone, methyl alcohol; insoluble in water，acid,alkali.\nItem\nPowder\n\nOil-filled powder\nGranule\nAppearance  \nWhite to grayish\nInitial.M.P. ℃≥\n105.0\n104.0\n104.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.40\n0.40\n0.40\nInsoluble Methanol%≤\n0.50\n0.50\n0.50\nFree Amine %≤\n0.40\n0.40\n0.40\nResidues (150μm) %≤\n0.10\n0.10\n--\nResidues (63μm) % ≤\n0.50\n0.50\n--\nOil Content %\n--\n1.0-2.0\n--\nHardness   N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Accelerator TBBS is used as a post-effective accelerator for natural rubber, butadiene rubber, isoprene rubber, styrene-butadiene rubber, and recycled rubber of natural rubber. It is mainly used in the production of rubber products such as tires, rubber shoes, rubber hoses, tapes, cables, etc.\n"
    },
    {
        "name": "Teprene phenolic resin 803L",
        "cas_no": " 9003-74-1",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Terpene phenolic resin 803L is derived from rosin, resin from pine trees. Used as tackifier, It is applicable to various kinds of graft-modified neoprene, Neoprene, SBR rubber and other solvent adhesives. It is especially suitable for the bonding of PVC artificial leather and various shoe sole adhesives. It's can be applied to coatings, inks, printed circuits, plastic modification, rubber products, etc.\n",
        "typical_properties": "Good compatability with chloroprene. High softening pAppearance\nPale yellow flake\nColor Gardner\n7 max\nAcid Value(MgKOH/g)\n45~60\nSoftening Point(℃)\n145~160oint & high thermal stability. Can be react with metal oxide. Good Initial tacky & long Opening time. Light color & good transparency.\n",
        "packing": "In 25Kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "1. Adhesive\n1) hot melt adhesive: EVA hot melt adhesive, hot melt adhesive, wood adhesive, hot melt adhesive bookbinding bags etc.\n2) pressure sensitive adhesives: medical pressure sensitive adhesive, hot melt\npressure sensitive adhesive, sanitary products, pressure sensitive adhesive, medical adhesive tape, pressure sensitive adhesive, etc.\n3) Acrylate adhesive materials: acrylic resin adhesive, resin type adhesive, thermoplastic resin adhesive, etc.\n4) adhesive adhesive: coated glue, glue paste box, stickers, slow dry glue;\n5) glue adhesive: repair adhesive, sealant, sealant, shoe glue etc.;\n6) other adhesives: high temperature adhesive tape, warning tape, electronic tape, special adhesive, etc.\n2. Rubber adhesives, rubber resin adhesive, rubber tire repair agent, neoprene adhesive etc.\n3. Plastic materials: plastic products, plastic pipe, special plastic, PET plastic, etc.\n4. Industrial coatings: resin coatings, architectural coatings, decorative paint, wall paint, etc.\n5. Oily ink: Carton ink, paper with ink, resin type ink, etc.\n6. Other fine chemicals: cutting fluid, punching oil, wire cutting fluid, photosensitive resin materials, etc."
    },
    {
        "name": "     Polymerized 2,2,4-trimethyl-1,2-dihydroquinoline (Rubber Antioxidant\nTMQ)",
        "cas_no": "  26780-96-1",
        "cins_no": "500-051-3",
        "molecular_formula": "C12H15N",
        "discription": "TMQ is a very important category rubber antioxidant. It has a good protective effect for heat, oxygen and fatigue aging, and stronger inhibitory effect for metal catalytic oxidation, no spray cream phenomenon, widely used in the manufacture of tyres, motorcycles births, bicycles births, rubber, plastic, adhesive tape, wires, cables and other rubber products.\n",
        "typical_properties": "This product is brown piece of amber, Density:1.05g/cm 3 . Soluble in benzene, chloroform, carbon disulfide and acetone, but not soluble in water. Fine solution with rubber. This product is combustible, when storing and transporting, always pay attention to fireproof and dampproof.\n Item\nFlake\nGranule\nAppearance\nAmber to brown\nSoften point ℃\n80-100\n85-95\nLoss on drying %≤\n0.30\n0.30\nAsh %≤\n0.30\n0.30",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "TMQ is widely used in various tires, hoses, tapes, rubber shoes, rubber tape products and other general industrial rubber products. It can also be used in latex products.\n"
    },
    {
        "name": " Tetramethyl thiuram monosulfide (Rubber Accelerator\nTMTD)",
        "cas_no": " 137-26-8",
        "cins_no": "  231-835-0",
        "molecular_formula": "C6H12N2S4",
        "discription": "Rubber accelerator TMTM(TS) is a non-discoloring and non -polluting super accelerator, mainly used for natural rubber and synthetic rubber. It is a non-discoloring and nonpolluting super accelerator, mainly used for natural rubber and synthetic rubber.\n",
        "typical_properties": "White or off-white powder, specific gravity 1.29, soluble in benzene, acetone, chloroform, carbon disulfide, insoluble in water or gasoline.\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nWhite or Light Grey\nInitial M.P. ℃≥\n142.0\n142.0\n142.0\nLoss on drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.30\n0.30\n0.30\nResidues(150μm) %≤\n0.10\n0.10\n--\nOil content %\n--\n1.0-2.0\n--\nHardness N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is used as a vulcanization accelerator in the rubber industry, suitable for natural rubber and synthetic rubber. Mainly used in the manufacture of tires, inner tubes, rubber shoes, cables and other rubber industrial products. It is used as a fungicide and insecticide in agriculture, and can also be used as a lubricant additive.\n"
    },
    {
        "name": " Tetramethyl thiuram monosulfide (Rubber Accelerator\nTMTM)",
        "cas_no": " 97-74-5\n",
        "cins_no": "231-835-0",
        "molecular_formula": "C6H12N2S3",
        "discription": "Rubber accelerator TMTM(TS) is a non-discoloring and non -polluting super accelerator, mainly used for natural rubber and synthetic rubber. It is a non-discoloring and nonpolluting super accelerator, mainly used for natural rubber and synthetic rubber.\n",
        "typical_properties": "White or light yellow powder, soluble in 1% sodium hydroxide, carbon disulfide, benzene, chloroform, insoluble in gasoline.\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nLight Yellow\nInitial M.P. ℃≥\n104.0\n104.0\n104.0\nLoss on drying %≤\n0.40\n0.40\n0.40\nAsh %≤\n0.30\n0.30\n0.30\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) %≤\n0.50\n0.50\n--\nOil content %\n--\n1.0-2.0\n--\nHardness   N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Mainly used in the manufacture of cables, tires, hoses, tapes, brightly colored and transparent products, shoes, heat-resistant products, etc. Used as an ultra-accelerator for natural and synthetic rubbers, especially for butyl rubber, EPDM rubber and latex. Non-toxic and odorless, suitable for white or bright-colored products and transparent products.\n"
    },
    {
        "name": " Ultramarine Blue 462 ",
        "cas_no": " 57455-37-5",
        "cins_no": " 309-928-3",
        "molecular_formula": "Al6Na8O24S3Si6",
        "discription": "Ultramarine 462 is a moderate tinting strength, very red shade Ultramarine blue. It is heat fast,\nlightfast, very easy to disperse and approved worldwide for use in sensitive applications such as food\ncontact plastics and cosmetics.\nWhile not as strong or bright as other grades in the R.S. Pigments range, Ultramarine 462 can offer a\ncost effective solution where only limited technical properties are required.\nUltramarine 462 is intended as a general purpose pigment with applications in paint, ink, soap,\ncosmetics and many other industries. Ultramarine 462 can be used in plastics.",
        "typical_properties": "Ultramarine Blue 462 is Synthetic Inorganic. It is a blue pigment of sodium aluminosilicate containing sulphur. It is prepared by heating kaolin, sodium carbonate, sulphur and other inexpensive ingredients together. It is heat and alkali resistant.\nSpecification        Value\nAppearance        Blue powder\nShade        Reddish\nMoisture(%)        1.0 max\nResidue(at 325mesh(%)        0.5 max\nTinting Strength(%)        95-105\nWater soluble salt(%)        1.0 max\nDissociative sulphur(%)        0.3 max\n",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Ultramarine blue 462 can be used in colorant for machinery and toy enamels, white baking enamels, printing inks, rubber products, soaps and laundry blues, cosmetics, textile printing.\n"
    },
    {
        "name": "2-(2-Hydroxy-3-tert-5-methylphenyl)-5-chlorobenzotriazole)\n(Ultraviolet absorber UV-326)",
        "cas_no": "3896-11-5",
        "cins_no": "223-445-4",
        "molecular_formula": "C17H18ClN3O",
        "discription": "UV-326 is a benzotriazole type UV absorber. It has a high absorption in the wavelengthof 290~400nm. It is also\nefficient for the light stabilization of polyvinyl chloride, unsaturatedpolyurethane, polystyrene, polycarbonate,\ncoatings and lacquers.",
        "typical_properties": "Light yellow crystalline powder, density 1.32g/cm3, melting point 137~141 ℃, boiling point 460.4 ℃, flash point 232.3 ℃.\nAppearance\nWhite with light yellow powder\nAssay (%)\n99.0 min\nMelting point(℃)\n138.0 min\nVolatile matter (%)\n0.5 max\nAsh content (%)\n\n0.05 max\nLight transmittance\n460 (nm) (%): 97.0 min\n500 (nm) (%): 98.0 min.",
        "packing": "In 20kg paper drum with inner plastic bag.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "UV-326 is a strong ultraviolet light absorber for use in polyolefins, polyester resins and coating.\nIt is also suitable for use in unsaturated polyester coatings, cured with cobalt-catalyst, without\nany discoloration."
    },
    {
        "name": " 2-hydroxy-4-(octyloxy) (Ultraviolet absorber UV-531)",
        "cas_no": "1843-05-06",
        "cins_no": " 217-421-2",
        "molecular_formula": "C21H26O3",
        "discription": "Ultraviolet light absorber UV-531 is an efficient antioxidant with excellent performance. It has features such as light color, non-toxic, good compatibility, small mobility, and etc. It is widely used in PE, PVC, PP, PS, PC, organic glass, polypropylene fiber, vinyl acetate and other fields. Moreover, it can provide dry phenolic and alkyd varnishes, polyurethane, acrylic, epoxy and oher drying products, powder coating, polyurethane, rubber products with favorable light stability. Additive amount is 0.1%-0.5 percent.\n",
        "typical_properties": "Brown to dark brown granule, softening point 75~135℃. Glass transition temperature 56℃. It looks like rosin, soluble in chlorinated hydrocarbons, esters, ketones, ethers, hydrocarbons, most resin oils, nitrobenzene, aniline and other organic solvents, insoluble in water and lower alcohols. \nAppearance\nLight yellow acicular crystalline powder\nContent\n≥99%\nMelting point(℃)\n47-49\nAsh content\n≤0.1%\nLight transmittance\n\n450nm:≥90%\n500nm:≥95%\nSolubility (25℃)(g/100g solvent)\nAcetone: 74 benzene:72 methyl alcohol: 2 ethyl alcohol (95%):2.6 n-heptane:40 n-hexane:40.1",
        "packing": "In paper box lined with plastic bag, net weight 25kg /box, designed according to customer requirements.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Ultraviolet absorberUV-531is a high performance and efficient anti-aging additives,can absorb240-340nmUV light,has alight color,non-toxic,good compatibility and migration of small,easy processing characteristics.Its polymers have the greatest protective effect, and helps to reduce color,while delaying yellowing and block loss of physical properties.UV-531is widely used in PE,PVC, PP,PS,and the PC,Plexiglas, polypropylene fiber and ethylene vinyl acetate,dry phenolic and alkyd varnish, polyurethane, acrylic,epoxy and other air drying products and automotive refinish paint, powder coating, polyurethane,rubber products, providing them with a good light stability.\n"
    },
    {
        "name": " 2-(2'-Hydroxy-5'-methyl phenyl) benzotriazole (UV Absorber UV-P  )",
        "cas_no": " 2440-22-4",
        "cins_no": " 219-470-5",
        "molecular_formula": "C13H11N3O",
        "discription": "UV-P is a benzotriazole type ultraviolet light absorber (UVA), imparting good light stability for plastics and other organic polymers. UV-P protects polymers as well as organic pigments from UV radiation helping to preserve the original appearance and physical integrity of engineered plastics, elastomers, PVC, adhesives, and polyurethanes during outdoor weathering.\n",
        "typical_properties": "UV light absorbers is light yellow powder. UV light absorbers can be dissolved in organic solvents such as acetone,styrene, benzene and toluene while never be dissolved in water.  \nAppearance\nLight Yellow Powder\nHPLC %\n99.0min\nMelting Point\n128-133℃\nAsh content\n0.1%max\nLoss on Drying\n\n0.5%max\nTransmittance\n440nm   95.0%min\n500nm   97.0%min",
        "packing": "In paper box lined with plastic bag, net weight 25kg /box, designed according to customer requirements.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "This product is a high efficient uv absorber, which can effectively absorb 290-400 nm uv light. it is mainly used for PVC, and polypropylene, unsaturated resin, polycarbonate, polymethyl methacrylate, PE, ABS resin, epoxy resin, fiber resin, etc.This product almost do not absorb visible light, especially suitable for colorless, transparent and colour products, general dosage is 0.1 to 0.5% in thin products, 0.05 to 0.2% in thick products.This product allows for plastic products that come in direct contact with food.\n"
    },
    {
        "name": " Zinc dibutyl dithiocarbamate (Rubber accelerator\nZDBC（BZ))",
        "cas_no": " 136-23-2\n",
        "cins_no": " 205-232-8",
        "molecular_formula": "C18H36N2S4Zn",
        "discription": "Accelerator BZ, referred to as ZDBC, is used as a vulcanization accelerator for natural rubber, styrene-butadiene rubber, isoprene rubber and its emulsifier.Used as a vulcanization accelerator for natural rubber, styrene-butadiene rubber, isoprene rubber and its emulsifier. The vulcanization accelerating effect is similar to that of PZ and EZ, but the scorching property is small. For latex, it has a stronger vulcanization accelerating effect than PZ/EZ and can be vulcanized at room temperature. Its performance in dry rubber and latex is similar to that of accelerator ZDC, but it is more active. When used in dry rubber, it is generally used as a co-accelerator and is an active accelerator of thiazole. It is also used as a non-polluting stabilizer for adhesives and putties. It has an anti-aging effect in mixed rubber and can improve the aging resistance of vulcanized rubber.\n",
        "typical_properties": "White powder (granule). The density is 1.24. Soluble in CS2. benzene, chloroform, alcohol, diethyl ether, insoluble in water and low concentration alkali. Good storge stability.\nItem\nPowder\nGranule\nAppearance\nWhite powder(granule)\nInitial M.P. °C\n104.0\n103.0\nLoss on drying(%)\n0.40\n0.40\nZinc content (%)\n13.0-15.0\n13.0-15.0\nResidues on 150µm(%)\n0.10 max\n-\nResidues on 63µm(%)\n0.50 max\n-\nGranule Diameter, mm\n-\n1.5-2.5",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as an acid accelerator currently and a medium fast primary accelerator. Imparts excellent aging properties when used bothalone and in combination with DM, TMTD and many other basic accelerators for higher activity. Its accelerative temperature\nlow and easily be dispersed with lower pollution. Mainly used in the manufacture of tires, tubes, foot wear, rubber belts and hoses etc. To achieve a faster cure and a higher modulus. MBT can be boosted by the use of secondary accelerators, such as ZBEC, ZDEC, TMTD or DPG. For the vulcanization of EPDM or IIR rubbers, MBT is a well established component of many existing vulcanization systems. MBT also finds Recommended Applications\nin latex form cure systems."
    },
    {
        "name": " Zinc diethyldithiocarbamate (Rubber Accelerator\nZDEC(EZ))",
        "cas_no": "14324-55-1",
        "cins_no": "231-835-0",
        "molecular_formula": "C10H20N2S4Zn",
        "discription": "Rubber accelerator ZDEC(EZ) is used as a super accelerator for natural rubber and various synthetic rubbers. It is a representative variety of zinc dithiocarbamate accelerators and a general accelerator for latex. This product is a good activator for thiazole and sulfonamide accelerators. It is also used as a non-water-soluble accelerator for latex and has little effect on the stability of latex. This product is non-polluting, non-discoloring, odorless, tasteless, non-toxic, and suitable for white and bright-colored products, transparent products, mainly used in the manufacture of medical products, adhesive tapes and self-vulcanized products, etc. It is 0.5-1 part in dry latex.\n",
        "typical_properties": "White powder (granules); density 1.41; soluble in 1% sodium hydroxide, carbon disulfide, benzene, chloroform, slightly soluble in alcohol, insoluble in gasoline.\nItem\nPowder\nOil-filled Powder\nGranule\nAppearance\nWhite\nInitial.M.P. ℃≥\n174.0\n173.0\n173.0\nLoss on Drying %≤\n0.40\n0.40\n0.40\nZinc Content %≤\n17.0-19.0\n17.0-19.0\n17.0-19.0\nResidues(150μm) %≤\n0.10\n0.10\n--\nResidues(63μm) %≤\n0.50\n0.50\n--\nOil Content%\n--\n1.0-2.0\n--\nHardness   N\n--\n--\n1-4",
        "packing": "In 25 kgs plastic woven bag with plastic film bag; Kraft paper bag with PE bag inside.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Used as an ultrafast accelerator for natural and synthetic rubbers, especially for butyl, EPDM and latex. Non-toxic, tasteless, suitable for white or bright-colored products, transparent products.\n"
    },
    {
        "name": " Zinc dimethyl dithiocarbamate (Rubber accelerator\nZDMC(PZ))",
        "cas_no": "  137-30-4",
        "cins_no": "205-288-3",
        "molecular_formula": "C6H12N2S4Zn",
        "discription": "ZDMC is a complex of zinc and dimethyldithiocarbamic acid, a pale yellow solid, usually used as a fungicide, and also used in rubber vulcanization and other industrial applications.\nIt can be prepared by mixing dimethylamine hydrochloride, sodium hydroxide and carbon disulfide, and then reacting with zinc sulfate in water.",
        "typical_properties": "White powder (granular). No taste. Soluble in lower concentration alkali, CS 2 ,\nbenzene, acetone and CH 2 Cl 2 , partly soluble in chloroform, insoluble in alcohol, CCl 4 and ethyl acetate.  Item\nStandards\nAppearance\nWhite\nInitial M.P. (℃)\n240.0\nLoss on drying (%)\n0.4\nZinc content(%)\n20.0-23.0\nResidues on 63μm sieve (%)\n0.3 max\nResidues on 150μm sieve (%)\n0.1 max",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "  Zinc borate",
        "cas_no": "1332-07-06",
        "cins_no": " 215-566-6",
        "molecular_formula": "B2O6Zn3",
        "discription": "Zinc borate is an environmentally friendly non-halogen flame retardant with the characteristics of non-toxicity, low water solubility, high thermal stability, small particle size, low specific gravity and good dispersibility.\nAs a high-efficiency flame retardant, it is widely used in plastics, rubber, coatings and other fields.",
        "typical_properties": "White crystalline or amorphous powder insoluble in water. Its toxicity is low. Melting point : 980 °C.\nAppearance\n\nWhite crystalline powder\nZnO(%)\n36.0 - 39.0\nB2O3(%)\n46.5 - 49.5\nWater(%)\n0.5 max\nResidue on ignition(%)\n0.5 max\nParticle size(um)\n8-20",
        "packing": "In 25Kg bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It can be used as a multifunctional synergistic additive for antimony oxide or other halogen flame retardants, which can effectively improve the flame retardant properties, reduce the generation of smoke during combustion, and adjust the chemical, mechanical, electrical and other properties of rubber and plastic products.\nAs a partial or complete environmentally friendly substitute for halogen-containing flame retardants, it is widely used directly in the processing of plastics and rubber, such as PVC, PE, PP, reinforced polyamide, polyvinyl chloride, polystyrene, epoxy resin, polyvinyl acetate resin and natural rubber, styrene butadiene rubber, chloroprene rubber, etc. It can be used in the production of paper, fiber fabrics, decorative panels, floor leather, wallpaper, carpets, ceramic glazes, fungicides, and coatings to improve flame retardant properties. It can also be used in the fields of anti-corrosion, far-infrared absorption, and anti-insect and anti-bacterial treatment of wood."
    },
    {
        "name": "Zinc oxide",
        "cas_no": " 1314-13-2",
        "cins_no": " 215-222-5",
        "molecular_formula": "ZnO",
        "discription": "Zinc oxide is an essential additive in the rubber and tire industries. It is also used as a vulcanization activator, reinforcing agent and colorant for natural rubber, synthetic rubber and latex.\n",
        "typical_properties": "White or a little yellow powder, density 5.606, fusion point: 1975℃.It is a kind of two characters oxide, dissolve in acid and alkaline solution, insoluble in water or ethanol. It is yellow color at the high temperature, resume being white after cooling.\nCharactristics\nLimited\nHxj051\nHxj052\nHxj053\nHxj054\nHxj055\nHxj056\nHxj057\nZinc oxide(counted by dried subtances )%≥\n99.8\n99.8\n99.7\n99.5\n99\n98\n96\nMetal ( zn ) %≤\nno\nno\nno\nno\n0.01\nno\nno\nLead oxide( Pb ) %≤\n0.003\n0.005\n0.037\n0.04\n0.15\n0.18\n0.3\nCupric oxide( Cu ) %≤\n0.0001\n0.0001\n0.0002\n0.0004\n0.0004\n/\n/\nManganic oxide ( Mn) %≤\n0.0001\n0.0001\n0.0001\n0.0001\n0.0001\n/\n/\nHydrochloric indissoluble substance %≤\n0.004\n0.006\n0.012\n0.015\n0.05\n0.1\n0.25\nBurning decrement %≤\n0.12\n0.2\n0.2\n0.2\n0.2\n0.3\n0.5\nWater dissoluble %≤\n0.01\n0.1\n0.1\n0.2\n0.2\n0.3\n0.3\n105℃ volatile substances %≤\n0.06\n0.1\n0.3\n0.4\n0.4\n0.6\n0.8\nSpecific sufface area(㎡/g）%≥\n60\n55\n50\n45\n40\n40\n40\nSieve residue(um)\n20-40（nm）\n2﹣20\n4﹣20\n4-50\n/\n/\n/",
        "packing": "In 25kgs bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Rubber grade zinc oxide is used in series of products such as steel radial tyre, bias tyre, conveyer belt, rubber tube and tape, rubber shoes, emulsion glove productions etc. Its properties of product can meet country, the Ministry of Chemical Industry and American ASTM standard requirements.\nCharacteristic and function ：\n1.High activity, even granularity, it’s possessed of high dispersing ability, has the good promotion curing function, improve the cross-link china density of rubber, enable to make the rubber vulcanization more completely.\n2. It can improve the viscidity of rubber compound,and the adhesive force of materials such as the rubber, steel wire and code fabric, etc.\n3. It can make good dynamic performance, make the rubber products with little deformation, low heat generation, high anti-abrasion. Enable to have good anti-oxide property."
    }
]