[
  {
    "name": "Chlorine-modified methacrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A chlorine-modified methacrylate monomer or oligomer designed to enhance adhesion, water resistance, and resistance to boiling water in polymer systems.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 20-40 mPa·s. Key properties: Adhesion, water resistance, water resistant boiling. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in specialty coatings, adhesives, sealants, and resins where improved adhesion to various substrates, enhanced water resistance, and durability under harsh (e.g., boiling water) conditions are required."
  },
  {
    "name": "Caprolactone Acrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A caprolactone-modified acrylate monomer or oligomer, used to impart high flexibility and improved impact resistance to cured polymers.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 30-50 mPa·s. Key properties: High flexibility, improve impact resistance. Physical Properties: Colorless to slightly yellowish, transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in the formulation of flexible coatings, adhesives, sealants, elastomers, and as an impact modifier for plastics and resins; enhances toughness and elongation characteristics of cured materials."
  },
  {
    "name": "Caprolactone Acrylate (with long chain segments)",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A caprolactone-modified acrylate, featuring long chain segments, specifically engineered to provide significant flexibility and enhanced impact resistance to polymer formulations.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 60-80 mPa·s. Key properties: Long chain segments, high flexibility, improve impact resistance. Physical Properties: Colorless to slightly yellowish, transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Utilized in applications demanding superior flexibility and toughness, such as flexible films, coatings for pliable substrates, impact-resistant plastics, soft-touch finishes, and certain types of adhesives."
  },
  {
    "name": "Chlorine-modified acrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A chlorine-modified acrylate monomer or oligomer, primarily used to improve adhesion and water resistance in polymeric systems.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 30-70 mPa·s. Key properties: Adhesion and water resistance. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Incorporated into formulations for coatings, adhesives, and sealants to enhance bonding to various substrates and to improve the overall water resistance of the cured product."
  },
  {
    "name": "Chlorine-modified phenoxyacrylate (lower viscosity)",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A chlorine-modified phenoxyacrylate designed to provide improved adhesion and water resistance. This version has a lower viscosity range.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 2500-5000 mPa·s. Key properties: Adhesion and water resistance. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in specialty coatings, adhesives, and encapsulants where enhanced adhesion, particularly to challenging substrates, and superior water resistance are crucial. The phenoxy group can also contribute to chemical resistance."
  },
  {
    "name": "Chlorine-modified phenoxyacrylate (higher viscosity, with long-chain segments)",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A chlorine-modified phenoxyacrylate featuring long-chain segments, formulated for excellent adhesion and water resistance. This version has a higher viscosity range.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 5000-8000 mPa·s. Key properties: Long-chain segments, adhesion, and water resistance. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Employed in high-performance coatings, adhesives, and laminates requiring robust adhesion, water resistance, and potentially improved flexibility due to long-chain segments."
  },
  {
    "name": "Special phenoxyl acrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A specially formulated phenoxyl acrylate designed to improve adhesion and tenacity in polymer systems.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 100-300 mPa·s. Key properties: Improve adhesion and tenacity. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used as an additive or comonomer in coatings, adhesives, and composites to enhance bond strength, toughness, and overall durability of the cured material."
  },
  {
    "name": "Cycloacrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A type of acrylate monomer or oligomer containing cyclic structures, characterized by high solid content, low viscosity, high Glass Transition Temperature (TG), high hardness, and good solvent resistance.",
    "typical_properties": "Active ingredient content: ≥98. Viscosity: 10-30 mPa·s. Key properties: High solid and low viscosity, high TG, high hardness, and solvent resistance. Physical Properties: Colorless to slightly yellowish, transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in UV/EB curable coatings, inks, and adhesives where rapid cure, high hardness, scratch resistance, chemical resistance, and good thermal stability are desired. Common in optical coatings and hard coats."
  },
  {
    "name": "Isoopneyl Acrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "An acrylate monomer, possibly with a branched or cyclic alkyl group (name 'Isoopneyl' is unusual, potentially a misspelling of isopentyl, isophoryl or similar). It is characterized by high solid content, low viscosity, high Glass Transition Temperature (TG), high hardness, and good solvent resistance.",
    "typical_properties": "Active ingredient content: ≥98. Viscosity: 10-30 mPa·s. Key properties: High solid and low viscosity, high TG, high hardness, and solvent resistance. Physical Properties: Colorless to slightly yellowish, transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Likely used in UV/EB curable formulations for coatings, inks, and specialty resins, contributing to high hardness, chemical resistance, and thermal properties. Suitable for applications needing durable finishes."
  },
  {
    "name": "Modified Acrylamide",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A modified acrylamide monomer or oligomer designed to provide high hardness, high Glass Transition Temperature (TG), and improved adhesion characteristics in polymer systems.",
    "typical_properties": "Active ingredient content: ≥98. Viscosity: 10-30 mPa·s. Key properties: High hardness, high TG, and improved adhesion. Physical Properties: Colorless to slightly yellowish, transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in coatings, adhesives, and composites where enhanced mechanical strength, thermal stability, and strong bonding to substrates are required. Can be used in specialty resins and UV/EB curable systems."
  },
  {
    "name": "Methylphosphate Ester Ecrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "An acrylate monomer containing a methylphosphate ester group, specifically designed for enhanced adhesion to metal and glass substrates, and offering resistance to boiling.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 600-1200 mPa·s. Key properties: Metal glass adhesion, resistant to boiling. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used as an adhesion promoter in coatings, adhesives, and sealants for metal and glass surfaces. Suitable for applications requiring strong bonding and durability under humid or high-temperature conditions, such as protective coatings for electronics or automotive parts."
  },
  {
    "name": "Double-ring-modified Ecrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "An acrylate monomer or oligomer modified with double-ring structures, aimed at providing broad substrate adhesion and good water resistance.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 10-30 mPa·s. Key properties: Various substrate adhesion, water resistance. Physical Properties: Colorless to slightly yellowish, transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in universal primers, coatings, and adhesives designed to bond to a wide range of materials. The double-ring structure may contribute to hardness, chemical resistance, and thermal stability."
  },
  {
    "name": "Cyclic trihydroxy shrink with formaldehyde acrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A complex acrylate monomer derived from a cyclic trihydroxy compound and potentially formaldehyde, engineered for broad substrate adhesion, water resistance, and tenacity.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 10-30 mPa·s. Key properties: Various substrate adhesion, water resistance, tenacity. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in high-performance coatings, adhesives, and composites requiring strong adhesion to diverse substrates, durability, and good water resistance. The term 'shrink' might imply low shrinkage upon curing."
  },
  {
    "name": "Tercarbonate-modified Acrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "An acrylate monomer or oligomer modified with tertiary carbonate groups, designed to improve yellowing resistance, flexibility, adhesion, and resistance to boiling.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 100-500 mPa·s. Key properties: Improve yellow resistance, flexibility, adhesion, boiling. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in durable coatings (e.g., outdoor applications, automotive topcoats), adhesives, and sealants where non-yellowing properties, flexibility, good adhesion, and resistance to harsh conditions are important."
  },
  {
    "name": "Pt-carbonate-modified Phenoxyacrylate",
    "cas_no": "",
    "cins_no": "",
    "molecular_formula": "",
    "discription": "A phenoxyacrylate modified with platinum-carbonate structures or similar functionalities, aimed at improving yellowing resistance, flexibility, adhesion, resistance to boiling, and providing softer, impact-resistant long-chain sections.",
    "typical_properties": "Active ingredient content: ≥96. Viscosity: 3000-5000 mPa·s. Key properties: Improve yellow resistance, flexibility, adhesion, boiled, long chain section softer, impact. Physical Properties: Microyellow transparent liquid.",
    "packing": "No information available",
    "food_idustry": "",
    "pharmaceutical_industry": "",
    "other_industries": "Used in advanced coatings, adhesives, and flexible electronics applications requiring exceptional durability, non-yellowing characteristics, good adhesion, impact resistance, and flexibility over a wide range of conditions."
  }
]