[
    {
        "name": "Aluminum Chlorohydrate 50%",
        "cas_no": "12042-91-0",
        "cins_no": "",
        "molecular_formula": "Al2 (OH)5ClnH2O or Al₂Cl₅OH·2H₂O",
        "discription": "Aluminum Chlorohydrate 50% Solution is an aqueous solution used predominantly in water treatment processes as a coagulant. It is also used in cosmetic formulations, especially in antiperspirants. This compound has high efficiency in removing impurities and suspended solids from water, and it acts as an essential component in flocculation.",
        "typical_properties": "Color: Clear to slightly haze; Odor: Odorless; Ph value: 4.0 - 4.4 (30% w/v); Solubility: Soluble in water",
        "packing": "Available in 600 lb drums and bulk quantities, suitable for both small-scale and industrial applications.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Zinc Octoate - 22%",
        "cas_no": "51731-04-5",
        "cins_no": "",
        "molecular_formula": "Zn(C18H35O2)2 ",
        "discription": "Zinc Octoate (22%) is a zinc-based metal carboxylate used primarily as a catalyst and drier in coatings and paints. Its primary role is to facilitate the oxidation of drying oils, enhancing the curing process in coatings. It is also used in the production of polyurethane and as a hydrogen sulfide scavenger in certain applications.",
        "typical_properties": "METAL: 21.7 – 22.3%; SOLID: 80-90%; SPECIFIC GRAVITY: 1.10 – 1.16; VISCOSITY: MAX 200 SEC",
        "packing": "Available in bulk containers, drums, and small pack sizes suitable for industrial and commercial use.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Antimony Pentoxide",
        "cas_no": "1314-60-9",
        "cins_no": "215-237-7",
        "molecular_formula": "O5Sb2",
        "discription": "Antimony pentoxide (Sb₂O₅) is a yellow, odorless powder that is slightly soluble in water. It is primarily used as a flame retardant synergist, enhancing the effectiveness of halogenated flame retardants in various materials. Additionally, it serves as a catalyst in certain chemical reactions and is utilized in the production of antimony-containing glass.​",
        "typical_properties": "Appearance: White Free Flowing Powder, Free from visible contamination; Purity: 99.74%; Arsenic as (As): 96.62;  Lead as (Pb): 84.90; Iron as (Fe) : 8.12; Colour: white",
        "packing": "Available in polyethylene bags, fiber drums, and bulk containers. Contact suppliers for specific packaging options and sizes.​",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Phosphorus Oxychloride (POCl₃)",
        "cas_no": "10025-87-3",
        "cins_no": "233-046-7",
        "molecular_formula": "Cl3OP",
        "discription": "Phosphorus Oxychloride is a colorless to pale yellow fuming liquid with a pungent odor. It is widely used as an intermediate in the production of flame retardants, plasticizers, organophosphorus compounds, and pharmaceutical ingredients.",
        "typical_properties": "Appearance: Colorless to pale yellow fuming liquid; Odor: Pungent; Boiling Point: 105.8 °C; Melting Point: 1.25 °C; Density: 1.675 g/cm³ (at 20°C); Solubility: Reacts violently with water; Shelf Life\t: 1 year (sealed container)",
        "packing": "250 kg drums, IBC tanks",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Phosphorus Pentachloride (PCl5)",
        "cas_no": "10026-13-8",
        "cins_no": "",
        "molecular_formula": "Cl5P",
        "discription": "Phosphorus Pentachloride is a yellowish-white crystalline solid with a pungent odor. It is highly reactive, especially with water, releasing hydrochloric acid and phosphoric acid upon decomposition. It is primarily used as a chlorinating agent in organic synthesis and in the manufacture of pharmaceuticals and agrochemicals.",
        "typical_properties": "Description: Pale Yellow Powder; Solubility: Soluble in carbon Di sulfide; Assay, %w/w: 99.85; PLC3 content: 0.08; Before trapping: 0.80; After trapping: 1.08; Density: 2.1 g/cm³; Molecular Weight: 208.24 g/mol; Odor: Pungent, unpleasant",
        "packing": "Available in 1 kg, 5 kg, 10 kg, and 25 kg containers",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "EVAFLEX EV40LW",
        "cas_no": "24937-78-8",
        "cins_no": "607-457-0",
        "molecular_formula": "(C₂H₄)n(C₄H₆O₂)m",
        "discription": "Ethylene-Vinyl Acetate (EVA) is a flexible, transparent thermoplastic polymer widely used in adhesives, packaging, solar encapsulation, footwear, and films. EVA is known for its elasticity, low-temperature toughness, and stress-crack resistance. The EVAFLEX and LG EVA series are specialty grades developed for applications requiring high processability, impact resistance, and thermal stability.",
        "typical_properties": "Appearance: White to translucent granules; Odor: Odorless; Vinyl Acetate Content: Varies by grade (typically 18%–40%); Melt Flow Index (MFI): 2–400 g/10 min (varies by grade); Density: 0.920–0.950 g/cm³; Softening Point: 70–100°C; Solubility: Insoluble in water, soluble in aromatic hydrocarbons; Stability: Excellent thermal and UV resistance; Shelf Life: 2 years",
        "packing": "Available in 25 kg bags, 500 kg jumbo bags, and bulk shipments.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Magnesium Hydroxide Nikomag A5",
        "cas_no": "1309-42-8",
        "cins_no": "215-170-3",
        "molecular_formula": "Mg(OH)₂",
        "discription": "Magnesium Hydroxide NikoMag A5 is a high-purity, non-toxic inorganic compound with the chemical formula Mg(OH)₂. It appears as a white powder and is primarily used as a flame retardant, filler, and smoke suppressant in various industrial applications. Its high purity and fine particle size make it suitable for use in pharmaceuticals, food additives, and other specialized industries. It's H₂MgO₂ can be considered an empirical representation.",
        "typical_properties": "Appearance: White powder; Density: 2.36 g/cm³; Purity: ≥99.8% Mg(OH)₂; Volatile Substances: ≤0.3% at 105°C; Solubility: Slightly soluble in water (6.9 mg/L at 20°C); Melting Point: Decomposes at 350°C; pH: 10 (saturated solution); Iron Content (Fe): ≤50 ppm",
        "packing": "Available in 25 kg bags, 500 kg big bags, or customized packaging upon request.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "POLYOLEFIN ELASTOMER GRADE: LC670",
        "cas_no": "25087-34-7",
        "cins_no": "",
        "molecular_formula": "(C₂H₄.C₈H₁₆)ₓ",
        "discription": "LC670 is a polyolefin elastomer (POE) / ethylene-1-octene copolymer is designed to enhance impact strength in polypropylene applications. It offers excellent filler acceptance, outstanding toughness, and flexibility, making it suitable for automotive parts, shoe soles, and general-purpose thermoplastic elastomers. LC670 is available in pellet form and contributes to weight reduction in final product. This resin serves as an excellent impact modifier for plastics and offers unique performance capabilities for compounded products.",
        "typical_properties": "Appearance: Solid; Melting Point: 58°C; Glass Transition Temperature: -55°C; Density:  0.870 g/cm³; Melt Index: (2.16 kg/190°C): 5.0 g/10 min; Mooney Viscosity: (ML1+4 @ 121°C): 9; Tensile Strength at Break: 5.5 MPa; Elongation at Break: >1000%; Flexural Modulus (1% Secant):  13 MPa; Hardness (Shore A): 70; Tear Strength (Type C): 38 kN/m",
        "packing": "Available in 25 kg bags or as per customer requirements.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "POLYOLEFIN ELASTOMER GRADE:LC565",
        "cas_no": "25087-34-7",
        "cins_no": "",
        "molecular_formula": "(C₂H₄.C₄H₈)ₓ",
        "discription": "LC565 is a polyolefin elastomer (POE) made from ethylene-1-butene copolymer using a proprietary metallocene catalyst. It offers excellent impact resistance, high elasticity, and a low thermal sealing temperature. As a thermoplastic elastomer, it is commonly used as an impact modifier for plastics. Its flexibility and performance make it ideal for applications in automotive parts, shoe soles, and wire & cable.",
        "typical_properties": "Appearance: Solid; Melting Point: 124–130°C; Density: 0.95 g/cm³; Solubility: Insoluble in water; Molecular Weight: Variable",
        "packing": "Available in 25 kg bags or as per customer requirements.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "HI-WAX 420 P",
        "cas_no": "9002-88-4",
        "cins_no": "",
        "molecular_formula": "(C₂H₄)ₙ",
        "discription": "HI-WAX 420P is a low molecular weight polyethylene wax. It is direct polymerization using Ziegler catalysts. It is characterized by its low density and low crystallinity, making it suitable for various industrial applications. It is also also fundamentally used as an additive in various products like paints, inks, and plastics to provide slip and release properties. ",
        "typical_properties": "Appearance: White solid; Melting Point: Approximately 100–120°C; Solubility: Insoluble in water; soluble in organic solvents; Density: Low density; Molecular Weight: Low molecular weight",
        "packing": "Available in 25 kg bags or as per customer requirements",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "UV ABSORBER 531",
        "cas_no": "1843-05-06",
        "cins_no": "217-421-2",
        "molecular_formula": " C₂₁H₂₆O₃",
        "discription": "UV Absorber 531 is a benzophenone derivative that functions as an ultraviolet light absorber, protecting polymers and coatings from UV-induced degradation. It is characterized by its low volatility, resistance to migration, and ease of processing. This compound is effective in a variety of polymers, including polyethylene (PE), polypropylene (PP), polyvinyl chloride (PVC), and polystyrene (PS). It is also utilized in coatings to enhance weatherability.",
        "typical_properties": "Appearance:  Light yellow to colorless solid; Melting Point: 47–49°C; Molecular Weight: 326.43 g/mol; Solubility: Slightly soluble in water; soluble in organic solvents; Volatility: Low; Ash Content: ≤0.1%; Transmittance: At 440 nm: ≥84% At 460 nm: ≥96% At 500 nm: ≥97%",
        "packing": "Available in 25 kg fiber drums, plastic-lined cartons, or as per customer requirements.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "UV STABILIZER 770",
        "cas_no": "52829-07-9",
        "cins_no": "258-207-9",
        "molecular_formula": "C28H52N2O4",
        "discription": "UV Stabilizer 770 is a low molecular weight hindered amine light stabilizer (HALS) that provides excellent protection against UV-induced degradation in polymers. It is effective in a variety of polymers, including polypropylene (PP), polyethylene (PE), polystyrene (PS), acrylonitrile butadiene styrene (ABS), and polyurethanes. Its low volatility and high thermal stability make it suitable for applications requiring long-term durability. Also known as Bis(2,2,6,6-tetramethyl-4-piperidyl) sebacate.",
        "typical_properties": "Molecular Weight: 480.74 g/mol; Melting Point: 80–85°C; Appearance: White crystalline powder or granules; Solubility: Soluble in organic solvents such as acetone, toluene, and chloroform; insoluble in water; Volatility: Low; Ash Content: ≤0.1%; Transmittance: At 425 nm: ≥98% At 500 nm: ≥99%",
        "packing": "Available in 25 kg fiber drums, plastic-lined cartons, or as per customer requirements",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "UV STABILIZER 622",
        "cas_no": "65447-77-0",
        "cins_no": "923-754-0",
        "molecular_formula": " (C₁₅H₂₅NO₄)ₙ",
        "discription": "UV Stabilizer 622 is an oligomeric hindered amine light stabilizer (HALS) designed to provide long-term UV protection and thermal stability in plastics and coatings. Its high molecular weight ensures low volatility, minimal migration, and excellent extraction resistance, making it particularly suitable for polyolefins, elastomers, and engineering plastics. It is effective in both pigmented and non-pigmented systems and works well with carbon black formulations. The molecular formula (C₁₇H₃₁NO₄)ₙ corresponds to the repeating unit of UV Stabilizer 622, also known as Light Stabilizer 622. This polymeric hindered amine light stabilizer (HALS) is characterized by its high molecular weight, ranging between 3,100 and 4,000 g/mol. Its oligomeric structure ensures low volatility and minimal migration, making it effective in protecting polymers from UV-induced degradation.",
        "typical_properties": "Appearance: White or white like solid; Melting Point: 56.3; Molecular Weight: 4075; Loss on drying: 0.09; Chroma: 5.0; Ash Content: 0.01; Light transmittance: 98.6 / 99.3",
        "packing": "Available in 25 kg fiber drums or as per customer requirements",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "UV STABILIZER 944",
        "cas_no": "71878-19-8",
        "cins_no": "274-570-6",
        "molecular_formula": "(C₃₅H₆₆N₈)ₙ",
        "discription": "UV Stabilizer 944 is a polymeric hindered amine light stabilizer (HALS) known for its high molecular weight, excellent extraction resistance, and low volatility. It offers long-term protection against UV degradation, particularly in polyolefins, elastomers, and engineering plastics. This stabilizer is effective in both thick-section and thin-section applications, making it widely used in outdoor and high-performance polymer applications. Also known as chimassorb@944, HALS 944.  Also  it carries as 70624-18-9(USA) as cas number. It generally has chemical name as N,N'-bis(2,2,6,6-tetramethylpiperidin-4-yl)hexane-1,6-diamine; 2,4,6-trichloro-1,3,5-triazine; 2,4,4-trimethylpentan-2-amine Poly[[6-[(1,1,3,3-tetramethylbutyl)amino]-1,3,5-triazine-2,4- diyl][(2,2,6,6-tetramethyl-4-piperidyl)imino]hexamethylene[(2,2,6,6- tetramethyl-4-piperidyl)imino]] Polymeric sterically hindered amine light stabilser.",
        "typical_properties": "Appearance: White to slightly yellowish granular powder; Melting Point: 100–135°C; Molecular Weight: >= 2,000–3,100 g/mol; Solubility: Slightly soluble in water; soluble in organic solvents such as acetone, chloroform, ethyl acetate, and toluene; Volatility: : Low; Ash Content: ≤0.1%; Transmittance: At 425 nm: ≥90% At 450 nm: ≥93%; Synonyms\t: UV783 UV944 HS-944 UV-783 UV-944 LS 944 HALS 944 HALS 783 BHSORB-783 BHSORB-944 Tinuvin 944 Primesorb944 Chimassorb 944 ACETOSTAB UV-944 Photo-stabilizer 944 Light stabilizer 944 light stabilizer-944 Light Stabilizing Agent 944 Hindered amine light stabilizer 944 Hindered amine light stabilizer 783 Hindered Amine Light Stabilizer Hs-944 N,N'-bis(2,2,6,6-tetramethyl-4-piperidyl)hexane-1,6-diamine 6-hexanediamine,n,n'-bis(2,2,6,6-tetramethyl-4-piperidinyl)-polymerwith2 Poly-{[6-[(1,1,3,3-tetramethylbutyl)-imino]-1,3,5-triazine-2,4-diyl][4-(2,2,6,6-tetramethylpiperidyl)-imino]} N,N'-bis(2,2,6,6-Tetramethyl-4-piperidinyl)hexamethylenediamine,2,4,6-trichloro-1,3,5-triazine,1,1,3,3-tetramethylbutylaminepolymer Poly[[6-[(1,1,3,3-tetramethylbutyl)amino]-s-triazine-2,4-diyl]-[(2,2,6,6-tetramethyl-4-piperidyl)imino]-hexamethylene-[(2,2,6,6-tetramethyl-4-piperidylimino]] 1,6-Hexanediamine, N,N-bis(2,2,6,6-tetramethyl-4-piperidinyl)-, polymer with 2,4,6-trichloro-1,3,5-triazine, reaction products with 2,4,4-trimethyl-2-pentanamine poly{[6-[(1,1,3,3-tetramethylbutyl)amino]-1,3,5-triazine-2,4-diyl][(2,2,6,6-tetramethyl-4-piperidyl)imino]-1,6-hexanediyl[(2,2,6,6-tetramethyl-4-piperidyl)imino]} 1,6-hexanediamine, n,n'-bis(2,2,6,6-tetramethyl-4-piperidinyl)-, polymer with 2,4,6-trichloro-1,3,5-triazine, reaction products with 2,4,4-trimethyl-2-pentanamine Poly-{[6-[(1,1,3,3-Tetramethylbutyl)Amino]-1,3,5-Triazine-2,4-Diyl][(2,2,6,6-Tetramethyl-4-Piperidyl) Imino]-1,6-Hexanediyl[(2,2,6,6-Tetramethyl-4-Piperidyl)Imino]} Poly-{[6-[(1,1,3,3-tetramethylbutyl)-imino]-1,3,5-Triazine-2,4-diyl] [2-(2,2,6,6-tetramethylpiperidyl)-amino]-hexamethylene-[4-(2,2,6,6-tetramethyl Piperidyl)-imino]}",
        "packing": "Available in 25 kg cartons with inner plastic lining or as per customer requirements",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "UV STABILIZER 783",
        "cas_no": "71878-19-8 and 65447-77-0",
        "cins_no": "",
        "molecular_formula": "UV-944: (C₃₅H₆₆N₈)ₙ UV-622: (C₁₇H₃₁NO₄)ₙ",
        "discription": "UV Stabilizer 783 is a high molecular weight hindered amine light stabilizer (HALS) known for its excellent light stability and long-term thermal stability. It exhibits low volatility, resistance to extraction, and good compatibility with most polymers. This stabilizer is particularly effective in enhancing the durability of polymers exposed to outdoor conditions. UV-783 is a synergistic mixture of UV- 944 and UV-622. It is a versatile UV stabilizer with outstanding extraction resistance, low gasfading and low pigment interaction. UV-783 is particularly well suited for LDPE, LLDPE, HDPE films, tapes and thick sections and for PP in fibers and films. It is also the product of choice for thick sections where indirect food contact approval is required. UV-783 is a versatile UV stabilizer for thin and thick sections and delivers excellent cost / performance benefits. For applications requiring indirect food approvals, TINUVIN 783 can be used at levels not possible with other conventional HALS. The synergism between the two high molecular weight HALS components of UV-783 is an effective stabilization system for the polymer against degradation through UV radiation and long term heat exposure.",
        "typical_properties": "Melting Range : 55 – 140 °C; Flashpoint : 192 °C ; Bulk Density : 514 g/l; Appearance: White or light yellow solid; Volatility: Low; Compatibility: Compatible with most polymers",
        "packing": "Available in 25 kg cartons with inner plastic lining or as per customer requirements.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "LG EVA EA28400",
        "cas_no": "24937-78-8",
        "cins_no": "607-457-0",
        "molecular_formula": "(C₂H₄)n(C₄H₆O₂)m",
        "discription": "Ethylene-Vinyl Acetate (EVA) is a flexible, transparent thermoplastic polymer widely used in adhesives, packaging, solar encapsulation, footwear, and films. EVA is known for its elasticity, low-temperature toughness, and stress-crack resistance. The EVAFLEX and LG EVA series are specialty grades developed for applications requiring high processability, impact resistance, and thermal stability.",
        "typical_properties": "Appearance: White to translucent granules; Odor: Odorless; Vinyl Acetate Content: Varies by grade (typically 18%–40%); Melt Flow Index (MFI): 2–400 g/10 min (varies by grade); Softening Point: 70–100°C; Solubility: Insoluble in water, soluble in aromatic hydrocarbons; Stability: Excellent thermal and UV resistance; Shelf Life: 2 years ",
        "packing": "Available in 25 kg bags, 500 kg jumbo bags, and bulk shipments.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "EVAFLEX  EA28400",
        "cas_no": "24937-78-8",
        "cins_no": "607-457-0",
        "molecular_formula": "(C₂H₄)n(C₄H₆O₂)m",
        "discription": "Ethylene-Vinyl Acetate (EVA) is a flexible, transparent thermoplastic polymer widely used in adhesives, packaging, solar encapsulation, footwear, and films. EVA is known for its elasticity, low-temperature toughness, and stress-crack resistance. The EVAFLEX and LG EVA series are specialty grades developed for applications requiring high processability, impact resistance, and thermal stability.",
        "typical_properties": "Appearance: White to translucent granules; Odor: Odorless; Vinyl Acetate Content: Varies by grade (typically 18%–40%); Melt Flow Index (MFI): 2–400 g/10 min (varies by grade); : ; Density: 0.920–0.950 g/cm³; Softening Point: 70–100°C; Solubility: Insoluble in water, soluble in aromatic hydrocarbons; Stability: Excellent thermal and UV resistance; Shelf Life: 2 year",
        "packing": "Available in 25 kg bags, 500 kg jumbo bags, and bulk shipments.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "EVAFLEX V421",
        "cas_no": "24937-78-8",
        "cins_no": "607-457-0",
        "molecular_formula": "(C₂H₄)n(C₄H₆O₂)m",
        "discription": "Ethylene-Vinyl Acetate (EVA) is a flexible, transparent thermoplastic polymer widely used in adhesives, packaging, solar encapsulation, footwear, and films. EVA is known for its elasticity, low-temperature toughness, and stress-crack resistance. The EVAFLEX and LG EVA series are specialty grades developed for applications requiring high processability, impact resistance, and thermal stability.",
        "typical_properties": "Appearance: White to translucent granules; Odor: Odorless; Vinyl Acetate Content: Varies by grade (typically 18%–40%); Melt Flow Index (MFI): 2–400 g/10 min (varies by grade); Density: 0.920–0.950 g/cm³; Softening Point: 70–100°C;  Solubility: Insoluble in water, soluble in aromatic hydrocarbons; Stability: Excellent thermal and UV resistance; Shelf Life: 2 years",
        "packing": "Available in 25 kg bags, 500 kg jumbo bags, and bulk shipments.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "EVAFLEX EV260",
        "cas_no": "24937-78-8",
        "cins_no": "607-457-0",
        "molecular_formula": "(C₂H₄)n(C₄H₆O₂)m",
        "discription": "Ethylene-Vinyl Acetate (EVA) is a flexible, transparent thermoplastic polymer widely used in adhesives, packaging, solar encapsulation, footwear, and films. EVA is known for its elasticity, low-temperature toughness, and stress-crack resistance. The EVAFLEX and LG EVA series are specialty grades developed for applications requiring high processability, impact resistance, and thermal stability.",
        "typical_properties": "Appearance: White to translucent granules; Odor: Odorless; Vinyl Acetate Content: Varies by grade (typically 18%–40%); Melt Flow Index (MFI): 2–400 g/10 min (varies by grade); Density: 0.920–0.950 g/cm³; Softening Point: 70–100°C; Solubility: Insoluble in water, soluble in aromatic hydrocarbons; Stability: Excellent thermal and UV resistance; Shelf Life: 2 years",
        "packing": "Available in 25 kg bags, 500 kg jumbo bags, and bulk shipments.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "EVAFLEX EV40W",
        "cas_no": "24937-78-8",
        "cins_no": "607-457-0",
        "molecular_formula": "(C₂H₄)n(C₄H₆O₂)m",
        "discription": "Ethylene-Vinyl Acetate (EVA) is a flexible, transparent thermoplastic polymer widely used in adhesives, packaging, solar encapsulation, footwear, and films. EVA is known for its elasticity, low-temperature toughness, and stress-crack resistance. The EVAFLEX and LG EVA series are specialty grades developed for applications requiring high processability, impact resistance, and thermal stability.",
        "typical_properties": "Appearance: White to translucent granules; Odor: Odorless; Vinyl Acetate Content: Varies by grade (typically 18%–40%); Melt Flow Index (MFI): 2–400 g/10 min (varies by grade); Density: 0.920–0.950 g/cm³; Softening Point: 70–100°C; Solubility: Insoluble in water, soluble in aromatic hydrocarbons; Stability: Excellent thermal and UV resistance; Shelf Life: 2 years",
        "packing": "Available in 25 kg bags, 500 kg jumbo bags, and bulk shipments.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "TAFMER DF-810",
        "cas_no": "25087-34-7",
        "cins_no": "",
        "molecular_formula": " (C2H4)n-(C4H8)m",
        "discription": "TAFMER DF-810 is a high-performance ethylene-based elastomer designed as a polymer modifier to enhance the flexibility, impact resistance, and processability of polyolefin-based compounds. It is commonly used in high-performance films, automotive components, adhesives, and molded plastic products. Due to its excellent low-temperature properties and compatibility with polyethylene, it provides superior toughness and durability in various applications.",
        "typical_properties": "Density: 0.85–0.88 g/cm; Melting Point: 30–50°C; Softening Point: 40–60°C; Tensile Strength: 6–9 MPa; Elongation at Break: 450–750%; Shelf Life: 3 years; Solubility: Insoluble in water, soluble in hydrocarbons; Processability: Enhanced for high-speed extrusion and molding; Flexural Modulus: Lower than DF-610, providing increased flexibility",
        "packing": ":Available in HDPE bags, fiber drums, and bulk containers.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "TAFMER DF-610",
        "cas_no": "25087-34-7",
        "cins_no": "",
        "molecular_formula": "(C2H4)n-(C4H8)m",
        "discription": "TAFMER DF-610 is an ethylene-based elastomer designed as a polymer modifier to enhance the flexibility, impact resistance, and processability of polyolefin-based compounds. It is widely used in high-performance films, automotive parts, adhesives, and molded plastic products. Due to its excellent low-temperature properties and compatibility with polyethylene, it improves toughness and durability in various applications. ",
        "typical_properties": "Density: 0.86–0.89 g/cm³; Melting Point: 35–55°C; Softening Point: 45–65°C; Tensile Strength: 7–10 MPa; Thermal Stability: Moderate; Processability: Improved flow characteristics for high-speed extrusion; Flexural Modulus: Lower compared to DF-605, providing enhanced flexibility; Shelf Life: 3 years",
        "packing": "Available in HDPE bags, fiber drums, and bulk containers.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "TAFMER DF-605",
        "cas_no": "25087-34-7",
        "cins_no": "",
        "molecular_formula": "(C2H4)n-(C4H8)m",
        "discription": "TAFMER DF-605 is an ethylene-based elastomer designed as a polymer modifier to improve the flexibility, impact resistance, and processability of polyolefin-based compounds. It is widely used in the production of high-performance films, automotive parts, adhesives, and molded plastic products. Due to its excellent low-temperature properties and compatibility with polyethylene, it enhances toughness and durability in various applications.",
        "typical_properties": "Density: 0.87–0.90 g/cm³; Melting Point: 40–60°C; Softening Point: 50–70°C; Odor: Odorless; Tensile Strength: 8–12 MPa; Elongation at Break: 500–800%; Thermal Stability: High; Shelf Life: 3 years",
        "packing": "Available in HDPE bags, fiber drums, and bulk containers.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "TITANIUM DIOXIDE RUTILE R6668(T)",
        "cas_no": "13463-67-7",
        "cins_no": "236-675-5",
        "molecular_formula": "TiO₂",
        "discription": "Titanium Dioxide Rutile R6668(T) is a high-purity, surface-treated rutile titanium dioxide pigment designed for superior opacity, brightness, and weather resistance. It is widely utilized in coatings, plastics, and industrial applications requiring high dispersibility and durability. This grade is known for its excellent UV resistance and performance in outdoor environments, making it a preferred choice in demanding applications.",
        "typical_properties": "TiO2 Content, % (m/m): 93.19; Tinting Strength (Compare to standard), %: 107; Volatility 105°C, % (m/m): 0.31; Water Soluble, % (m/m): 0.16; pH Value: 7.96; Boiling Point: 2,972°C; Resistance of water extraction, Ωm: 8500; Residue, 45μm, %: 0.01; Weather Resistance: High UV stability; Shelf Life: 5 years",
        "packing": "Available in HDPE containers, glass bottles, and aluminum foils.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Titanium Dioxide ATR-312",
        "cas_no": "13463-67-7",
        "cins_no": "236-675-5",
        "molecular_formula": "TiO₂",
        "discription": "Titanium Dioxide ATR-312 is a high-performance, versatile inorganic pigment known for its exceptional brightness, opacity, and UV resistance. It is widely used across various industries, including coatings, paints, plastics, rubber, and paper manufacturing. Due to its high refractive index, it provides excellent light-scattering properties, making it an essential ingredient in formulations requiring superior whiteness and durability. Additionally, its stability and non-toxic nature make it suitable for regulatory-compliant applications.",
        "typical_properties": "Molecular Weight: 79.87 g/mol; Appearance: White Powder; Odor: Odorless; Density: 4.23 g/cm³; Melting Point: 1,843°C; Boiling Point: 2,972°C; pH Value: 6.0–8.5; Refractive Index: 2.609 (Rutile)",
        "packing": "Available in HDPE containers, glass bottles, and aluminum foils.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "QUALIWAX C",
        "cas_no": "8002-74-2 ",
        "cins_no": "232-315-6",
        "molecular_formula": "CₙH₂ₙ₊₂ (Long-chain hydrocarbons)",
        "discription": "QUALIWAX C is a high-purity paraffin wax derived from petroleum refining. It is a soft, white, or translucent wax with excellent moisture resistance, insulation properties, and compatibility with various additives. This wax is widely used in cosmetics, pharmaceuticals, food coatings, candle production, packaging, cosmetics, pharmaceuticals, food packaging and industrial applications. Also, UALIWAX C is a trade name for paraffin wax, which is a mixture of long-chain hydrocarbons with the general formula CₙH₂ₙ₊₂, where n typically ranges from 20 to 40. Paraffin waxes consist predominantly of straight-chain hydrocarbons.",
        "typical_properties": "Appearance: White or colorless solid; Odor: Odorless or faint hydrocarbon scent; Melting Point: 46°C – 68°C (varies by grade); Density: 0.82 g/mL at 20°C; Flash Point: ~113°C; Solubility: Insoluble in water, Soluble in organic solvents such as benzene, chloroform, and toluene; Stability: Highly stable under normal storage conditions; Shelf Life: 3 years",
        "packing": "Available in 25 kg bags, bulk blocks, or as per customer requirements",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Antimony Trioxide",
        "cas_no": "1309-64-4",
        "cins_no": "215-175-0",
        "molecular_formula": "Sb2O3",
        "discription": "Antimony trioxide (Sb2O3) is an inorganic compound commonly used as a flame retardant and as a catalyst in various industrial applications. It is a white, odorless powder or solid used predominantly in the manufacture of plastics, textiles, glass, and electronic components. Its primary application is as a synergist in halogenated flame retardants, enhancing the flame-retardant properties of materials.",
        "typical_properties": "Molecular Weight: 291.52 g/mol; Melting Point: 656°C; Solubility: Insoluble in water, soluble in acids; Apperance: White Free Flowing Powder Free Form Visible Contamination; Color: White; Odor: Odorless; Boiling Point: 1590°C; Density: 5.4 g/cm³; Pb: 0.04 Max (ICP-OES); Stability period : 5 years ",
        "packing": "Antimony Oxide is packaged in 25 OR 50-kilogram HDPE bags,. Each pallet is stretch-wrapped in polyethylene to ensure the bags remain secure during transit. Alternatively, it can also be packaged in 500-kilogram big bags.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Aluminium Trihydrate",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Lithopone",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Sodium Oxide",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Glycerol monostearate",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Aluminium Oxide",
        "cas_no": "1344-28-1",
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate",
        "cas_no": "1317-65-3",
        "cins_no": "207-439-9",
        "molecular_formula": "CaCO3",
        "discription": "Calcium Carbonate is a white, odorless crystalline powder widely used in industrial, pharmaceutical, food, and environmental applications. It serves as a filler, antacid, and dietary supplement while also being a crucial component in plastics, paper, paints, adhesives, and water treatment. Two cas numbers 471-34-1 (Pharmaceutical/Food/Industrial PCC/GCC) 1317-65-3 (Natural Limestone/Industrial Aggregate) assigned to it.",
        "typical_properties": "Brightness (Ry, DIN 53163), Min : 96% ; pH value (ISO 787/9) : 9.0 ; DOP absorption (ISO 787/5) ±1.0 : 16g/100g ; Moisture ex works (ISO 787/2) : 0.1 max; Odor\t: Odorless; Shelf life: 2 years",
        "packing": "25 kg bags, jumbo bags (500–1000 kg), customized packaging on request",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Benzyl Chloride",
        "cas_no": "100-44-7",
        "cins_no": "",
        "molecular_formula": "C7H7Cl",
        "discription": "Benzyl Chloride is a colorless to pale yellow liquid with a pungent odor. It is primarily used as an intermediate in the synthesis of benzyl compounds, including benzyl alcohol, benzyl cyanide, and various pharmaceuticals. It also finds applications in agrochemicals, dyes, and surfactants.",
        "typical_properties": "Molecular weight: 126.58; Low Boiling imp(By GC) : < 0.2 %; High Boiling imp(By GC): < 0.3 %; Colour: 20APHA(Max); Odour: Sharp pungent; Purity by (GC): >99.50%; Specific Gravity at (27°C): 1.094 - 1.095; Appearance: Clear liquid; Shelf life: 2 years",
        "packing": "Available in 200 kg drums, 1 MT IBC tanks, and bulk tanker loads",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Titanium Dioxide R-2195",
        "cas_no": "13463-67-7",
        "cins_no": "236-675-5",
        "molecular_formula": "O2Ti / TiO₂",
        "discription": "R-2195 is a rutile titanium dioxide pigment treated with inorganic silicon and aluminum. It features high hiding power, high color elimination power, and easy dispersion. As a universal product, R-2195 is widely used in coatings, inks, profiles, color masterbatches, paper, and other industries",
        "typical_properties": "Molecular Weight: 79.87 g/mol; Appearance: White, odorless powder; Density: 4.23 g/cm³; Melting Point: 1,843°C; Boiling Point: 2,972°C; Solubility: Insoluble in water; pH: 6.5-8.0; Oil Absorption: 17-22 g/100g; Residue (45 μm): ≤0.01%; Inorganic Coating: Alumina, Silica",
        "packing": "Available in HDPE containers, glass bottles, and aluminum foils.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Ferric Chloride - Liquid",
        "cas_no": "7705-08-0",
        "cins_no": "231-729-4",
        "molecular_formula": "Cl3Fe or FeCl₃·nH₂O ",
        "discription": "Ferric Chloride - Liquid is an aqueous solution of iron(III) chloride, commonly used as a coagulant in water and wastewater treatment processes. It effectively removes impurities, suspended solids, and organic matter from water, making it suitable for both drinking water and industrial effluent treatment. Additionally, it serves as a precipitant in various chemical processes and is utilized in etching applications in the electronics industry. Naturally occurring as the mineral molysite, it is further utilized in photography, the production of iron salts, pigments, inks, and in the chlorination of silver and copper ores.",
        "typical_properties": "Physical State: Liquid; Appearance: Dark Brown Liquid; Odor: Slightly Acidic; Molecular Weight: 162.21 g/mole; Solubility: Soluble in Water; Specific Gravity: 1.38 to 1.42; Boiling Point : 316 deg C (600.80 deg F); Melting Point : 306 deg C (582.80 deg F)",
        "packing": "Available in various packaging options, including drums and bulk containers, to suit different application needs.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Magnesium Oxide OxiMag НА",
        "cas_no": "1309-48-4",
        "cins_no": "215-171-9",
        "molecular_formula": "MgO",
        "discription": "Magnesium oxide, commonly known as magnesia, is a white hygroscopic solid mineral that occurs naturally as periclase. It is a source of magnesium and is used in various industrial applications due to its refractory properties and as a magnesium supplement in agriculture and pharmaceuticals.",
        "typical_properties": "melting_point: 5072 °F (NIOSH, 2024); boiling_point: 6512 °F at 760 mmHg (NIOSH, 2024); solubility: 0.009 % at 86 °F (NIOSH, 2024); density: 3.58 (NIOSH, 2024) - Denser than water; will sink",
        "packing": "Available in 25 kg bags, 500 kg bulk bags, and custom packaging upon request.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Sulfamic acid",
        "cas_no": "5329-14-6",
        "cins_no": "226-218-8",
        "molecular_formula": "H3NO3S",
        "discription": "Sulfamic acid is a strong acid with diverse industrial applications, including metal cleaning, pH adjustment in industrial water systems, and use as a catalyst in esterification reactions. It is widely used in the pharmaceutical, agrochemical, and water treatment industries.",
        "typical_properties": "SO₄ ≤ % : 0.05; Insoluble in water %: 0.008; Fe PPM: 0.67; Appearance: Colorless crystals; Sulfamic acid ≥ % : 99.55; Pb ≤ %: <10; Shelf Life: 2 years",
        "packing": "Available in 1 kg, 5 kg, 10 kg, and 25 kg bags",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - SF50T",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - THNA SS",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - THNA 03T",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Short Soya Alkyd SO 40/70",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - N1T",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - 1T",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - 2T",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - 15T",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - THNA 02",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Coated Calcium Carbonate",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Short Soya Alkyd SO 30/70",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium Carbonate - 12T",
        "cas_no": null,
        "cins_no": null,
        "molecular_formula": null,
        "discription": null,
        "typical_properties": "",
        "packing": "",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    }
]