[
    {
        "name": "Sodium alginate\n",
        "cas_no": "9005-38-3",
        "cins_no": "231-915-5",
        "molecular_formula": "C5H7O4COONa",
        "discription": "Sodium Alginate is a natural polysaccharide extracted from seaweed carbohydrates. Widely used in food, pharmaceutical, textile, printing and dyeing, paper making, daily-use chemical products as a thickener,emulsifier,stabilizer, binder, sizing agent used. Sodium Alginate in the pharmaceutical industry have anti-clotting, lowering blood pressure and reduce blood viscosity effect. E401 Can prevent high blood pressure, diabetes, obesity and other modern diseases.\n",
        "typical_properties": "White to Off-white powder. Soluble in water. Insoluble in alcohol, chloroform and ether.",
        "packing": "In 25kgs/cardboard drum, lined with PE bag\n",
        "food_idustry": "1. Stability: used in ice cream, cheese, cream and yogurt, etc.\n2. Thickening and emulsification: used in salads, puddings, jams, ketchup and canned products, etc.\n3. Hydration: used in noodles, vermicelli, bread, cakes and frozen products;\n4. Gelling: used in various gel foods such as frozen foods and artificial imitation foods, as well as protective layers, sugar coatings, fillers, and coatings for snacks of fruits, poultry and aquatic products, etc.\n5. Film-forming: used in various cosmetics.\n",
        "pharmaceutical_industry": "1. Excipient: used in dental impression materials, ointments, tablets, etc.;\n2. Hemostatic agent: used in hemostatic gauze, burn gauze, spray hemostatic agent, etc.;\n3. It has the effect of blocking and expelling radioactive elements and harmful metals.",
        "other_industries": "1. Used as sizing material in papermaking;\n2. Used as seed treatment, pesticide, antiviral material, etc. in agriculture;\n3. Used in welding rod negative, resin coating, rubber paste agent, battery separator and water treatment;\n4. Man-made fiber: can be mixed with asbestos short fiber.\n"
    },
    {
        "name": "Acesulfame-K",
        "cas_no": "55589-62-3",
        "cins_no": "259-715-3",
        "molecular_formula": "C4H4KNO4S",
        "discription": "",
        "typical_properties": "Acesulfame K is very soluble in water, has high stability to light, heat, acid, alkali and microorganisms, and does not absorb moisture in the air, so it has strong adaptability.",
        "packing": "In 25Kgs/bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Agar-agar",
        "cas_no": "9002-18-0",
        "cins_no": "232-658-1",
        "molecular_formula": "C14H24O9",
        "discription": "Agar-agar is a hydrocolloid extracted from red seaweeds that is widely used as a gelling agent in the food industry.",
        "typical_properties": "Agar Agar is usually white or tiny yellow, free of smell or having light characteristic smell.\nIt can't dissolve in cold water but can easily dissolve in boiling water and dissolve slowly in hot water.\nIt has high gel strength at low concentrations, low viscosity in solution, high transparency in solution, thermo-reversible gel and sharp melting/setting temperatures.",
        "packing": "In 25kgs kraft paper bag",
        "food_idustry": "Milk Products:                     Ice Creams, Yogurts, Milk desserts, Puddings, Processed cheeses.\nSweets and Confectionary: Candy bars, Jelly candies, Marshmallows, Jams and Jellies, Marmalades, Fruit Jelly Dessert, Meringues.\nBeverages:                           Clarifying and refining of juices, beers and wines.\nBakery:                                 Sugar icings, Pie fillings, Bread dough, Chiffon pies, Cake glaze.",
        "pharmaceutical_industry": "Microbiology, Laxative, Therapeutic agent, Suspension agent of emulsion, Stabilizing agent of solution.",
        "other_industries": "Dental prosthetics, Electrophoresis, Chromatography, Impression materials, Plant Biotechnology."
    },
    {
        "name": "Ascorbic acid",
        "cas_no": "50-81-7",
        "cins_no": "200-066-2",
        "molecular_formula": "C6H8O6",
        "discription": "Ascorbic acid , also known as Vitamin C, is a vitamin found in various foods and is also sold as a nutritional supplement to prevent and treat scurvy. Vitamin C is involve in tissue repair and the enzymatic production of certain neurotransmitters. It is required for the function of several enzymes and is important for the functioning of the immune system. It also acts as an antioxidant.",
        "typical_properties": "Ascorbic acid is easily soluble in water, slightly soluble in ethanol, insoluble in ether, chloroform, benzene, petroleum ether, oils, and fats. The aqueous solution shows an acidic reaction. It can be quickly oxidized into dehydroascorbic acid in the air, with a citric acid-like sour taste. It is a strong reducing agent, and gradually turns into light yellow to varying degrees after long storage.",
        "packing": "In 25kgs/carton",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Aspartame",
        "cas_no": "22839-47-0",
        "cins_no": "245-261-3",
        "molecular_formula": "C14H18N2O5",
        "discription": "Aspartame is a nutritive sweetener based on two amino acids. It is metabolized like a food protein. Aspartame is a white,crystalline substance,approximately 200 times sweeter than sugar.Aspartame provides a clean sugar-like sweetness,without any bitter or metallic after-taste.",
        "typical_properties": "White crystalline powder, odorless, with strong sweetness. The sweetness is similar to sucrose, 150~200 times sweeter than sucrose, and the sweetness threshold is 0.001%~0.007%. It is soluble in water, with a solubility of 10.20% at 25℃.",
        "packing": "In 25kgs kraft paper bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Benzoic acid",
        "cas_no": "65-85-0",
        "cins_no": "200-618-2",
        "molecular_formula": "C7H6O2",
        "discription": "Benzoic acid is an aromatic acid organic compound and the simplest aromatic acid. Benzoic acid is widely present in nature in the form of free acid, ester or its derivatives. It is mainly used to prepare sodium benzoate preservatives, and is used in the synthesis of drugs and dyes. It is also used in the preparation of plasticizers, mordants, fungicides and fragrances.",
        "typical_properties": "White crystalline powder, soluble in ethanol, slightly soluble in water, has a benzoic smell, and can sublime when heated.",
        "packing": "In 25kgs/bag,500kg/bag,1000kg/bag, polyethylene plastic bag, coating bag, super sack",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Butylated hydroxytoluene",
        "cas_no": "128-37-0",
        "cins_no": "204-881-4",
        "molecular_formula": "C15H24O",
        "discription": "Butylated hydroxytoluene (BHT), chemically 2,6-di-tert-butyl-p-cresol (DBPC), is a white crystalline solid with a faint characteristic odor. Used as an antioxidant in plastics, elastomers and petroleum (lubes, greases and waxes), practically bigger market size than food field, also used as a stabilizer to inhibit the auto-polymerization of organic peroxides.",
        "typical_properties": "White crystals, soluble in ethanol, acetone, benzene, soybean oil, cottonseed oil, lard, insoluble in water, glycerin, propylene glycol.",
        "packing": "In 25kgs bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Calcium propionate",
        "cas_no": "4075-81-4",
        "cins_no": "223-795-8",
        "molecular_formula": "C3H8CaO2",
        "discription": "Calcium Propionate was approved for use by the WHO and FAO secure food and feed use acid-based preservatives. Under acidic conditions, resulting in the free acid, has an antibacterial effect. Calcium Propionate like other fat people and animals can be absorbed through metabolism, and the supply of calcium necessary for humans and animals, this advantage can not be compared to other fungicides.",
        "typical_properties": "White, light, flaky crystals or granules, odorless or with a slight smell of propionic acid, easily deliquesced in moist air. Soluble in water, slightly soluble in alcohol, insoluble in ether, sensitive to light and heat.",
        "packing": "In 25kgs/bag",
        "food_idustry": "Propionic acid is used as a preservative in feed and food industry directly or in the forms of ammonium propionate, calcium and sodium propionates.",
        "pharmaceutical_industry": "It is used to manufacture various propionates which used in the production of pharmaceuticals, antifungal agents, agrochemicals, plastics, plasticizers, rubber chemicals, dyes, artificial flavors and perfumery synthetics.",
        "other_industries": "It is used also as asolvent and in nickel-electroplating solutions."
    },
    {
        "name": "Carrageenan",
        "cas_no": "11114-20-8",
        "cins_no": "232-945-1",
        "molecular_formula": "C24H36O25S2",
        "discription": "Carrageenan is a hydrophilic colloid, also known as euestrin, cauliflower, because carrageenan is extracted from red algae seagrass such as euestrin, cauliflower, Its chemical structure is composed of galactose and dehydrated galactose polycarbohydrate sulfate of calcium, potassium, sodium, ammonium salts. Because of the different binding forms of sulfate, it can be divided into K type (Kappa), I type (Iota), L type (Lambda).",
        "typical_properties": "Solubility: Insoluble in cold water, but can swell into gel blocks, insoluble in organic solvents, easily soluble in hot water to form a translucent colloidal solution. The dissolution rate increases in hot water above 70°C.      Gelation: It can generate thermoreversible gel in the presence of potassium ions.                                      Thickening: It forms a low-viscosity sol at low concentrations, and a high-viscosity sol at higher concentrations.                                                      Synergy: It produces synergistic effects with colloids such as locust bean gum, konjac gum, and xanthan gum, which can improve the elasticity and water retention of the gel.",
        "packing": "In 25Kgs kraft paper bag",
        "food_idustry": "1.Desserts: Ice cream, cream, milkshakes, salad dressings, sweetened condensed milks, and sauces: gel to increase viscosity.                                                                                            2.Beer: Clarifier to remove haze-causing proteins",
        "pharmaceutical_industry": "Used as an inactive excipient in pills/tablets",
        "other_industries": "Pet food, Personal lubricants, Vegetarian hot dogs"
    },
    {
        "name": "Castor oil",
        "cas_no": "8001-79-4",
        "cins_no": "232-293-8",
        "molecular_formula": "C57H104O9",
        "discription": "Castor oil is a natural vegetable oil extracted from castor beans (Euphorbiaceae) and is a triglyceride of fatty acids. Because its fatty acids contain about 90% ricinoleic acid, it shows different properties from other oils. Castor oil can undergo various chemical reactions through -OH groups, double bonds, and ester bonds, so it is widely used in industrial applications, medical devices, cosmetics, and other fields.This product can be directly used in medicine and lubricating oil, and is the basic raw material for producing castor oil derivative products.",
        "typical_properties": "Castor oil is light yellow or nearly colorless at room temperature, nearly transparent, and has no fragrance or a faint odor.It is easily soluble in ethanol but hardly soluble in petroleum ether.",
        "packing": "In 190 kgs net drum",
        "food_idustry": "In the food industry, food-grade castor oil is used as a food additive, seasoning, mildew preventer, candy making and product packaging. Polyoxyethylated castor oil is also used in the food industry.",
        "pharmaceutical_industry": "Indications: laxative, emptying the contents of the large intestine.",
        "other_industries": "Castor oil has the characteristics of high temperature resistance and lubrication. During World War II, refined castor oil was widely used as a lubricant for internal combustion engines. However, due to the problems of easy oxidation, oil pollution and inability to withstand severe cold, it has now been replaced by other mineral oils. However, refined castor oil is still used as a general lubricant, engine oil, brake fluid[7], and two-stroke motorcycle engine oil."
    },
    {
        "name": "Choline chloride",
        "cas_no": "67-48-1",
        "cins_no": "200-655-4",
        "molecular_formula": "C5H14ClNO",
        "discription": "Choline is a quaternary ammonium compound having a hydroxyl substituent with general formula, (CH3)3N+CH2CH2OHX- . It is a strongly basic hygroscopic amine substance distributed widely in plant and animal tissues. It is often referred to vitamin B complex. It is the basic constituent of lecithin ( a group of phospholipids of the general composition CH2OR1CHOR2CH2OPO2OHR3, where R1 and R2 are fatty acids and R3 is choline ) and other phospholipids.",
        "typical_properties": "White hygroscopic crystals, tasteless, with a fishy odor. Melting point 305℃. 10% aqueous solution pH 5-6, unstable in alkaline solution. This product is easily soluble in water and ethanol, insoluble in ether, petroleum ether, benzene and carbon disulfide.",
        "packing": "In 25kgs/bag, 230kgs/drum",
        "food_idustry": "Choline chloride is a B vitamin, and the main ingredients of constituted phospholipids, lecithin and plasmalogen. Choline chloride is a necessary organic compounds that has a low molecular weight to maintain vivo physiological functions, involved in regulating fat metabolism and transformation in vivo to stimulate the liver, to generate antibodies ,to prevent liver, stomach fat deposition and tissue degeneration, and may contribute to amino acids",
        "pharmaceutical_industry": "the largest kind of vitamin in it, it can promote animal’s growth after use, make animal gain weight rapidly, increase egg production, hatching volume and lean mass, and can save feed, prevent disease and reduce mortality.",
        "other_industries": ""
    },
    {
        "name": "Citric acid monohydrate",
        "cas_no": "5949-29-1",
        "cins_no": "200-662-2",
        "molecular_formula": "C6H10O8",
        "discription": "Citric acid monohydrate is an important organic acids, citric acid, colorless crystals, often with part of crystal water, odorless, has a strong acidity, soluble in water. Citric acid monohydrate is widely used in food, pharmaceutical, cosmetic and other industries the most important organic acids.",
        "typical_properties": "White crystalline powder, odorless. Soluble in water, ethanol, ether, insoluble in benzene, slightly soluble in chloroform.",
        "packing": "In 25kgs/bag",
        "food_idustry": "Citric acid is used as an excipient in pharmaceutical preparations due to its antioxidant properties. It maintains the stability of active ingredients and is used as a preservative.",
        "pharmaceutical_industry": "It is also used as an acidulant to control pH and acts as an anticoagulant by chelating calcium in the blood",
        "other_industries": "Additionally, Citric Acid Monohydrate is used as an acidulating, food additive, and synergist in antioxidant mixtures."
    },
    {
        "name": "CMC (Sodium Carboxymethyl Cellulose)",
        "cas_no": "9004-32-4",
        "cins_no": "618-326-2",
        "molecular_formula": "C6H12O6",
        "discription": "Sodium Carboxymethyl Cellulose is a cellulose derivative with carboxymethyl groups bound to some of the hydroxyl groups of the glucopyranose monomers that make up the cellulose backbone. It is often used as its sodium salt, sodium carboxymethyl cellulose. Sodium Carboxymethyl Cellulose(Food grade CMC) can be used as thickener,emulsifier,excipient, expanding agent,stabilizer and so on, which could replace the role of gelatin, agar, sodium alginate. With its function of toughness, stabilizing, reinforce thicking, water maintaining, emulsifying, mouthfeel improving. When using this grade of CMC, cost can be reduced, food taste and preservation can be improved, guarantee period can be longer.So this kind of CMC is one of indispensable additives in food industry.",
        "typical_properties": "It is a non-toxic and odorless white flocculent powder with stable performance and is easily soluble in water. Its aqueous solution is a neutral or alkaline transparent viscous liquid. It is soluble in other water-soluble glues and resins, but insoluble in organic solvents such as ethanol.",
        "packing": "In 25Kgs kraft paper bag",
        "food_idustry": "Carboxy Methyl Cellulose(CMC) is used in food science as a viscosity modifier or thickener, and to stabilize emulsions in various products including ice cream. As a food additive, it has E number E466",
        "pharmaceutical_industry": "",
        "other_industries": "It is also a constituent of many non-food products, such as K-Y Jelly, toothpaste, laxatives, diet pills, water-based paints, detergents, textile sizing and various paper products. It is used primarily because it has high viscosity, is non-toxic, and is non-allergenic."
    },
    {
        "name": "Coumarin",
        "cas_no": "91-64-5",
        "cins_no": "202-086-7",
        "molecular_formula": "C9H6O2",
        "discription": "Coumarin, also known as 1,2-benzopyrone and o-oxonaphthone, is an organic compound with the chemical formula C9H6O2. It is an important fragrance and is often used as a fixative, deodorant, and in the preparation of perfumes and spices. It is also used as a flavor enhancer for beverages, foods, cigarettes, plastic products, rubber products, etc.",
        "typical_properties": "White crystalline powder, insoluble in cold water, easily soluble in hot water, alcohol, ether, chloroform and sodium hydroxide solution.",
        "packing": "In 25 kgs net drum",
        "food_idustry": "Coumarin is an important flavoring agent, commonly used as a fixative, deodorant, and in the preparation of perfumes and spices. It is also used as a flavoring agent for beverages, foods, cigarettes, plastic products, rubber products, etc.",
        "pharmaceutical_industry": "In medicine, it is added to drugs as a flavoring agent.",
        "other_industries": "Coumarin derivatives are also used as rodenticides due to the property of causing fatal hemorrhaging. Coumarin has the characteristic odour like that of vanilla beans. It is used for the preparation of perfumes, soaps, flavourings. The coumarin nucleus (benzo-2-pyrone) is derived cinnamic acid (phenylacrylic skeleton) in the biosynthesis. Accordingly, the hydroxy group attached to coumarin structure at 7 position is important in biosynthesis pathway. Umbelliferone (7-hydroxy coumarin), esculetin (6,7-Dihydroxycoumarin), scopoletin (7-hydroxy-6-methoxycoumarin) are the widespread coumarins in nature. Synthetic 7-hydroxy coumarins are used to absorb ultraviolet rays in sunscreen cosmetics and used in the synthesis of drugs especially anticancer."
    },
    {
        "name": "Dextrose monohydrate",
        "cas_no": "5996-10-1",
        "cins_no": "218-914-5",
        "molecular_formula": "C6H14O7",
        "discription": "",
        "typical_properties": "White crystal powder with sweet taste, melting point :146℃, flash point :224.6℃.",
        "packing": "In 25kgs kraft paper bag",
        "food_idustry": "In the food industry and beverage industry, it is used as a sweetener, nutrient and filler.",
        "pharmaceutical_industry": "In the pharmaceutical industry, it can be used as a nutrient solution to prepare oral solution or intravenous injection solution.",
        "other_industries": "In the leather industry, it is used as a reducing agent for sole leather and suitcase leather."
    },
    {
        "name": "Disodium 5’-Ribonucleotide",
        "cas_no": "80702-47-2",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Disodium 5’-Ribonucleotide consists of 5’-IMP and 5’-GMP as per proportion of 1:1. It can be added into food directly, which will make an obvious contribution to food taste. It is the key ingredient to make flavor to the sauce, seasoning, gallinaceous crystal and gallinaceous powder. It is often be used together with MSG, when use in the recommended ratio of 2%—10% I plus G. The above mixture is called \"\"extract MSG\"\". In addition, this product has a good effect to cure chronic hepatitis, muscular atrophy, and have a fairly high curative effect on eye-disease.",
        "typical_properties": "White or colorless crystals or crystalline powder. With a good water-soluble, can be dissolved in 100 ml of water.",
        "packing": "10kg/carton or as per customer’s requirement",
        "food_idustry": "In the food industry, flavor enhancers are widely used in liquid seasonings, special fresh soy sauce, powdered seasonings, meat processing, fish processing, catering and other industries.",
        "pharmaceutical_industry": "Seasonings for household and catering industry. Adding 0.1-0.5% compound flavor enhancers to dishes and soups not only makes the soup fresh, but also gives it a strong meaty flavor. Adding 0.5-1% compound flavor enhancers to various homemade sauces for roast meat, roast chicken, roast duck, roast lamb, marinated products, braised fish, etc. can make the seasonings present a natural taste.",
        "other_industries": "Meat food processing. Yeast monosodium glutamate, hydrolyzed animal protein, I+G, and monosodium glutamate in a certain proportion are used in meat foods such as ham, sausage, meatballs, meat fillings, etc., which can suppress the unpleasant smell of meat, have a flavor correction effect, promote the ripening of meat aroma, and give meat products a strong aroma."
    },
    {
        "name": "DL-Tartaric Acid",
        "cas_no": "133-37-9",
        "cins_no": "201-766-0",
        "molecular_formula": "C4H6O6",
        "discription": "DL-tartaric acid is also called 2,3-dihydroxysuccinic acid, with the molecular formula: C4H6O6nH2O (crystalline product: n=1, anhydrous product n=0), It is a mixture of equal amounts of right-handed and left-handed tartaric acid, often containing one or two crystal waters, and loses water when heated to 100°C. It is widely used in the food industry, such as as a beer foaming agent, food acidulant, flavoring agent, used in refreshing drinks, candies, fruit juices, sauces, cold dishes, baking powder, etc. Its sourness is 1.3 times that of citric acid, and it is particularly suitable as a grape juice acidulant.",
        "typical_properties": "Colorless transparent crystal or white crystalline powder, odorless, sour taste, the sourness and sourness intensity are the same as L-tartaric acid. Melting point 205-206℃. Soluble in water, slightly soluble in ethanol.",
        "packing": "In 25kgs/bag",
        "food_idustry": "In the food industry used as beer foaming agent, food sour agent, flavor correction agent, etc.",
        "pharmaceutical_industry": "Widely used in food, medicine, chemical, light industry and other industries. Mainly used in the manufacture of Tartrate salts, such as pPotassium Antimony Tartrate, Sodium Potassium Tartrate and so on.",
        "other_industries": "It also plays a very important role in tanning leather, photography, glass, enamel, telecommunications equipment and other industries."
    },
    {
        "name": "EDTA-2 Na (Tetrasodium ethylenediamine tetraacetate)",
        "cas_no": "6381-92-6",
        "cins_no": "205-358-3",
        "molecular_formula": "C10H14N2Na2O8",
        "discription": "The sodium salt of EDTA is used as an antidote for metal poisoning, an anticoagulant, and an ingredient in a variety of detergents.It is an important chelating agent that can chelate metal ions in the solution. It can prevent discoloration, deterioration, turbidity and oxidative loss of vitamin C caused by metals, and can also improve the antioxidant properties of oils and fats (trace metals in oils and fats, such as iron and copper, can promote the oxidation of oils and fats).Chelating agents are important in the field of soap, detergents, textile dyeing, water softening, metal finishing and plating, pulp and paper, enzyme deactivation, photo chemistry, and bacteriocides.",
        "typical_properties": "White crystalline powder. Soluble in water, able to chelate with a variety of metal ions.",
        "packing": "In 25kgs/bag, 250kgs/drum, IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "It is mainly used in detergents, dyeing auxiliaries, fiber treatment agents, cosmetic additives, food additives, agricultural micro-fertilizers and marine aquaculture. Disodium ethylenediaminetetraacetate (EDTA-2Na) can be used as an additive in industrial cleaners to effectively remove pollutants such as metal ions and help cleaners to better perform their cleaning effects.",
        "other_industries": "In the leather processing process, disodium ethylenediaminetetraacetate is used as an additive in immersion tanning agents and chrome leathers to help improve the texture and performance of leather."
    },
    {
        "name": "EDTA-4Na (Tetrasodium ethylenediamine tetraacetate)",
        "cas_no": "64-02-8",
        "cins_no": "200-573-9",
        "molecular_formula": "C10H12N2Na4O8",
        "discription": "As one chelating agent, EDTA-4Na can be used in industrial cleaning, personal and household uses, Bleaching of pulp and textile,Micronutrients for agriculture, Polymer processing and Metalplating etc.It also used in water treatment, color sensitization, ect. By wayof additive, active agent, clarifier, metalremover.40% Solution is a sequestering Agent, used in various Industries such as Pharmaceutical, Photography, Textile, Boiler Turbine. scale removal, Agriculture as a Micronutrient for Plant Growth, Water Treatment, Laboratory Reagent, Food & Beverages, Cosmetics,Soaps & Detergents, etc. It is used for removing unwanted inorganic impurities present in the system, which helps in getting superior performance & cost saving.",
        "typical_properties": "White crystalline powder. Melting point (℃): 248℃， Ignition temperature (℃): 450℃. Soluble in water, slightly soluble in alcohol.",
        "packing": "In 25kgs/bag, 250kgs/drum, IBC drum",
        "food_idustry": "",
        "pharmaceutical_industry": "It is used as a water softener, chelating agent, polymerization initiator for styrene-butadiene rubber, initiator for acrylic fiber, printing and dyeing auxiliaries, detergent auxiliaries, etc.",
        "other_industries": "It is also used for titration in chemical analysis, and can accurately titrate a variety of metal ions, and is widely used.\n"
    },
    {
        "name": "Folic acid",
        "cas_no": "59-30-3",
        "cins_no": "201-939-0",
        "molecular_formula": "C19H19N7O6",
        "discription": "Folic acid is a derivative of pteridine, originally isolated from the liver and later found to be abundant in the green leaves of plants, hence the name folic acid. It is widely found in meat, fresh fruits, vegetables.",
        "typical_properties": "Yellow or orange crystalline powder, odorless, tasteless. Insoluble in water, ethanol, acetone or ether, soluble in alkali hydroxide or carbonate.",
        "packing": "In 25kgs drum",
        "food_idustry": "",
        "pharmaceutical_industry": "Folic acid is an anti-anemia drug. When livestock and poultry lack folic acid, their appetite decreases, growth is stunted, and feather growth is poor. Dosage 0.5-1.0 mg/kg.Used as a biochemical reagent, also used in the pharmaceutical industry, etc. Biochemical research; clinical drugs are vitamin B group, used for the treatment of pregnancy and infant megaloblastic anemia and other diseases.Used as a biochemical reagent, also used in the pharmaceutical industry, etc.",
        "other_industries": "Used in the polyamide industry to prepare nylon, and also used as a raw material for saturated polyurethane."
    },
    {
        "name": "Fumaric acid",
        "cas_no": "110-17-8",
        "cins_no": "203-743-0",
        "molecular_formula": "C4H4O4",
        "discription": "Fumaric Acid is the simplest unsaturated dicarboxylic acids. Corydalis found from the first, in addition, there are a variety of mushrooms and fresh beef. Play food preservatives, preservatives, antioxidants.",
        "typical_properties": "White powder or colorless crystals, soluble in ethanol, slightly soluble in water and ether, insoluble in chloroform, carbon tetrachloride, benzene.",
        "packing": "In 25 kg, 500 kg, 1000 kg bag",
        "food_idustry": "In food, it is mainly used in meat and fish product processing. Fumaric acid can be used as an acidity regulator, acidifier, antioxidant, pickling accelerator, and spice. This product has a strong buffering effect.",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Gelatin",
        "cas_no": "9000-70-8",
        "cins_no": "234-394-2",
        "molecular_formula": "C6H12O6",
        "discription": "Gelatin is a collection of peptides and proteins produced by partial hydrolysis of collagen extracted from the skin, bones, and connective tissues of animals such as domesticated cattle, chicken, pigs, and fish. During hydrolysis, some of the bonds between and within component proteins are broken. Its chemical composition is, in many aspects, closely similar to that of its parent collagen.Photographic and pharmaceutical grades of gelatin generally are sourced from cattle bones and pig skin. Gelatin is classified as a hydrogel.",
        "typical_properties": "Tasteless and odorless with a colorless or slightly yellow appearance. It is transparent and brittle, and it can come as sheets, flakes, or as a powder.Polar solvents like hot water, glycerol, and acetic acid can dissolve gelatin, but it is insoluble in organic solvents like alcohol. Gelatin absorbs 5-10 times its weight in water to form a gel.The gel formed by gelatin can be melted by reheating, and it has an increasing viscosity under stress (thixotropic).",
        "packing": "In 25/50kg bag",
        "food_idustry": ".Eat gelatin. It is an important ingredient and additive in the food industry. It is often used as a gelling agent, stabilizer, emulsifier, thickener and clarifying agent in the production of meat products, cakes, ice cream, beer, juice, etc.",
        "pharmaceutical_industry": "Medical fiber. The blending of other composite materials with gelatin improves the mechanical properties of gelatin-based medical fiber materials. Tissue repair and replacement.",
        "other_industries": "Biofilm material. The most studied gelatin base film materials are mainly chitosan-gelatin blend film, gelatin-silk fibroin blend film, polylactic acid-gelatin blend film and polyvinyl alcohol-gelatin blend film, etc. These mixed materials are greatly improved. The physical and chemical properties of gelatin make the gelatin-based polymer film material more functional."
    },
    {
        "name": "Gellan gum",
        "cas_no": "71010-52-1",
        "cins_no": "275-117-5",
        "molecular_formula": "C6H12O6",
        "discription": "Gellan gum is used primarily as a gelling agent, alternative to agar. As a food additive, gellan gum is used as a thickener, emulsifier, and stabilizer. Gellan Gum is a high -molecular weight carbohydrate. It is a naturally occurring polysaccharide industrially produced in a pure cuture fermentation by the microorganism Sphingomonas elodea. Following fermentation, the broth is sterilized to prevent bacterial contamination, and Gellan Gum is recovered by precipitation with alcohol, drying, and milling.The uses of Gellan Gum depends on its effective gelling, stabilizing, texturizing, suspending, film forming, thickening, stability to heat and acidity, syneresis control, flavor release, and good mouthfeel properties.",
        "typical_properties": "Gellan gum is a water-soluble polysaccharide produced by Pseudomonas elodea, a bacterium.",
        "packing": "In 25Kgs drum with double pp bag inner",
        "food_idustry": "Due to its superior gelling properties, gellan gum has gradually replaced agar and carrageenan. Gellan gum is widely used in food, such as pudding, jelly, sugar, beverages, dairy products, jam products, bread fillings, surface lubricants, candies, sugar coatings, seasonings, etc.",
        "pharmaceutical_industry": "It is also used in non-food industries, such as microbial culture media, slow release of drugs, toothpaste, etc.",
        "other_industries": ""
    },
    {
        "name": "Glycine",
        "cas_no": "56-40-6",
        "cins_no": "200-272-2",
        "molecular_formula": "C2H5NO2",
        "discription": "Glycine is an amino acid, a compound that your body uses to create protein. While your body does naturally produce glycine, it is also available through protein-rich foods, particularly meat. Glycine can also be found as a dietary supplement in capsule form or as a powder that can be added to various dishes.",
        "typical_properties": "White to off-white crystalline powder, odorless. Soluble in water, almost insoluble in ethanol or ether.",
        "packing": "In 25kg bag",
        "food_idustry": "1. Used as a nutritional supplement, mainly for seasoning and other aspects;     2. It has a certain inhibitory effect on the reproduction of Bacillus subtilis and Escherichia coli, so it can be used as a preservative for surimi products, peanut butter, etc., and the addition amount is 1% to 2%;                             3. It has anti-oxidation effect (using its metal chelation effect), adding it to butter, cheese, and margarine can extend the shelf life by 3 to 4 times;        4. In order to stabilize lard in baked food, 2.5% glucose and 0.5% glycine can be added;                                                                                                 5. Add 0.1% to 0.5% to the wheat flour used for instant noodles, and it can also play a seasoning role;                                                                                   6. It can buffer the taste of salt and vinegar.",
        "pharmaceutical_industry": "1. Used as an additive in electroplating solution;           2. Used in pharmaceutical industry, biochemical experiment and organic synthesis;                                    3. Used as raw materials for cephalosporins, thiamphenicol intermediates, intermediates for the synthesis of imidazole acetic acid, etc.;                              4. Used as cosmetic raw material.",
        "other_industries": ""
    },
    {
        "name": "GMS (  Glycerol monostearate)",
        "cas_no": "123-94-4",
        "cins_no": "250-705-4",
        "molecular_formula": "C21H42O4",
        "discription": "Glycerol monostearate is a kind of widely used grease chemical products, It is the most widely used and biggest dosage emulsifier in food and daily chemical industry. White waxy flake or solid, insoluble in water, mixed with hot water by the strong oscillation can be dispersed in the water, is water-in-oil type emulsifier. In the beverage, food areas: Widely used in ice cream, composite milk, vegetable protein drinks, bread, cake, coffee, meat, rice, pasta and other products, as an emulsifier, stabilizer, anti-aging agent of starch. In the food grease, fine chemical aspects of food: used as high quality emulsifier and dispersant in margarine, shortenings, powder oil, fresh cream, filming agent of fresh fruit and defoamers, etc. In the processing of EPE, PVC plastics: non-toxic plasticizer, anti-aging and blowing agent; can effectively improve the flexibility, plasticity and antistatic property of products. In the cosmetics, pharmaceutical emulsions areas: Widely used in ointment, cream and liniment to improve the stability and dispersion of dispersed phase.",
        "typical_properties": "White powder or pellet, melts into transparent liquid when heated, solidification point is not less than 58℃. Tasteless, odorless, non-toxic. Soluble in vegetable oil, hot ethanol, ether, chloroform and acetone, insoluble in water.",
        "packing": "In 25kgs/bag",
        "food_idustry": "Food : oil cake, cream, Coffee partner, cold food, liquid solid beverage, dairy products, sugar, fruit sugar, toffee, chocolate, bread, biscuit, peanut / walnut / beans / Sesame / coconut sauce (milk), sausage, ham sausage, rice and flour products, noodles, starch, spicy food.",
        "pharmaceutical_industry": "Medicine: paste, nutrient solution",
        "other_industries": "1. Cosmetics: skin fat, cream, hair cream, shampoo and other formulations, as emulsifier and thickener.                                                                                                                                                                       2. Plastic additives : pearl cotton packaging, food packaging film, fruit nets, PVC stabilizer, sanitary materials etc..\n3. Agriculture:In agricultural greenhouse film production, monoglyceride is the main raw material flow drops. Monoglycerides can be used as complexing agent cellulose nitrate plasticizer, alcohol acid resin modifier, latex and synthetic paraffin.\n                "
    },
    {
        "name": "Gum Rosin",
        "cas_no": "8050-09-07",
        "cins_no": "232-475-7",
        "molecular_formula": "C19H29COOH",
        "discription": "Gum rosin is the transparent light yellow or transparent yellow solid, it's derived from pine trees and some other plants, primarily conifers. It is produced by heating fresh liquid resin, which causes the volatile terpene components to evaporate. Rosin is brittle at room temperature but melts at relatively low temperatures, such as those achieved on a stove. Its primary chemical components are resin acids, especially abietic acid.. It is a kind of natural resin, mainly composed of various kinds of resin acids; it can be dissolved easily in many organic solvents, and has special chemical activity.",
        "typical_properties": "Transparent light yellow or transparent yellow solid, soluble in alcohol, benzene, ether. Insoluble in water.",
        "packing": "In 225kgs galvanized iron drum",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "It is an important raw material for the production of paper, coatings, inks, rubber, soaps, electronic industrial products, food grade ester gum, rosin ester resins etc."
    },
    {
        "name": "Konjac gum",
        "cas_no": "37220-17-0",
        "cins_no": "253-404-6",
        "molecular_formula": "C24H42O21",
        "discription": "Konjac gum is derived from plants and is usually used in food products such as vegetarian and meat substitutes, dairy products, beverages, noodles, jellies, puddings, desserts, and meat products. Because of its thickening, gelling, water-holding and water-retaining property, it can prevent the loss of juice in meat products, make the meat texture firm, and extend the shelf life; in jelly products it can for elastic texture when combine with Carrageenan.",
        "typical_properties": "White powder, soluble in water, insoluble in ethanol. Water solution is alkaline.",
        "packing": "In 25Kgs kraft paper bag",
        "food_idustry": "Used in dairy food, meat food, baked food, pasta food, seasoning food, etc.",
        "pharmaceutical_industry": "Health food, fillers, pharmaceutical raw materials, etc.",
        "other_industries": "1. Industrial manufacturing:   Petroleum industry, manufacturing industry, agricultural products, batteries, precision castings, etc.\n2. Cosmetics:                           Facial cleanser, beauty cream, lotion, shampoo, facial mask, etc.\n3. Feed:                                    Pet canned food, animal feed, aquatic feed, vitamin feed products, etc."
    },
    {
        "name": "L-tartaric acid",
        "cas_no": "87-69-4",
        "cins_no": "201-766-0",
        "molecular_formula": "C4H6O6",
        "discription": "L(+)-Tartaric Acid is one of the popular food additives and ingredients in most countries. Tartaric acid is found in many plants, such as grapes, bananas and tamarind, and is also one of the main organic acids in wine. It is often combined with baking soda to act as a leavening agent for flour. It can also be used as an antioxidant additive in food to give food a sour taste.",
        "typical_properties": "L(+)-Tartaric acid is colorless or translucent crystals, or a white, fine granular, crystalline powder. It is odorless, has an acid taste, and is stable in air. storage.",
        "packing": "In 25kgs kraft paper bag",
        "food_idustry": "L(+)-tartaric acid is widely used as an acidulant for beverages and other foods, including wine, soft drinks, candy, bread, and certain jelly-like sweets.\n",
        "pharmaceutical_industry": "",
        "other_industries": "It is mainly used as an acidulant, splitting agent, and pharmaceutical raw material."
    },
    {
        "name": "Lactic Acid",
        "cas_no": "50-21-5",
        "cins_no": "200-018-0",
        "molecular_formula": "C3H6O3",
        "discription": "Lactic Acid as a colorless liquid, industrial products is colorless to pale yellow liquid. Odorless, hygroscopic. Lactic Acid as a food additive widely used in food, medicine, agriculture, cosmetics, industrial and so on.",
        "typical_properties": "Colorless liquid, odorless, hygroscopic. Melting point 18℃. Boiling point 122℃. Miscible with water, ethanol, glycerol, aqueous solution is acidic, insoluble in chloroform, carbon disulfide and petroleum ether.",
        "packing": "In 25/250 kgs in plastic drum",
        "food_idustry": "Lactic acid is present in sour milk and dairy products such as cheese, yogurt, and koumiss, leban, wines. Lactic acid causes tooth decay since lactic acid bacteria operates in the mouth.",
        "pharmaceutical_industry": "Lactic acid takes roles in metabolic processes in the body; in red blood and in skeletal muscle tissues as a product of glucose and glycogen metabolism. Lactic acid is an \"\"alpha hydroxy acid: which has a hydroxyl group on the carbon atom next to the acid group.",
        "other_industries": ""
    },
    {
        "name": "Magnesium Chloride",
        "cas_no": "7791-18-6",
        "cins_no": "232-094-6",
        "molecular_formula": "Mgcl2. 6H2O",
        "discription": "Magnesium Chloride is recognized by many medical professionals as the “Master Magnesium Compound” for both dietary and topical uses, due to its high potency and efficient action.",
        "typical_properties": "White globular,soluble in water, easy to be damp in damp air, explodes hydrogen chloride and magnesium oxide at high temperature.",
        "packing": "In 25kg bag, 1000kg jumbo bag.",
        "food_idustry": "Used as food additives, protein curing agent, snowmelt agent, frozen agent and dustproof agent, refractory materials, etc.",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Maltodextrin",
        "cas_no": "9050-36-6",
        "cins_no": "232-940-4",
        "molecular_formula": "C12H22O11",
        "discription": "Maltodextrin is derived from starch and is found as a white hygroscopic spray-dried powder.   It's used in processed foods as a thickener or a filler, it contains fewer calories than sugar. Dextrin forms a strongly adherent paste when mixed with water and it is\nused as adhesive in the manufacture of gummed tapes, textiles and paper, also can be used for producing nutritional products.\n",
        "typical_properties": "Maltodextrin consists of D-glucose units connected in chains of variable length. The glucose units are primarily linked with\nα(1→4) glycosidic bonds. Maltodextrin is typically composed of a mixture of chains that vary from three to seventeen glucose\nunits long.\nMaltodextrins are classified by DE (dextrose equivalent) and have a DE between 3 to 20. The higher the DE value, the shorter\nthe glucose chains, the higher the sweetness, the higher the solubility and the lower heat resistance. Above DE 20, the European\nUnions CN code calls it glucose syrup, at DE 10 or lower the customs CN code nomenclature classifies maltodextrins as dextrins.\nMaltodextrin can be enzymatically derived from any starch. In the US, this starch is usually corn; in Europe, it is commonly wheat.\nWhile wheat-derived maltodextrin may cause concern for individuals suffering from gluten intolerance, maltodextrin is such a\nhighly processed ingredient that the majority of the protein is removed, rendering it effectively gluten-free.\nIf wheat is used to make maltodextrin, it will appear on the label. Even so, the maltodextrin itself will be gluten-free.\nMaltodextrin is sometimes used in beer brewing to increase the specific gravity of the final product.\nThis improves the mouthfeel of the beer and reduces the dryness of the drink. Maltodextrin is not fermented by the yeast\nand has no flavor.\n",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "Maltodextrin is widely used in beverages, frozen foods, candies, cereals, dairy products, health products and other industries.",
        "pharmaceutical_industry": "",
        "other_industries": "It can also be used in textile and daily chemical production."
    },
    {
        "name": "Mannitol",
        "cas_no": "87-78-5",
        "cins_no": "201-770-2",
        "molecular_formula": "C6H14O6",
        "discription": "Mannitol is a hexanol with a sweet taste. Because of the absorption of heat during the dissolution, it has a comfortable feeling to the mouth, so it is widely used in the manufacture of chewing tablets such as antialcoholic medicine and mouth cooling agent Mannitol granules are used as excipients for direct compression in tablets and Mannitol can be used as base materials for nitroglycerin tablets.\n",
        "typical_properties": "White crystals or crystalline powder, odorless, sweet. This product is easily soluble in water, slightly soluble in ethanol,\nand almost insoluble in ether.",
        "packing": "In 25kg/drum, 25kg/carton\n",
        "food_idustry": "Mannitol as food additives, are allowed in the cold drinks, cakes, fruit juice, biscuits, bread, pickles, candy, can\naccording to production needs to determine the dosage, When manufacturing suspended juice drinks or lactic\nacid drinks, add Mannitol to replace part of sugar, can make the drink taste full lubrication.",
        "pharmaceutical_industry": "Mannitol is used as raw materials for large volume parenterals, to produce Mannitol Injection, which has the efficacy of reducing intracranial pressure, intraocular pressure and diuresis. As filler and excipient Mannitol is used in tablets for Anticancer medicine, Antibacterial medicine. Antihistamines medicine, Vitamins, Antialcoholic medicine, Refreshing agent. As cerebral vasodilator, Mannitol is for the treatment of cerebral vascular infarction, As diuretics, Mannitol is a mild laxative, it has special effects on oliguria and renal function deline caused by edema and burns.",
        "other_industries": ""
    },
    {
        "name": " Menthol Crystals",
        "cas_no": "89-78-1",
        "cins_no": "201-939-0",
        "molecular_formula": "C10H20O",
        "discription": "Menthol Crystals is extracted from peppermint, which is also known as Mentha piperita, brandy mint, and lamb mint. Menthol Crystals has been used for liver and gallbladder complaints, loss of appetite, nausea, vomiting, respiratory infections, menstrual cramps, toothache, the common cold, cough, and fever. Topically, Menthol Crystals has been used for muscle and nerve pain and as an antiseptic.\n",
        "typical_properties": "It is a colorless needle-shaped or prismatic crystal or white crystalline powder. It has a special mint aroma, which tastes hot at first and cools down later. Its ethanol solution shows a neutral reaction. It is very soluble in ethanol, chloroform, ether, liquid paraffin or volatile oil, and very slightly soluble in water.",
        "packing": "In 25kgs drum",
        "food_idustry": "It is widely used in daily flavors, edible flavors, and tobacco flavors.",
        "pharmaceutical_industry": "Menthol and racemic menthol are used as flavoring agents for toothpaste, perfume, beverages and candies. In medicine, it is used as a stimulant, acting on the skin or mucous membranes, with a cooling and antipruritic effect; it can be taken internally as a carminative for headaches and inflammation of the nose, pharynx and throat. Its esters are used in spices and medicines.\n",
        "other_industries": " It is used as a special additive for therapeutic cosmetics. It is used in floral water, etc. It can also be used as a flavoring agent for toothpaste, perfume, beverages and candies. It is used to make candies, beverages, spices and medicinal."
    },
    {
        "name": "Monosodium Glutamate",
        "cas_no": "6106-04-03",
        "cins_no": "612-072-6",
        "molecular_formula": "C5H12NNaO5",
        "discription": "Monosodium glutamate (MSG), also known as sodium glutamate, is a sodium salt of glutamic acid. MSG is found naturally in some foods including tomatoes and cheese in this glutamic acid form. MSG is used in cooking as a flavor enhancer with a savory taste that intensifies the umami flavor of food, as naturally occurring glutamate does in foods such as stews and meat soups.\n",
        "typical_properties": "White or colorless crystals or crystalline powder. With a good water-soluble, can be dissolved in 100 ml of water.\n",
        "packing": "In 25kg kraft paper bag\n",
        "food_idustry": "Monosodium glutamate (MSG) is a flavor enhancer often added to restaurant foods, canned vegetables, soups, deli meats and other foods. ",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Parabens (Sodium citrate dihydrate)",
        "cas_no": "6132-04-03",
        "cins_no": " 200-675-3",
        "molecular_formula": "  C6H9Na3O9",
        "discription": "Benzoic acid derivatives substituted by hydroxy group or ether containing oxygen atom have active bacteriostatic and\nfragrant properties. They are typically used in pharmaceutical and perfumery industry. They are used as intermediates for pharmaceuticals (especially for antipyetic anlgesic, antirheumatism) and other organic synthesis. They are used as matrix for ionization of peptides, proteins and carbohydrates.",
        "typical_properties": "Colorless crystals or white crystalline powder, odorless, with a cool and salty taste, melting point 300°C, water solubility 720g/L (25°C).Easily soluble in water and glycerin, insoluble in ethanol, poorly soluble in alcohols and other organic solvents.",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "This product is used as a seasoning and stabilizer in food processing, as a buffer and secondary chelating agent in the non-toxic electroplating industry, as an anticoagulant, expectorant and diuretic in the pharmaceutical industry, and is also used in brewing, injection, and imaging drugs."
    },
    {
        "name": "Pectin",
        "cas_no": "900-69-5",
        "cins_no": "232-553-0",
        "molecular_formula": "",
        "discription": "Pectin is an ingredient and a natural component of plants. Pectin occurs in many fruits but is especially abundant in apples and citrus fruits. Fruit pectin is associated with cellulose in plant tissues, where it plays a fundamental role in determining their mechanical properties.\nPectin, as a food ingredient, can be used as a gelling agent, thickening agent and stabilizer in food applications.",
        "typical_properties": "White to pale yellow powder, slightly sour, water-soluble.\n",
        "packing": "In 25kg/drum\n",
        "food_idustry": " Food thickener: Pectin is commonly used in food as a gelling agent and thickener. It is particularly useful in making jams, jellies, and fruit preserves.",
        "pharmaceutical_industry": "1. Constipation relief: Pectin has a mild laxative effect and can help relieve symptoms of constipation.\n2. Cholesterol reduction: Pectin can bind with cholesterol in the intestine, reducing its absorption and potentially lower blood cholesterol levels.\n3. Blood sugar control: Pectin can slow down the absorption of carbohydrates, which can help regulate blood sugar levels in people with diabetes.\n4. Wound healing: Pectin has been shown to accelerate the healing of certain types of wounds, possibly by promoting cell growth.",
        "other_industries": "Industrial uses: Pectin is used in the industrial production of textiles, paper, and cosmetics."
    },
    {
        "name": "Potassium Chloride",
        "cas_no": " 7447-40-7",
        "cins_no": "233-211-8\n",
        "molecular_formula": "ClK",
        "discription": "Potassium Chloride is a metal halide salt composed of potassium and chloride. It is odorless and has a white or colorless vitreous crystal appearance. The solid dissolves readily in water and its solutions have a salt-like taste. KCl is used in medicine, scientific applications, food processing. It occurs naturally as the mineral sylvite and in combination with sodium chloride as sylvinite.\n",
        "typical_properties": "White or colorless crystals or crystalline powder. With a good water-soluble, can be dissolved in 100 ml of water.",
        "packing": "In 25kg bag\n",
        "food_idustry": "Can be used as nutrition enhancers; gelling agents; salt substitutes; yeast food; it is similar to table salt to use as flavour enhancers for the agricultural product, livestock forming product, condiment, can,convenient food and so on, And also to use as enhance the potassium to prepare athletes beverage.",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Potassium sorbate",
        "cas_no": "590-00-1",
        "cins_no": "611-771-3",
        "molecular_formula": "C6H7KO2",
        "discription": "Potassium sorbate is used as a preservative in many foods because its antimicrobial properties prevent the growth and spread of harmful bacteria and mold. It is used in cheeses, baked goods, syrups, and jams. It is also used as a preservative in dehydrated foods, such as jerky and dried fruit, because it does not leave an aftertaste. Potassium sorbate is used to extend the shelf life of foods, so many dietary supplements also contain it. It is often used in wine production because it prevents yeast from continuing to ferment in the bottle.\n",
        "typical_properties": "White to light yellow crystal particles or scaly crystals or powder, slightly odorous or odorless, easily soluble in water, also soluble in ethanol, etc.\n",
        "packing": "In 25 kg cardboard carton\n",
        "food_idustry": "Potassium sorbate is the least toxic food preservative and is widely used in food and feed processing industries. ",
        "pharmaceutical_industry": "",
        "other_industries": "It is also used in cosmetics, cigarettes, resins, spices, rubber and other industries."
    },
    {
        "name": " Propyl P-Hydroxybenzoate",
        "cas_no": "0127-08-02",
        "cins_no": " 202-307-7",
        "molecular_formula": "C10H12O3",
        "discription": "Propyl p-hydroxybenzoate is an organic compound with the molecular formula C10H12O3. It is a small colorless crystal or white powder. It is almost insoluble in cold water. It is odorless and slightly astringent. It is esterified by p-hydroxybenzoic acid and n-propanol in the presence of sulfuric acid, and then neutralized, washed, dried and refined into a finished product. It is mainly used as a preservative for food, cosmetics, feed, etc. It can improve the preservative ability and solubility when used in combination with ethyl p-hydroxybenzoate.\n",
        "typical_properties": "It is white crystalline and easily dissolved in alcohol and ether, but not dissolved in water. Its relative density (d102 4) is 1.0630 and index of refraction is (nD102) 1.5050\n",
        "packing": "10kgs or 25kgs cardboard drum. It is also packed in carton containing 20 plastic bags, 1 kg per bag.\n",
        "food_idustry": "",
        "pharmaceutical_industry": "This product is mainly used as antiseptics in foodstuff, medicine and cosmetics. It can also be used in feed as antiseptics.\n",
        "other_industries": ""
    },
    {
        "name": " SAPP (Sodium acid pyrophosphate)",
        "cas_no": "7758-16-9",
        "cins_no": "231-835-0",
        "molecular_formula": "Na2H2P2O7",
        "discription": "SAPP( Sodium acid pyrophosphateI) is acted as a buffer, leaven, modifier, emulsifier, nutrient and canning preservative in foods, oil drilling, detergent, chemical stabiliser.\n",
        "typical_properties": "White powder, soluble in water, insoluble in ethanol. Water solution is alkaline.\n",
        "packing": "In 25Kgs/bag, in woven or kraft paper bags with inner bag, or as customer's requirements.\n",
        "food_idustry": "SAPP is used as improving agent in food industry, pH regulating agent, metal ion complex agent, emulsion, dispersing agent and adhesive agent.",
        "pharmaceutical_industry": "",
        "other_industries": " It is applied in the processing of meat and aquatic products in order to hold water, keep the meat fresh and tender, stabilize the natural color and prevent fat from putridity. Also used in the production of yeast powder and cheese etc."
    },
    {
        "name": "SHMP (Sodium Hexametaphosphate)",
        "cas_no": "10124-56-8",
        "cins_no": " 233-343-1",
        "molecular_formula": "H7NaO18P6",
        "discription": "Sodium Hexametaphosphate, also known as SHMP, is a white, odorless, crystalline powder that is commonly used as a sequestrant, emulsifier, and thickening agent in the food industry. It is made up of a chain of six phosphates and is highly soluble in water.\nAs a sequestrant, SHMP helps to bind and remove metal ions that can cause discoloration, off-flavors, and other quality issues in food products. It is often used in canned fruits and vegetables, dairy products, and meat products to maintain color, flavor, and freshness.",
        "typical_properties": "White, odorless, crystalline powder, soluble in water, insoluble in organic solvents.\n",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "SHMP is used as an emulsifier in the food industry, helping to blend ingredients that would otherwise separate, such as oil and water. It is often used in salad dressings, sauces, and other processed foods to improve texture and consistency.\nSHMP is used as a thickening agent in some food products, such as canned soups and gravies. It helps to create a smoother texture and improve mouthfeel.\nOverall, Sodium Hexametaphosphate is a versatile ingredient that is widely used in the food industry for its sequestrant, emulsifying, and thickening properties. Its ability to improve texture, freshness, and shelf life make it an important ingredient in many different types of food products.\n",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": " Sodium acetate",
        "cas_no": "0127-09-03",
        "cins_no": "204-823-8",
        "molecular_formula": "C2H3NaO2",
        "discription": "Sodium acetate is an organic substance that can be used as a buffer, mordant, for the determination of lead, copper, nickel, and iron, culture medium preparation, organic synthesis, and film printing.\n",
        "typical_properties": "Colorless and odorless, transparent crystals or white granules, easily soluble in water, slightly soluble in ethanol and ether.\n",
        "packing": "In 25kg bag\n",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "Sodium acetate is used as buffers in petroleum production and drilling muds, in food preservations, and in electroplating. It is used as a retardant in elastomer industry. It is used in tanning to effect a more even and rapid penetration of the tan in the leather industry. It is also used as a mordant in dyeing processes. Sodium Acetate is an intermediate to manufacture organic compounds like dyes, pigments, pharmaceuticals, cinnamic acid. It is also used in soap industry and purification of glucose."
    },
    {
        "name": "Sodium benzoate",
        "cas_no": " 532-32-1",
        "cins_no": "208-534-8",
        "molecular_formula": "C7H5NaO2",
        "discription": "Sodium Benzoate is an important acid food preservative. It is naturally in cranberries, prunes, cinnamon, cloves, can be used for frozen fish sticks, fish fillets, fish paste products, but not for meat products.When used, it is converted into an effective form of Benzoic Acid. In addition, it can also be used as a preservative for feed. Also used in the pharmaceutical industry, a mordant in the dye industry, a plasticizer in the plastic industry, and also as an intermediate in organic synthesis such as spices, as Co-solvent for serum bilirubin test, Fungicide, Preservative, Dye intermediates, Polymer additives, etc.\n",
        "typical_properties": "White crystalline (powder/ granular/column), easily soluble in water, the aqueous solution is weakly alkaline, pH 8, slightly soluble in ethanol.\n",
        "packing": "In 25kgs/bag,500kg/bag,1000kg/bag, PP open bag with PE inner, super sack\n",
        "food_idustry": ".Sodium benzoate has the effect of sterilization and inhibiting bacterial growth. The change of pH value has a great influence on its effect. The effect is best when the pH value is 2.5-4.5, and it is significantly reduced in alkaline medium. It is widely used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco leaves, and feed.",
        "pharmaceutical_industry": "Sodium benzoate can also be used to make various drugs to treat arthritis, abscesses, bronchitis, skin diseases, etc.",
        "other_industries": "Sodium benzoate has the effect of sterilization and inhibiting bacterial growth. The change of pH value has a great influence on its effect. The effect is best when the pH value is 2.5-4.5, and it is significantly reduced in alkaline medium. It is widely used as a preservative for food, medicine, cosmetics, toothpaste, spices, tobacco leaves, and feed.\n"
    },
    {
        "name": "Sodium bicarbonate",
        "cas_no": "144-55-8",
        "cins_no": "205-633-8",
        "molecular_formula": "NaHCO3",
        "discription": "Sodium bicarbonate, commonly called baking Soda. It can react as an acid or a base in water treatment. It is also used in treating wool and silk, fire extinguishers, pharmacy, leather, metallurgy, in cleaning preparations and industrial & chemical processes.\n",
        "typical_properties": "White crystalline powder. Odorless, salty, highly soluble in water. Easily hydrolyzed, the solution is weakly alkaline, unstable under heat, easy to decompose, and also slowly decomposes in humid air.\n",
        "packing": "In 25 kgs, 50 kgs, 1,000 kgs/bag\n",
        "food_idustry": "It is the most widely used leavening agent in the food industry. It is used to produce biscuits, cakes, steamed buns, bread, etc. It is a carbon dioxide generator in carbonated beverages. It can be compounded with alum to form alkaline baking powder, and it can also be compounded with soda ash to form civilian soda ash. It can also be used as a butter preservative.",
        "pharmaceutical_industry": "The pharmaceutical industry uses it as a raw material for acid makers.",
        "other_industries": "It is used in the production of acid-base fire extinguishers and foam fire extinguishers in fire fighting equipment. The rubber industry uses it in combination with alum and H pore-forming agent to produce uniform pores for rubber and sponge production. The metallurgical industry uses it as a flux for casting steel ingots. The machinery industry uses it as a molding aid for cast steel (sand casting) sand molds. The printing and dyeing industry uses it as a color fixative for dyeing and printing, an acid-base buffer, and a post-treatment agent for fabric dyeing and finishing."
    },
    {
        "name": "Sodium carbonate",
        "cas_no": "497-19-8",
        "cins_no": "207-838-8",
        "molecular_formula": "CH2O3.2Na",
        "discription": "Sodium carbonate commonly occurs as a crystalline heptahydrate, which readily effloresces to form a white powder, the monohydrate. Pure sodium carbonate is a white, odorless powder that is hygroscopic (absorbs moisture from the air). It has a strongly alkaline taste, and forms a moderately basic solution in water. Sodium carbonate is well known domestically for its everyday use as a water softener.",
        "typical_properties": "White powder, a strong electrolyte, easily soluble in water, and alkaline. It has the general properties of salt.\n",
        "packing": "In 25kg kraft paper bag",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": "The main industrial application areas of sodium carbonate are flat glass, daily glass, synthetic washing powder, neutralization of acidic waste, alumina and other industries.\nIn production and life, sodium carbonate is used to make pastries, prepare sodium hydroxide, etc., or as a formula for various detergents. It is used as a softener for water purification."
    },
    {
        "name": "   Sodium citrate dihydrate",
        "cas_no": "6132-04-03",
        "cins_no": "200-675-3",
        "molecular_formula": "C6H9Na3O9",
        "discription": "Sodium citrate dihydrate is the dihydrate of trisodium citrate. It has a role as an anticoagulant. It contains a sodium citrate. Sodium salts of citric acid that are used as buffers and food preservatives.\n",
        "typical_properties": "Colorless crystals or white crystalline powder, odorless, with a cool and salty taste, melting point 300°C, water solubility 720g/L (25°C).Easily soluble in water and glycerin, insoluble in ethanol, poorly soluble in alcohols and other organic solvents.\n",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "This product is used as a seasoning and stabilizer in food processing, as a buffer and secondary chelating agent in the non-toxic electroplating industry,",
        "pharmaceutical_industry": " as an anticoagulant, expectorant and diuretic in the pharmaceutical industry, and is also used in brewing, injection, and imaging drugs.",
        "other_industries": ""
    },
    {
        "name": "Sodium diacetate",
        "cas_no": "126-96-5",
        "cins_no": "204-814-9",
        "molecular_formula": "C2H5NaO2",
        "discription": "Sodium diacetate is a sodium acid salt of acetic acid which is used in candy, meat products, oil, snacks, soups. It is a white crystalline powder that have an odor of acetic acid. It is a flavoring compound that is used as an anti-microbial agent for meat products. As a food additive, sodium diacetate has E number E262 and it is used to impart a salt and vinegar flavor.\n",
        "typical_properties": "White crystalline granule or powder; With acetic acid smell. Deliquescent; Highly soluble in water (1g/ml), and create acetic acid with 42.25%. The PH value of aqueous solution with 10% is between 4.5 and 5.0. It will be broken up when heated to 150ºC. Flammable.\n",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "The main purpose of using it in food with its following 3 functions:\n1. a preservative to extend food shelf life in bread and meat.\n2. a flavoring agent to impart a vinegar taste in savory food.\n3. a solid source of free acetic acid to adjust the acidity of food.",
        "pharmaceutical_industry": "Sodium diacetate plays an important role in regulating the pH level of the dialysis solution. It also benefits clinics in storing, only to dissolve the dry mix, instead of having to store a liquid product.",
        "other_industries": "Feed:\nSodium diacetate can be used as a preservative in feed for poultry, pigs and pet animals.\nCosmetics:\nIt can function as a buffering and masking agents in cosmetic and personal care products."
    },
    {
        "name": "  Sodium metabisulfite",
        "cas_no": "  7681-57-4",
        "cins_no": " 231-673-0",
        "molecular_formula": "Na2S2O5",
        "discription": "Sodium metabisulfite, also known as sodium metabisulfite and sodium disulfite, has the chemical formula Na2S2O5. It is an inorganic compound that can be used as a disinfectant, antioxidant and preservative. It's s mainly used as reduction agent. Furthermore, sodium metabisulfite is ideal for the bleaching of vegetable fibers and textile, for the production of solutions, which are used in the developing of photos and films as well as for the treatment of tanning agents in dyeing of textiles.\n",
        "typical_properties": "White or slightly yellow crystals, soluble in water, the aqueous solution is acidic. It is also soluble in glycerol and slightly soluble in ethanol. It is easily oxidized to sodium sulfate in the air. It is easy to decompose when wet, and the melting point is 150°C. It reacts chemically with strong acids to produce sulfur dioxide and corresponding salts.\n",
        "packing": "In 25kgs/bag\n",
        "food_idustry": "Used as a preservative, antioxidant, and flour improver.",
        "pharmaceutical_industry": " Used to produce chloroform, phenylpropyl sulfone and benzaldehyde. Rubber industry uses it as a coagulant.",
        "other_industries": "Printing and dyeing industry: Used as a dechlorinating agent after cotton bleaching and a cotton scouring agent.\nLeather industry: Used for leather processing, which can make leather soft, plump, tough, waterproof, anti-bending, and wear-resistant.\nChemical industry: Used to produce hydroxyvanillin, hydroxylamine hydrochloride, etc.\nPhotosensitive industry: Used as a developer, etc."
    },
    {
        "name": "  Sodium Nitrate",
        "cas_no": " 7632-00-0",
        "cins_no": " 231-555-9",
        "molecular_formula": "NaNO2",
        "discription": "Sodium nitrate is the chemical compound with the formula NaNO\n3. This alkali metal nitrate salt is also known as Chile saltpeter (large deposits of which were historically mined in Chile)to distinguish it from ordinary saltpeter, potassium nitrate. The mineral form is also known as nitratine, nitratite or soda niter.\n",
        "typical_properties": "White or colorless powder, soluble in water and liquid ammonia, soluble in ethanol, methanol, slightly soluble in glycerol and acetone. It is an oxidant and will burn and explode when in contact with organic matter, sulfur, etc. When heated to 380°C, it begins to decompose into sodium nitrite and oxygen.",
        "packing": "In 1kg/bag, 25 kg/bag, 25 kg/drum.\n",
        "food_idustry": "It is used as colorant, anti microbial agent and preservative in meat products processing.",
        "pharmaceutical_industry": "t is used as laboratory analytical reagents.",
        "other_industries": "1. It is used as mordants for fabric dyeing.                                            2.It is used as bleaching agents for silk and flax.                                3.It is used as metal heat treatment agent.                                       4.It is used as corrosion inhibitor for steel."
    },
    {
        "name": "Sorbic acid",
        "cas_no": "110-44-1",
        "cins_no": "203-768-7",
        "molecular_formula": "C6H8O2",
        "discription": "Sorbic acid as a white needle crystal or powder, slightly soluble in water, soluble in various organic solvents. The FAO and WHO recommended safe and efficient preservative, widely used in food, beverages, tobacco, pesticides, cosmetics, agricultural, and other industries. As the unsaturated acid can also be used for resins, spices and rubber industry.\n",
        "typical_properties": "White needle crystal or powder, slightly soluble in water, soluble in various organic solvents.\n",
        "packing": "In 25kgs kraft paper bag, 25kgs carton\n",
        "food_idustry": "Widely used in food, beverage, pickles, tobacco, medicine, cosmetics, agricultural products and other industries. ",
        "pharmaceutical_industry": "",
        "other_industries": "Also used in the preparation of preservatives, mildew inhibitors, insecticides and synthetic rubber industry. Inhibitors of mold and yeast. Food mildew inhibitor. Dry oil denaturant. Bactericide."
    },
    {
        "name": " D-Sorbitol",
        "cas_no": "50-70-4",
        "cins_no": "   200-061-5",
        "molecular_formula": "C6H14O6",
        "discription": "Sorbitol is a type of carbohydrate that falls into a category of sugar alcohols called polyols. It's found in some fruits and is also   commercially manufactured to preserve moisture and add sweetness. It is colorless, odorless, clear and sweet. It is a thick liquid or white crystalline powder with excellent freshness, fragrance, color and moisture retention properties. It is widely used in food, medicine, chemical and other industries.\n",
        "typical_properties": "As a white crystalline powder, odorless, taste slightly sweet, slightly hygroscopic. Soluble in water, soluble in ethanol. 5.48% aqueous solution of isotonic solution. Injection system: colorless clear liquid.\n",
        "packing": "Powder:   25kg/bag\nLiquid:     250 or 270kg/steel drum",
        "food_idustry": "All kinds of candies: good taste, anti-cracking, anti-oxidation, quality preservation, fragrance preservation, sugar-free.\nAll kinds of cakes and biscuits: good flavor, anti-cracking, extended storage period, appearance preservation, sugar-free.\nFish products: good freezing protection, good moisturizing effect, low sweetness, anti-browning.\nBeverages, ice cream, jelly, etc.: moisturizing, low sweetness, anti-caries, sugar-free.                      ",
        "pharmaceutical_industry": "As raw material for vitamin C production.\nAs raw material for syrup, injection infusion, and pharmaceutical tableting.\nAs drug dispersant, filler, cryoprotectant, anti-crystallization agent, wetting agent, sweetener.",
        "other_industries": "Used in the production of surfactants such as Span and Tween, polyether, and plastic additives."
    },
    {
        "name": " Stearic acid",
        "cas_no": "57-11-4",
        "cins_no": "266-928-5",
        "molecular_formula": "C18H36O2",
        "discription": "Stearic acid, another name for octadecanoic acid CH3(CH2)16COOH, is one of the most common fatty acids. It exists as a glycerol ester in most animal and plant fats (Beare-Rogers, Dieffenbacher, & Holm, 2001). It is an ingredient found in skin care products for protection against dryness or irritation.\n",
        "typical_properties": "A waxy solid that is insoluble in water, with the chemical formula C18H36O2. It is soluble in ethanol and acetone, and easily soluble in solvents such as ether, chloroform, carbon tetrachloride, benzene and carbon disulfide.\n",
        "packing": "In 25 kgs kraft paper bag\n",
        "food_idustry": "The products in the food industry as a lubricant, defoaming agent and food additive monostearate, stearic acid, sorbitan esters, sucrose ester as raw material. Used as auxiliary raw materials and chemical products for daily use of raw materials.\n",
        "pharmaceutical_industry": "In addition, also can be used as oil soluble pigment solvent, crayons, paper lighting agent transfer slip agent, stearic acid glyceride emulsifier etc..",
        "other_industries": "It is widely used for cosmetics, plastic cold resistant plasticizer, release agent, stabilizer, surfactant, rubber vulcanization accelerator, waterproofing agent, polishing agent, metal soap, metal mineral flotation agent, softener, pharmaceuticals and other organic chemicals."
    },
    {
        "name": "Stevia",
        "cas_no": "  57817-89-7",
        "cins_no": " 1592732-453-0",
        "molecular_formula": "C38H60O18",
        "discription": "Stevia known as sweetleaf, sweet leaf, sugarleaf, or simply stevia. It is widely grown for its sweet leaves. As a sweetener and sugar substitute, stevia's taste has a slower onset and longer duration than that of sugar. Stevia has garnered attention with the rise in demand for low-carbohydrate, low-sugar food alternatives.\n",
        "typical_properties": "White or slightly yellow powder. Soluble in water, ethanol and methanol, insoluble in benzene, ether, chloroform and other organic solvents\n",
        "packing": "Coextruded paper bags lined with polyethylene film bags-Net weight 25 kg.This product could also be packed according to\ncustomer's needs.",
        "food_idustry": "Stevioside and steviol bioside A can be used in ice cream and soft drinks; stevioside is used to enhance the sweetness of chlorinated sucrose, aspartame and sodium cyclamate; steviol glycosides and their salts can be used to ripen fruits and vegetables; stevioside is added to food, beverages or pharmaceuticals as an aromatic flavor enhancer; and is used for salt-free storage of food. Stevioside is used together with lactose, maltose syrup, fructose, sorbitol, maltitol and lactulose to make hard candies. Stevioside can be used to produce chewing gum and bubble gum, and can also be used to produce candies with various flavors, such as soft candies with papaya, pineapple, guava, apple, orange, grape or strawberry flavors. Stevioside can also be mixed with sorbitol, glycine, alanine, etc. to produce cake flour. Because stevioside is heat-stable, it is particularly suitable for this purpose.\nVarious soft drinks, such as low-energy cola drinks, can also be sweetened by compounding stevioside and high fructose syrup. Stevioside can also be used in solid beverages, health drinks, liqueurs and coffee.",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "STMP  (Sodium Trimetaphosphate)",
        "cas_no": "7785-84-4",
        "cins_no": "232-088-3",
        "molecular_formula": "Na3P3O9",
        "discription": "Sodium Trimetaphosphate, also known as STMP, is used in detergent processing, water softeners, sequesterants, emulsifiers, food additives, textile processing, and laundering.\n",
        "typical_properties": "White powder crystals, soluble in water, insoluble in alcohol.\n",
        "packing": "In 25kg/bag, 1000kg jumbo bag\n",
        "food_idustry": "Used in the food industry as a starch modifier, juice turbidity preventer, meat binder, dispersant and stabilizer (for ice cream, cheese, etc.). It can prevent food from discoloring and prevent decomposition of vitamin C.",
        "pharmaceutical_industry": "Starch modifier; juice turbidity inhibitor; water retention agent; water softener; meat binder; dispersant; stabilizer (used in ice cream, cheese, etc.); it can prevent food discoloration and vitamin C decomposition.",
        "other_industries": " It can be added to gypsum board and used to produce low-density washing powder, and can also be used to produce dry bleach and automatic dishwashing detergent."
    },
    {
        "name": "STPP (Sodium tripolyphosphate)",
        "cas_no": "7758-29-4",
        "cins_no": " 231-838-7",
        "molecular_formula": "Na5O10P3",
        "discription": "Sodium tripolyphosphate (STPP) — is widely used as a component for the production of synthetic detergents, water treatment, as well as in the ceramic, paint, varnish and other industries.\n",
        "typical_properties": "White powder, Odorless, soluble in water\n",
        "packing": "In 25kgs/bag, in woven or kraft paper bags with inner bag, or as customer's requirements.\n",
        "food_idustry": "STPP as a multifunctional food additive, it is widely used in the field of food processing. Sodium tripolyphosphate is particularly used in meat and fish products.",
        "pharmaceutical_industry": "",
        "other_industries": " It is mainly used as a moisture retaining agent, quality improver, pH regulator, and metal chelating agent, which can significantly improve the taste and quality of products."
    },
    {
        "name": " Succinic acid",
        "cas_no": " 1210-15-6",
        "cins_no": "203-740-4",
        "molecular_formula": "C4H6O4",
        "discription": "Succinic acid, also known as butyric acid, is a dicarboxylic acid. An important use of succinic acid is to prepare five-membered heterocyclic compounds. For example, succinic acid loses water rapidly when heated to form succinic anhydride, which is a furan ring compound. Succinic anhydride is an important raw material for manufacturing drugs, dyes and alkyd resins. Succinic anhydride and ammonia are heated together to form succinimide. The hydrogen on the imino group of succinimide can be replaced by bromine to form N-bromosuccinimide, which is a brominating agent and mild oxidant for organic synthesis. Succinic acid has antispasmodic, expectorant and diuretic effects in medicine. Diethyl succinate is an important intermediate in organic synthesis. Dibutyl succinate and dioctyl succinate are plasticizers for plastics. Diallyl succinate is copolymerized with 1,3-butadiene to make artificial rubber.\n",
        "typical_properties": "Colorless crystals, flammable, soluble in water, ethanol, ether, insoluble in carbon tetrachloride.\n",
        "packing": "In 25 kgs bag，1,000 kgs jumbo bag\n",
        "food_idustry": "Succinic acid is commonly used in various industries. Used as an intermediate in the production of various chemicals. Also used in the food industry as a flavoring agent and acidity regulator.",
        "pharmaceutical_industry": "In the pharmaceutical industry, succinic acid is used as an excipient in the formulation of drugs. It can be used as a pH regulator, buffering agent, and solubilizing agent. The mechanism of action in pharmaceutical applications involves succinic acid's ability to maintain the stability and efficacy of drugs",
        "other_industries": ""
    },
    {
        "name": "Taurine",
        "cas_no": "  107-35-7",
        "cins_no": " 203-483-8",
        "molecular_formula": "C2H7NO3S",
        "discription": "Taurine exists in almost all organisms among the mammals of the major organs, such as: heart, brain, liver and higher levels; Taurine is the most abundant fish, shellfish class, such as cuttlefish, octopus, shrimp, shellfish, oysters, conch, clams, etc. Fish in the mackerel, horse mackerel, sardines and other Taurine content is very rich. In fish, the fish back blackened parts Taurine levels are more. It can prevent cardiovascular disease and improve the endocrine status, and enhance the body immunity, anti-fatigue,\nsuppress the development of cataracts, has a strong role in health care.",
        "typical_properties": "White crystals or crystalline powder, odorless, chemically stable, soluble in organic solvents such as ether.\n",
        "packing": "In 25kgs/drum\n",
        "food_idustry": "Taurine, as a product of methionine and cysteine metabolism, functions\nin a wide array of animals' (including human) metabolic physical phenomena. It is also known as it reduces blood sugar level.\nTaurine is used as a functional food in many energy drinks and energy products.",
        "pharmaceutical_industry": "In medicine, taurine is contained in some drugs for common cold, fever, neuralgia, tonsillitis, bronchitis, rheumatic arthritis, eye disease and medicine poisoning.",
        "other_industries": ""
    },
    {
        "name": "Tomato paste",
        "cas_no": "7447",
        "cins_no": "",
        "molecular_formula": "",
        "discription": "Tomato Paste, the ripened tomatoes are processed through series of steps where they are selected, washed, crushed and blanched to deactivate the enzymes. The foreign content from tomato paste, like the skin and seeds is discarded and finally passed through concentrating machine to reduce the water content through evaporation process.\n",
        "typical_properties": "We offer a full variety of private label tomato paste. All our tomato pastes are made from 100% tomato, no additives or preservatives. We can offer existing brands tomato paste or private label tomato paste. We can also formulate the tomato paste to your local needs in terms of color, taste and price.\nWe can offer all kinds of tomato paste brix, specification and color, from bright red to dark brown.\nWe can offer brix: 18-20, 28-30, 30-32, 36-38.",
        "packing": "In aseptic bag in iron drums of about 235kg net each, 4drums on one pallet, 80drums in one 20'FCL.",
        "food_idustry": "",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Triacetin",
        "cas_no": "  102-76-1",
        "cins_no": "203-051-9",
        "molecular_formula": "C9H14O6",
        "discription": "Triacetin is used in perfumery and cosmetics for these applications. Used as an antifungal agent in external medicine for topical treatment of superficial fungal infections of the skin. It is applied to cigarette filter as a plasticizer. Used as a gelatinizing agent in explosives.",
        "typical_properties": "Colorless liquid; slight fatty odor; bitter taste. Slightly soluble in water; very soluble in alcohol, ether, and other organic solvents. Combustible.",
        "packing": "240 kgs in drum/1,150 kgs IBC drum\n",
        "food_idustry": " Food additives for candy, butter, beverages, etc.                                                                                               Plasticizer for chewing gum.                                                                                                                                Stabilizer for baked goods Emulsifier for dairy products.                  ",
        "pharmaceutical_industry": "Medicines (antifungal agents) and capsules (plasticizers).",
        "other_industries": "Fixative for flavors and fragrances.Additives for animal feed.  Pesticide excipients."
    },
    {
        "name": "TSPP (Tetrasodium Pyrophosphate)",
        "cas_no": "7722-88-5",
        "cins_no": " 231-767-1",
        "molecular_formula": "Na4O7P2",
        "discription": "Tetrasodium Pyrophosphate is a white, odorless powder that is commonly used as a food additive and a detergent builder. It is made up of four sodium ions and two phosphate ions and is highly soluble in water.\nIt is a versatile ingredient that is widely used in the food and cleaning industries for its sequestrant, emulsifying, thickening, and detergent-building properties. Its ability to improve texture, freshness, and cleaning effectiveness make it an important ingredient in many different types of product.",
        "typical_properties": "White powder ,soluble in water,insoluble in ethanol. basic property appeared in aqueous solution.it is liable to deliquesce by moisture in the air.",
        "packing": "In 25kgs bag\n",
        "food_idustry": "As an emulsifier, Tetrasodium Pyrophosphate helps to combine ingredients that would normally separate, such as oil and water. This property makes it a valuable ingredient in salad dressings, sauces, and other food products. Tetrasodium Pyrophosphate is also used as a thickening agent in many different types of food products, such as canned soups, gravies, and sauces. Its ability to improve texture and consistency makes it an important ingredient in these products. Tetrasodium Pyrophosphate is often used as a sequestrant in food products to bind and remove metal ions that can cause discoloration, off-flavors, and other quality issues. It is commonly used in processed meats, canned fruits and vegetables, and dairy products to maintain color, flavor, and freshness.",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Vanillin",
        "cas_no": "121-33-5",
        "cins_no": "204-465-2",
        "molecular_formula": "C8H8O3",
        "discription": "Vanillin as a white needle crystal. Aromatic odor. Used as food flavors, cosmetic fragrance, pharmaceutical intermediates.\n",
        "typical_properties": "White crystal powder, 1g sample can dissolved in 3ml 70% alcohol\n",
        "packing": "In 500g/bag ;25kg/drum\n",
        "food_idustry": "It is one of the important edible spices, is a food flavoring agent, a vanilla bean aroma and strong desire for milk, Vanillin is the indispensable food additives industry important raw material, widely used in a variety of need to increase the milk flavor flavoring foods such as cakes, cold drinks, chocolate, confectionery, biscuits, instant noodles, bread and tobacco, perfumery alcohol, toothpaste, soap, perfume, cosmetics, ice cream , beverage and household and cosmetic set fragrant aroma from the role.",
        "pharmaceutical_industry": "Vanillin can be used for soap, toothpaste, perfume, rubber, plastics, pharmaceuticals.",
        "other_industries": ""
    },
    {
        "name": "Vital wheat gluten",
        "cas_no": " 8002-80-0",
        "cins_no": "232-317-7",
        "molecular_formula": "",
        "discription": "Vital wheat gluten is also called active gluten powder, wheat gluten, from wheat (flour) in the natural protein extracted from a variety of amino acid composition, protein content as high as 75% to 85% , contains 15 kinds of amino acids the human body must.\n",
        "typical_properties": "Grain protein in pale yellow powder form, insoluble in water and anhydrous ethanol, but soluble in 70% to 80% ethanol solution.\n",
        "packing": "In 25kgs kraft paper bag\n",
        "food_idustry": "Vital wheat gluten is a good dough conditioner, is widely used in bread, noodles, instant noodles production, and meat products can also be used as a water retention agent, but also high-grade fish feed the basic raw material. It is to increase the protein content of plant foods effective way.",
        "pharmaceutical_industry": "",
        "other_industries": ""
    },
    {
        "name": "Xanthan gum",
        "cas_no": "11138-66-2",
        "cins_no": " 234-394-2",
        "molecular_formula": "C8H14Cl2N2O2",
        "discription": "Xanthan gum is produced from the fermentation of carbonhydrate with Xanthomonas campestris. It is used as a rheology control agent in aqueous systems and as a stabilizer for emulsions and suspensions, it's performance is one of the most superior biological glue. It's widely used in food processing, oil drilling, pesticides, seeds, coating, feed, daily chemicals, textile printing and dyeing, papermaking, tobacco, casting, fire fighting and many other industries.\n",
        "typical_properties": "Xanthan gum has the characteristics of efficient thickening, stable suspension, high pseudoplasticity, etc., and is suitable for different types of products, such as facial masks, skin care, washing, cosmetics, oral care, home care, etc. Xanthan gum is white or light yellow granules or powder, soluble in water, insoluble in most organic solvents, insensitive to temperature, pH, electrolyte solutions and enzymes, and is a stable microbial metabolic gum.\n",
        "packing": "In 25kgs kraft paper bag or 25kgs drum\n",
        "food_idustry": "Xanthan gum is added to many foods as a stabilizer, emulsifier, suspending agent, thickener and processing aid. Xanthan gum can control the rheology, structure, flavor and appearance of the product, and its pseudoplasticity can ensure a good taste, so it is widely used in salad dressings, bread, dairy products, frozen foods, beverages, condiments, brewing, candy, cakes, soups and canned foods.",
        "pharmaceutical_industry": "Xanthan gum is a functional component in the microcapsule material of the hottest drug in the world. It plays an important role in controlling the sustained release of drugs. Due to its strong hydrophilicity and water retention, it has many specific medical applications, such as forming a dense water film to avoid skin infection and relieve the thirst of patients after radiotherapy. In addition, Li Xin and Xu Lei wrote that xanthan gum itself has a significant enhancing effect on the humoral immune function of mice.",
        "other_industries": "In the petroleum industry, due to its strong pseudoplasticity, a low concentration of xanthan gum (0.5%) aqueous solution can maintain the viscosity of the drilling fluid and control its rheological properties. Therefore, the viscosity is extremely small at the high-speed rotating drill bit, saving power; while the viscosity is maintained at a relatively static drilling site, thereby preventing the collapse of the well wall. And due to its excellent salt resistance and heat resistance, it is widely used in drilling in special environments such as oceans and high-salt layers, and can be used as an oil recovery and displacement agent to reduce dead oil areas and increase oil recovery rates."
    }
]