[
  {
    "name": "Vitamin B12",
    "cas_no": "68-19-9 (Cyanocobalamin); 13422-55-4 (Mecobalamin)",
    "cins_no": "",
    "molecular_formula": "C63H88CoN14O14P (Cyanocobalamin); C63H91CoN13O14P (Mecobalamin)",
    "discription": "A water-soluble vitamin essential for neurological function, DNA synthesis, and red blood cell formation. The specification indicates forms like Mecobalamin (1%) and Cyanocobalamin.",
    "typical_properties": "Specification: (Mecobalamin)1%Cyanocobalamin. Dark red crystals or crystalline powder. Soluble in water and alcohol.",
    "packing": "No information available",
    "food_idustry": "Widely used in food fortification (cereals, plant-based milks, infant formulas) and as a dietary supplement. Essential component in animal feed to prevent deficiency.",
    "pharmaceutical_industry": "Treatment and prevention of vitamin B12 deficiency, pernicious anemia. Used in multivitamin preparations and injectable forms for severe deficiency.",
    "other_industries": ""
  },
  {
    "name": "Vitamin B3",
    "cas_no": "59-67-6 (Niacin/Nicotinic Acid); 98-92-0 (Niacinamide/Nicotinamide)",
    "cins_no": "",
    "molecular_formula": "C6H5NO2 (Niacin); C6H6N2O (Niacinamide)",
    "discription": "A water-soluble vitamin, also known as Niacin or Niacinamide, crucial for energy metabolism, nervous system function, and skin health.",
    "typical_properties": "Specification: 98%. White crystalline powder. Niacin is sparingly soluble in water; Niacinamide is freely soluble.",
    "packing": "No information available",
    "food_idustry": "Food fortification (e.g., flour, cereals), dietary supplements, and animal feed additive to improve growth and health.",
    "pharmaceutical_industry": "Treatment of pellagra (niacin deficiency), management of high cholesterol levels (Niacin form). Component of multivitamin supplements.",
    "other_industries": "Cosmetics (Niacinamide for skin benefits)."
  },
  {
    "name": "Vitamin E",
    "cas_no": "Varies by form (e.g., d-alpha-tocopherol: 59-02-9; dl-alpha-tocopheryl acetate: 7695-91-2)",
    "cins_no": "",
    "molecular_formula": "C29H50O2 (alpha-tocopherol)",
    "discription": "A group of fat-soluble compounds with antioxidant properties, important for immune function and skin health. Exists in various forms (tocopherols and tocotrienols).",
    "typical_properties": "Specification: 50-97%/Oil /Powder. Clear, yellowish to reddish viscous oil or powder form. Insoluble in water, soluble in fats and organic solvents.",
    "packing": "No information available",
    "food_idustry": "Used as a natural antioxidant (E306-E309) in foods to prevent spoilage, in dietary supplements, and for fortification. Animal feed supplement for antioxidant properties and health benefits.",
    "pharmaceutical_industry": "Treatment of vitamin E deficiency, used in topical preparations for skin health, and as an antioxidant in pharmaceutical formulations.",
    "other_industries": "Cosmetics (antioxidant, skin conditioning)."
  },
  {
    "name": "Vitamin B2",
    "cas_no": "83-88-5 (Riboflavin); 130-40-5 (Riboflavin-5'-phosphate sodium)",
    "cins_no": "",
    "molecular_formula": "C17H20N4O6 (Riboflavin)",
    "discription": "A water-soluble vitamin, also known as Riboflavin, essential for energy production, cellular function, and metabolism of fats, drugs, and steroids.",
    "typical_properties": "Specification: 80% (Riboflavin) 97-103%. Yellow to orange-yellow crystalline powder. Slightly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Food fortification (e.g., cereals, pasta, dairy products), natural food colorant (E101), dietary supplements. Animal feed additive for growth and egg production.",
    "pharmaceutical_industry": "Treatment and prevention of riboflavin deficiency (ariboflavinosis), used in multivitamin preparations. Sometimes used for migraine prophylaxis.",
    "other_industries": ""
  },
  {
    "name": "Vitamin D2",
    "cas_no": "50-14-6",
    "cins_no": "",
    "molecular_formula": "C28H44O",
    "discription": "Also known as Ergocalciferol, a fat-soluble vitamin that helps the body absorb calcium, essential for bone health.",
    "typical_properties": "Specification: 98%. White, odorless crystals. Insoluble in water; soluble in organic solvents and oils. Sensitive to air and light.",
    "packing": "No information available",
    "food_idustry": "Food fortification (e.g., milk, plant-based milks, margarine), dietary supplements. Animal feed supplement for bone development.",
    "pharmaceutical_industry": "Treatment of rickets, osteomalacia, hypoparathyroidism, and vitamin D deficiency.",
    "other_industries": ""
  },
  {
    "name": "Vitamin D3",
    "cas_no": "67-97-0",
    "cins_no": "",
    "molecular_formula": "C27H44O",
    "discription": "Also known as Cholecalciferol, a fat-soluble vitamin produced in the skin upon exposure to sunlight or obtained from dietary sources. Essential for calcium absorption and bone health.",
    "typical_properties": "Specification: 10-500000IU/g. White or slightly yellowish crystals. Insoluble in water; soluble in organic solvents and oils. Sensitive to air and light.",
    "packing": "No information available",
    "food_idustry": "Food fortification (e.g., milk, dairy products, cereals, orange juice), dietary supplements. Animal feed supplement for bone health and growth.",
    "pharmaceutical_industry": "Treatment and prevention of vitamin D deficiency, rickets, osteomalacia, osteoporosis. Component of multivitamin and calcium supplements.",
    "other_industries": ""
  },
  {
    "name": "Vitamin B5",
    "cas_no": "137-08-6 (Calcium D-pantothenate); 79-83-4 (Pantothenic acid)",
    "cins_no": "",
    "molecular_formula": "C9H17NO5 (Pantothenic acid); (C9H16NO5)2Ca (Calcium pantothenate)",
    "discription": "Also known as Pantothenic Acid, a water-soluble vitamin essential for synthesizing coenzyme A (CoA) and acyl carrier protein, vital for fatty acid metabolism.",
    "typical_properties": "Specification: 98%. (Assuming Calcium Pantothenate) White powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements, food fortification, and extensively used in animal feed to promote growth and health.",
    "pharmaceutical_industry": "Component of multivitamin preparations, treatment of pantothenic acid deficiency (rare). Dexpanthenol (alcohol analog) is used in skin and hair care products.",
    "other_industries": "Cosmetics (Dexpanthenol)."
  },
  {
    "name": "Vitamin B6",
    "cas_no": "65-23-6 (Pyridoxine); 58-56-0 (Pyridoxine HCl)",
    "cins_no": "",
    "molecular_formula": "C8H11NO3 (Pyridoxine); C8H12ClNO3 (Pyridoxine HCl)",
    "discription": "A water-soluble vitamin involved in numerous metabolic processes, including amino acid metabolism, neurotransmitter synthesis, and red blood cell formation. Pyridoxine HCl is a common form.",
    "typical_properties": "Specification: 98-102% HCL. White or almost white crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Food fortification, dietary supplements, and animal feed additive.",
    "pharmaceutical_industry": "Treatment and prevention of vitamin B6 deficiency, treatment of certain types of anemia, nausea during pregnancy. Component of multivitamin supplements.",
    "other_industries": ""
  },
  {
    "name": "Vitamin B1",
    "cas_no": "59-43-8 (Thiamine); 67-03-8 (Thiamine HCl)",
    "cins_no": "",
    "molecular_formula": "C12H17N4OS+ (Thiamine cation); C12H18Cl2N4OS (Thiamine HCl)",
    "discription": "Also known as Thiamine, a water-soluble vitamin crucial for carbohydrate metabolism and nerve function. Thiamine HCl is a common salt form.",
    "typical_properties": "Specification: 98% HCI. White or almost white crystalline powder or small crystals. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Food fortification (e.g., flour, rice, cereals), dietary supplements. Essential additive in animal feed.",
    "pharmaceutical_industry": "Treatment and prevention of thiamine deficiency (beriberi), Wernicke-Korsakoff syndrome. Component of multivitamin preparations.",
    "other_industries": ""
  },
  {
    "name": "Vitamins AD3 Oil/powder",
    "cas_no": "Vitamin A (e.g., Retinyl acetate: 127-47-9); Vitamin D3: 67-97-0",
    "cins_no": "",
    "molecular_formula": "Varies (mixture)",
    "discription": "A combined preparation of Vitamin A and Vitamin D3, both fat-soluble vitamins, typically used for animal feed supplementation or fortified foods.",
    "typical_properties": "Specification: 1000000:200000IU (Likely IU Vitamin A : IU Vitamin D3 per unit mass). Available as oil or powder. Properties depend on the carrier and form.",
    "packing": "No information available",
    "food_idustry": "Primarily used in animal feed to support growth, immune function, reproduction, and bone health in livestock and poultry. Can be used in fortified food products.",
    "pharmaceutical_industry": "Used in multivitamin supplements, especially for infants or individuals with specific deficiencies.",
    "other_industries": ""
  },
  {
    "name": "Vitamin k3",
    "cas_no": "58-27-5 (Menadione); 130-37-0 (Menadione sodium bisulfite - MNB)",
    "cins_no": "",
    "molecular_formula": "C11H8O2 (Menadione); C11H9NaO5S (Menadione sodium bisulfite)",
    "discription": "A synthetic form of vitamin K, also known as Menadione. Menadione Sodium Bisulfite (MNB) is a water-soluble derivative.",
    "typical_properties": "Specification: MNB 96%(K-43.7%). (MNB) White or yellowish crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Primarily used as an animal feed additive to prevent vitamin K deficiency and improve blood clotting, especially in poultry and swine. Not typically used for human food fortification due to potential toxicity concerns at higher doses.",
    "pharmaceutical_industry": "Limited use in human medicine; natural forms (K1, K2) are preferred. Has been used in some veterinary applications.",
    "other_industries": ""
  },
  {
    "name": "D-Biotin",
    "cas_no": "58-85-5",
    "cins_no": "",
    "molecular_formula": "C10H16N2O3S",
    "discription": "Also known as Vitamin B7 or Vitamin H, a water-soluble vitamin that plays a key role in the metabolism of fats, carbohydrates, and proteins. It is essential for healthy hair, skin, and nails.",
    "typical_properties": "Specification: 2%. White or off-white crystalline powder. Very slightly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements, food fortification, and widely used as an animal feed additive to improve growth, reproductive performance, and hoof/skin/hair quality.",
    "pharmaceutical_industry": "Treatment of biotin deficiency, component of multivitamin supplements, and used in supplements marketed for hair, skin, and nail health.",
    "other_industries": "Laboratory reagent in various biochemical assays."
  },
  {
    "name": "Folic acid",
    "cas_no": "59-30-3",
    "cins_no": "",
    "molecular_formula": "C19H19N7O6",
    "discription": "A synthetic form of folate (Vitamin B9), a water-soluble vitamin essential for DNA synthesis, cell division, and the formation of red blood cells. Crucial during pregnancy to prevent neural tube defects.",
    "typical_properties": "Specification: 95%-99%. Yellowish-orange or yellow crystalline powder. Very slightly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Widely used for food fortification (e.g., flour, cereals, bread), dietary supplements. Animal feed additive.",
    "pharmaceutical_industry": "Prevention and treatment of folate deficiency and megaloblastic anemia. Prescribed to women of childbearing age and during pregnancy to prevent neural tube defects in the fetus.",
    "other_industries": ""
  },
  {
    "name": "Vitamin C",
    "cas_no": "50-81-7 (Ascorbic acid)",
    "cins_no": "",
    "molecular_formula": "C6H8O6",
    "discription": "Also known as Ascorbic Acid, a water-soluble vitamin and potent antioxidant. Essential for collagen synthesis, immune function, and iron absorption.",
    "typical_properties": "Specification: 95%-99%. White or slightly yellow crystals or powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Widely used as an antioxidant (E300) in food and beverages, for food fortification, and in dietary supplements. Animal feed additive for health and stress reduction.",
    "pharmaceutical_industry": "Prevention and treatment of scurvy (vitamin C deficiency), component of multivitamin supplements, used to support immune function. High doses are investigated for various conditions.",
    "other_industries": "Cosmetics (antioxidant, skin brightening), photography developing solutions."
  },
  {
    "name": "MADURAMYCIN",
    "cas_no": "84878-61-5 (Maduramicin Ammonium)",
    "cins_no": "",
    "molecular_formula": "C47H83NO17 (Maduramicin); C47H86N2O17 (Maduramicin Ammonium)",
    "discription": "A polyether ionophore antibiotic used as a coccidiostat in poultry feed.",
    "typical_properties": "Specification: 1%. Typically a premix containing 1% Maduramicin Ammonium. White to off-white powder.",
    "packing": "No information available",
    "food_idustry": "Exclusively used as an animal feed additive (coccidiostat) for the prevention of coccidiosis in broiler chickens.",
    "pharmaceutical_industry": "Veterinary medicine only, not for human use.",
    "other_industries": ""
  },
  {
    "name": "MONOCALCIUM PHOSPHATE",
    "cas_no": "7758-23-8 (Anhydrous); 10031-30-8 (Monohydrate)",
    "cins_no": "",
    "molecular_formula": "Ca(H2PO4)2 (Anhydrous); Ca(H2PO4)2·H2O (Monohydrate)",
    "discription": "An inorganic compound used as a leavening agent in baking, a source of calcium and phosphorus in foods and animal feeds, and a fertilizer.",
    "typical_properties": "Specification: 22% (Likely refers to Phosphorus content, P2O5 equivalent, or Calcium content). White crystalline powder or granules. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Leavening agent (E341(i)) in baking powders and self-rising flour, acidulant, dough conditioner, nutrient supplement (calcium and phosphorus). Essential mineral supplement in animal feed for bone development and metabolism.",
    "pharmaceutical_industry": "Source of calcium and phosphate in some supplements.",
    "other_industries": "Fertilizer production, glass manufacturing."
  },
  {
    "name": "L-ARGININE",
    "cas_no": "74-79-3",
    "cins_no": "",
    "molecular_formula": "C6H14N4O2",
    "discription": "A semi-essential amino acid involved in protein synthesis, wound healing, immune function, and as a precursor for nitric oxide.",
    "typical_properties": "Specification: 98%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements, sports nutrition products, food additive, and animal feed supplement to improve growth and immunity.",
    "pharmaceutical_industry": "Used in supplements for cardiovascular health, erectile dysfunction, and to support growth and recovery. Component of parenteral nutrition solutions.",
    "other_industries": "Cosmetics (skin conditioning)."
  },
  {
    "name": "BETAINE",
    "cas_no": "107-43-7 (Betaine Anhydrous); 590-46-5 (Betaine HCl)",
    "cins_no": "",
    "molecular_formula": "C5H11NO2 (Anhydrous); C5H12ClNO2 (HCl)",
    "discription": "A modified amino acid (trimethylglycine) found in various plants and animals. Acts as an osmolyte and methyl donor.",
    "typical_properties": "Specification: HCL 98%. (Betaine HCl) White crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for liver health and athletic performance. Widely used in animal feed as an osmoprotectant, methyl donor, and to improve carcass quality.",
    "pharmaceutical_industry": "Treatment of homocystinuria. Investigated for liver disease and other conditions.",
    "other_industries": "Cosmetics (humectant, anti-irritant)."
  },
  {
    "name": "L-LYSINE",
    "cas_no": "56-87-1 (L-Lysine); 657-27-2 (L-Lysine HCl)",
    "cins_no": "",
    "molecular_formula": "C6H14N2O2 (L-Lysine); C6H15ClN2O2 (L-Lysine HCl)",
    "discription": "An essential amino acid necessary for protein synthesis, calcium absorption, and the production of enzymes, hormones, and antibodies.",
    "typical_properties": "Specification: 98%. White or almost white powder. Soluble in water. (Assuming L-Lysine HCl which is common for this purity).",
    "packing": "No information available",
    "food_idustry": "Important animal feed additive, especially for swine and poultry, to ensure balanced nutrition and growth. Used in dietary supplements.",
    "pharmaceutical_industry": "Used in dietary supplements for cold sore prevention and to support protein synthesis. Component of amino acid solutions.",
    "other_industries": ""
  },
  {
    "name": "L TRYPTOPHAN",
    "cas_no": "73-22-3",
    "cins_no": "",
    "molecular_formula": "C11H12N2O2",
    "discription": "An essential amino acid that is a precursor for serotonin (a neurotransmitter) and melatonin (a hormone involved in sleep).",
    "typical_properties": "Specification: 98%. White to yellowish-white crystals or crystalline powder. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for sleep, mood, and appetite control. Animal feed additive, particularly for young animals.",
    "pharmaceutical_industry": "Used in supplements for insomnia, depression, and anxiety. Component of nutritional formulas.",
    "other_industries": ""
  },
  {
    "name": "L THREONINE",
    "cas_no": "72-19-5",
    "cins_no": "",
    "molecular_formula": "C4H9NO3",
    "discription": "An essential amino acid involved in protein synthesis, collagen and elastin formation, liver function, and immune system support.",
    "typical_properties": "Specification: 98%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Key animal feed additive, especially for swine and poultry, to optimize growth and feed efficiency. Used in dietary supplements.",
    "pharmaceutical_industry": "Component of amino acid solutions for parenteral nutrition. Supplements used to support muscle and connective tissue health.",
    "other_industries": ""
  },
  {
    "name": "L-LYSINE MONOHYDROCHLORI",
    "cas_no": "657-27-2",
    "cins_no": "",
    "molecular_formula": "C6H15ClN2O2",
    "discription": "The hydrochloride salt of L-Lysine, an essential amino acid vital for protein synthesis, growth, and tissue repair.",
    "typical_properties": "Specification: 95%-99%. White or pale yellow crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Major animal feed additive (especially for poultry and swine) to ensure adequate lysine levels for optimal growth and protein utilization. Used in dietary supplements.",
    "pharmaceutical_industry": "Supplements for preventing herpes simplex outbreaks, promoting calcium absorption. Component of amino acid IV solutions.",
    "other_industries": ""
  },
  {
    "name": "L-threonine",
    "cas_no": "72-19-5",
    "cins_no": "",
    "molecular_formula": "C4H9NO3",
    "discription": "An essential amino acid important for protein synthesis, formation of collagen and elastin, liver function, and the immune system.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Widely used as an animal feed additive (especially for swine and poultry) to balance amino acid profiles and support growth. Used in dietary supplements.",
    "pharmaceutical_industry": "Used in amino acid mixtures for nutritional support. Supplements for neurological conditions (spasticity) have been explored.",
    "other_industries": ""
  },
  {
    "name": "L-tryptophan",
    "cas_no": "73-22-3",
    "cins_no": "",
    "molecular_formula": "C11H12N2O2",
    "discription": "An essential amino acid, precursor to serotonin (neurotransmitter involved in mood) and melatonin (hormone regulating sleep).",
    "typical_properties": "Specification: 95%-99%. White to yellowish-white crystalline powder. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (for sleep, mood). Animal feed additive to improve well-being and growth, especially in young animals or under stress.",
    "pharmaceutical_industry": "Used in supplements to aid sleep, reduce anxiety, and improve mood. Historically used for depression and insomnia.",
    "other_industries": ""
  },
  {
    "name": "L-arginine",
    "cas_no": "74-79-3",
    "cins_no": "",
    "molecular_formula": "C6H14N4O2",
    "discription": "A semi-essential amino acid that plays a role in protein building, vasodilation (through nitric oxide production), immune function, and hormone secretion.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Commonly used in dietary supplements and sports nutrition products for muscle growth, performance, and recovery. Animal feed additive.",
    "pharmaceutical_industry": "Used in supplements for cardiovascular health, erectile dysfunction. Component in nutritional therapies and wound healing preparations.",
    "other_industries": "Cosmetics (conditioning agent)."
  },
  {
    "name": "L-leucine",
    "cas_no": "61-90-5",
    "cins_no": "",
    "molecular_formula": "C6H13NO2",
    "discription": "An essential branched-chain amino acid (BCAA) critical for protein synthesis, muscle repair, and regulation of blood sugar levels.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Key component in sports nutrition supplements (BCAA products) and protein powders. Animal feed additive to promote muscle growth.",
    "pharmaceutical_industry": "Used in medical foods and nutritional support for conditions involving muscle wasting. Component of amino acid solutions.",
    "other_industries": ""
  },
  {
    "name": "L-isoleucine",
    "cas_no": "73-32-5",
    "cins_no": "",
    "molecular_formula": "C6H13NO2",
    "discription": "An essential branched-chain amino acid (BCAA) involved in muscle metabolism, hemoglobin formation, and energy regulation.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder or flakes. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Component of sports nutrition supplements (BCAA products) and protein formulas. Animal feed additive.",
    "pharmaceutical_industry": "Used in nutritional support and amino acid therapies, especially for patients with trauma or sepsis. Component of parenteral nutrition.",
    "other_industries": ""
  },
  {
    "name": "L-valine",
    "cas_no": "72-18-4",
    "cins_no": "",
    "molecular_formula": "C5H11NO2",
    "discription": "An essential branched-chain amino acid (BCAA) that promotes muscle growth and repair, and is involved in energy production.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Used in sports nutrition supplements (BCAA products), protein powders. Animal feed additive for growth.",
    "pharmaceutical_industry": "Component of amino acid solutions for nutritional therapy. Used in medical foods for liver disease or muscle maintenance.",
    "other_industries": ""
  },
  {
    "name": "L-methionine",
    "cas_no": "63-68-3",
    "cins_no": "",
    "molecular_formula": "C5H11NO2S",
    "discription": "An essential sulfur-containing amino acid, important for protein synthesis, metabolism, and as a precursor for other sulfur compounds like cysteine and taurine.",
    "typical_properties": "Specification: 95%-99%. White crystalline flakes or powder with a characteristic slight odor. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Crucial animal feed additive (especially for poultry) to improve growth, feathering, and egg production. Dietary supplements.",
    "pharmaceutical_industry": "Used in treatment of acetaminophen poisoning, liver disorders, and as a urinary acidifier. Component of nutritional formulas.",
    "other_industries": ""
  },
  {
    "name": "L-phenylalanine",
    "cas_no": "63-91-2",
    "cins_no": "",
    "molecular_formula": "C9H11NO2",
    "discription": "An essential amino acid that is a precursor for tyrosine, dopamine, norepinephrine, and epinephrine. Important for protein structure and function.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Used in dietary supplements (sometimes for mood, pain relief). Component of the artificial sweetener aspartame (as L-phenylalanine methyl ester). Animal feed additive.",
    "pharmaceutical_industry": "Used in supplements for depression, pain, and vitiligo. Must be avoided by individuals with phenylketonuria (PKU).",
    "other_industries": ""
  },
  {
    "name": "aspartic acid",
    "cas_no": "56-84-8 (L-Aspartic acid); 617-45-8 (DL-Aspartic acid)",
    "cins_no": "",
    "molecular_formula": "C4H7NO4",
    "discription": "A non-essential amino acid involved in the urea cycle, DNA synthesis, and as a neurotransmitter (L-aspartate).",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Used in dietary supplements (often as magnesium or potassium aspartate for athletic performance or fatigue). Component of the artificial sweetener aspartame.",
    "pharmaceutical_industry": "Component of some parenteral nutrition solutions. Mineral aspartates used in supplements.",
    "other_industries": "Biodegradable polymers, chemical synthesis."
  },
  {
    "name": "serine",
    "cas_no": "56-45-1 (L-Serine); 302-84-1 (DL-Serine)",
    "cins_no": "",
    "molecular_formula": "C3H7NO3",
    "discription": "A non-essential amino acid important for the biosynthesis of proteins, purines, pyrimidines, and other amino acids like glycine and cysteine. Plays a role in brain function.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (often for cognitive function or sleep). Animal feed additive.",
    "pharmaceutical_industry": "Investigated for use in neurological disorders. Component of amino acid solutions.",
    "other_industries": "Cosmetics (moisturizer, skin conditioning)."
  },
  {
    "name": "glutamine",
    "cas_no": "56-85-9 (L-Glutamine)",
    "cins_no": "",
    "molecular_formula": "C5H10N2O3",
    "discription": "The most abundant conditionally essential amino acid in the human body. Important for immune function, intestinal health, and muscle protein synthesis.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Popular dietary supplement for athletes (muscle recovery, immune support) and for gut health. Animal feed additive for gut integrity and stress periods.",
    "pharmaceutical_industry": "Used in clinical nutrition to support critically ill patients, those with burns, or undergoing surgery. Can aid gut barrier function.",
    "other_industries": "Cell culture media."
  },
  {
    "name": "glycine",
    "cas_no": "56-40-6",
    "cins_no": "",
    "molecular_formula": "C2H5NO2",
    "discription": "The simplest amino acid, non-essential, and an inhibitory neurotransmitter in the central nervous system. Component of collagen.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Freely soluble in water. Sweet taste.",
    "packing": "No information available",
    "food_idustry": "Flavor enhancer, sweetener, buffering agent in foods. Dietary supplements (for sleep, cognitive function). Animal feed additive.",
    "pharmaceutical_industry": "Used in some antacid formulations, as an irrigating solution during surgery. Investigated for schizophrenia and sleep disorders.",
    "other_industries": "Metal complexing agent, component in some pesticides."
  },
  {
    "name": "alanine",
    "cas_no": "56-41-7 (L-Alanine); 302-72-7 (DL-Alanine); 338-69-2 (Beta-Alanine)",
    "cins_no": "",
    "molecular_formula": "C3H7NO2",
    "discription": "A non-essential amino acid involved in glucose metabolism and protein synthesis. The table likely refers to L-Alanine, but Beta-Alanine is also common in supplements.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (L-Alanine for general amino acid support; Beta-Alanine for athletic performance by increasing carnosine levels). Flavoring agent. Animal feed additive.",
    "pharmaceutical_industry": "Component of amino acid solutions for parenteral nutrition.",
    "other_industries": ""
  },
  {
    "name": "Niacin",
    "cas_no": "59-67-6",
    "cins_no": "",
    "molecular_formula": "C6H5NO2",
    "discription": "Also known as Vitamin B3 or Nicotinic Acid, a water-soluble vitamin involved in over 400 enzymatic reactions, primarily related to energy metabolism.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder or crystals. Sparingly soluble in hot water, slightly soluble in cold water.",
    "packing": "No information available",
    "food_idustry": "Food fortification (flour, cereals), dietary supplements. Animal feed additive.",
    "pharmaceutical_industry": "Treatment of pellagra (niacin deficiency). Used in high doses to lower cholesterol and triglyceride levels.",
    "other_industries": ""
  },
  {
    "name": "niacinamide",
    "cas_no": "98-92-0",
    "cins_no": "",
    "molecular_formula": "C6H6N2O",
    "discription": "Also known as Nicotinamide, a form of Vitamin B3. It is involved in energy metabolism and DNA repair. Unlike niacin, it does not typically cause flushing.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Food fortification, dietary supplements. Animal feed additive.",
    "pharmaceutical_industry": "Treatment of pellagra. Used in multivitamin preparations. Topical forms used for skin conditions like acne and rosacea.",
    "other_industries": "Cosmetics (skin brightening, anti-inflammatory, barrier repair)."
  },
  {
    "name": "calcium pantothenate",
    "cas_no": "137-08-6 (D-form); 63552-37-4 (DL-form)",
    "cins_no": "",
    "molecular_formula": "(C9H16NO5)2Ca",
    "discription": "The calcium salt of D-pantothenic acid (Vitamin B5). It's a common and stable form of Vitamin B5 used in supplements and feeds.",
    "typical_properties": "Specification: 95%-99%. White, slightly hygroscopic powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements, fortification of foods, major component in animal feed for growth and overall health.",
    "pharmaceutical_industry": "Component in multivitamin tablets and capsules. Dexpanthenol (related compound) used in skin creams.",
    "other_industries": "Cosmetics (as panthenol/dexpanthenol)."
  },
  {
    "name": "β-carotene",
    "cas_no": "7235-40-7",
    "cins_no": "E160a(i) or E160a(ii) depending on source/mixture",
    "molecular_formula": "C40H56",
    "discription": "A red-orange pigment found in plants and fruits, especially carrots. It's a provitamin A carotenoid, meaning it can be converted into Vitamin A in the body. Potent antioxidant.",
    "typical_properties": "Specification: 1%-98%. Red, reddish-brown, or purple-violet crystals or crystalline powder, or oily solutions/suspensions. Insoluble in water, soluble in oils and organic solvents.",
    "packing": "No information available",
    "food_idustry": "Food colorant (E160a), antioxidant, source of Vitamin A in fortified foods (margarine, juices, dairy products) and dietary supplements. Animal feed additive for pigmentation (e.g., egg yolks, fish flesh) and as a vitamin source.",
    "pharmaceutical_industry": "Used in supplements for its antioxidant properties and as a source of Vitamin A. Investigated for sun protection and eye health.",
    "other_industries": "Cosmetics (colorant, antioxidant)."
  },
  {
    "name": "lutein",
    "cas_no": "127-40-2",
    "cins_no": "E161b",
    "molecular_formula": "C40H56O2",
    "discription": "A xanthophyll carotenoid pigment found in green leafy vegetables (like spinach and kale) and egg yolks. Concentrates in the macula of the human eye.",
    "typical_properties": "Specification: 1-10%. Typically extracted from marigold flowers. Yellow to orange crystalline powder or oily suspension. Insoluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for eye health (age-related macular degeneration, cataracts). Natural food colorant (E161b). Animal feed additive for pigmenting egg yolks and poultry skin.",
    "pharmaceutical_industry": "Used in supplements for eye health, particularly to protect against blue light and oxidative damage.",
    "other_industries": "Cosmetics."
  },
  {
    "name": "Astaxanthin",
    "cas_no": "472-61-7",
    "cins_no": "E161j",
    "molecular_formula": "C40H52O4",
    "discription": "A keto-carotenoid pigment found in microalgae (Haematococcus pluvialis), yeast, salmon, trout, krill, and crustaceans. A powerful antioxidant.",
    "typical_properties": "Specification: 1-95% Powder/Oil. Dark red crystalline powder or oily suspension. Lipid-soluble.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (antioxidant, for skin, eye, and joint health). Food colorant for farmed salmon and trout. Animal feed additive for aquaculture (pigmentation) and poultry.",
    "pharmaceutical_industry": "Investigated for various health benefits due to its antioxidant and anti-inflammatory properties.",
    "other_industries": "Cosmetics (antioxidant)."
  },
  {
    "name": "monascus red",
    "cas_no": "Mixture; CAS numbers for individual pigments like Monascorubramine: 51979-85-6, Rubropunctamine: 56518-70-2 exist.",
    "cins_no": "",
    "molecular_formula": "Various (mixture of pigments)",
    "discription": "A natural food colorant produced by the fermentation of rice or other grains with Monascus purpureus mold. Contains various pigments like monascorubrin and rubropunctatin.",
    "typical_properties": "Specification: 95%-99% (likely color value or pigment concentration). Red to reddish-purple powder or liquid. Properties vary with specific pigments.",
    "packing": "No information available",
    "food_idustry": "Natural food colorant used in a variety of food products like meat, soy products, beverages, and confections, especially in Asia. Also known as red yeast rice extract, which may contain monacolin K (lovastatin-like compound).",
    "pharmaceutical_industry": "Red yeast rice extracts are used as dietary supplements for cholesterol management (due to monacolin K content). The pure pigment itself is mainly for food coloring.",
    "other_industries": ""
  },
  {
    "name": "lycopene",
    "cas_no": "502-65-8",
    "cins_no": "E160d",
    "molecular_formula": "C40H56",
    "discription": "A bright red carotenoid pigment found in tomatoes and other red fruits and vegetables. A potent antioxidant.",
    "typical_properties": "Specification: 0.5-40% Powder/Oil. Deep red crystals, powder, or oily suspension. Insoluble in water, soluble in oils and organic solvents.",
    "packing": "No information available",
    "food_idustry": "Natural food colorant (E160d). Dietary supplements for antioxidant properties, prostate health, and cardiovascular health. Fortification of some foods.",
    "pharmaceutical_industry": "Used in supplements for its antioxidant effects. Investigated for cancer prevention and cardiovascular disease.",
    "other_industries": "Cosmetics (antioxidant)."
  },
  {
    "name": "astragalus polysaccharide",
    "cas_no": "89250-26-0 (general CAS for Astragalus polysaccharides)",
    "cins_no": "",
    "molecular_formula": "Complex mixture of polysaccharides",
    "discription": "Polysaccharides extracted from the root of Astragalus membranaceus, a plant used in Traditional Chinese Medicine. Known for immunomodulatory effects.",
    "typical_properties": "Specification: 10-95% (polysaccharide content). Yellowish-brown to brown powder. Soluble in hot water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for immune support, adaptogenic properties. Functional food ingredient.",
    "pharmaceutical_industry": "Investigated for immune-enhancing, anti-inflammatory, and anti-aging properties. Used as an adjuvant in some therapies.",
    "other_industries": ""
  },
  {
    "name": "lentinan",
    "cas_no": "37339-90-5",
    "cins_no": "",
    "molecular_formula": "(C6H10O5)n (beta-glucan polymer)",
    "discription": "A beta-glucan polysaccharide isolated from shiitake mushrooms (Lentinula edodes). Known for its immunomodulatory and anti-tumor properties.",
    "typical_properties": "Specification: 10-95% (lentinan or beta-glucan content). Off-white to light brown powder. Soluble in hot water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for immune support. Functional food ingredient.",
    "pharmaceutical_industry": "Used as an immunoadjuvant in cancer therapy in some countries (e.g., Japan). Investigated for various immune-related conditions.",
    "other_industries": "Cosmetics (skin conditioning)."
  },
  {
    "name": "linguine polysaccharide",
    "cas_no": "Not clearly defined for 'linguine polysaccharide'. May refer to polysaccharides from various sources, possibly fungal (like Lingzhi/Reishi) or seaweed, or be a typo.",
    "cins_no": "",
    "molecular_formula": "Complex mixture of polysaccharides",
    "discription": "A general term for polysaccharides potentially extracted from a source sometimes referred to as 'linguine' (could be a typo or local name for a mushroom e.g. Lingzhi/Reishi or a seaweed). Typically these are beta-glucans or other complex carbohydrates with immunomodulatory properties.",
    "typical_properties": "Specification: 10-95%. Off-white to brown powder. Solubility varies based on source, generally soluble in hot water.",
    "packing": "No information available",
    "food_idustry": "If referring to mushroom polysaccharides: Dietary supplements for immune support, functional food ingredient.",
    "pharmaceutical_industry": "If referring to mushroom polysaccharides: Investigated for immune-modulating and anti-cancer properties.",
    "other_industries": ""
  },
  {
    "name": "chitosan",
    "cas_no": "9012-76-4",
    "cins_no": "",
    "molecular_formula": "(C6H11NO4)n (partially deacetylated chitin)",
    "discription": "A linear polysaccharide derived from chitin (found in crustacean shells, insect exoskeletons, and fungal cell walls) by deacetylation. It is biocompatible and biodegradable.",
    "typical_properties": "Specification: 95%-99% (likely deacetylation degree or purity). White to off-white flakes or powder. Insoluble in water, soluble in dilute acidic solutions.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (for weight loss, cholesterol reduction by binding fats). Food preservative (antimicrobial film). Clarifying agent in beverages. Animal feed additive.",
    "pharmaceutical_industry": "Drug delivery systems, wound dressings, tissue engineering scaffolds. Hemostatic agent.",
    "other_industries": "Water treatment (flocculant), agriculture (biopesticide, plant growth enhancer), cosmetics (film-former, moisturizer)."
  },
  {
    "name": "choline",
    "cas_no": "62-49-7 (Choline base); 67-48-1 (Choline chloride); 87-67-2 (Choline bitartrate)",
    "cins_no": "",
    "molecular_formula": "C5H14NO+ (Choline cation)",
    "discription": "An essential nutrient, often grouped with B vitamins. Important for cell membrane structure, neurotransmitter synthesis (acetylcholine), lipid metabolism, and homocysteine regulation.",
    "typical_properties": "Specification: 95%-99% (Usually as a salt like Choline Chloride or Bitartrate). White crystalline powder or viscous liquid depending on the form. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (for liver health, cognitive function). Fortification of infant formulas and some foods. Major animal feed additive, especially for poultry and swine, for growth and liver function.",
    "pharmaceutical_industry": "Component of nutritional support formulas. Used in managing conditions related to liver fat accumulation.",
    "other_industries": ""
  },
  {
    "name": "Lactobacillus acidophilus",
    "cas_no": "N/A (organism)",
    "cins_no": "",
    "molecular_formula": "N/A (organism)",
    "discription": "A species of Gram-positive bacteria in the genus Lactobacillus. It's a common probiotic, naturally found in the human gut and fermented foods.",
    "typical_properties": "Specification: 95%-99% (likely refers to cell count/viability, e.g., CFU/g). Off-white to light yellow powder (lyophilized form).",
    "packing": "No information available",
    "food_idustry": "Used in probiotic dietary supplements and added to fermented dairy products (yogurt, kefir), and other functional foods for gut health. Animal feed additive (probiotic).",
    "pharmaceutical_industry": "Probiotic preparations for managing diarrhea, irritable bowel syndrome (IBS), and promoting vaginal health.",
    "other_industries": ""
  },
  {
    "name": "Bifidobacterium",
    "cas_no": "N/A (organism group)",
    "cins_no": "",
    "molecular_formula": "N/A (organism group)",
    "discription": "A genus of Gram-positive, anaerobic bacteria. Various species (e.g., B. bifidum, B. longum, B. lactis) are common probiotics found in the human gut, particularly in infants.",
    "typical_properties": "Specification: 95%-99% (likely refers to cell count/viability, e.g., CFU/g, for a specific species or blend). Off-white to light yellow powder (lyophilized form).",
    "packing": "No information available",
    "food_idustry": "Key component of probiotic dietary supplements and functional foods (yogurt, infant formula) for digestive health and immune support. Animal feed probiotic.",
    "pharmaceutical_industry": "Probiotic formulations for restoring gut flora, managing digestive disorders, and potentially boosting immunity.",
    "other_industries": ""
  },
  {
    "name": "Bacillus subtilis",
    "cas_no": "68038-70-0 (organism)",
    "cins_no": "",
    "molecular_formula": "N/A (organism)",
    "discription": "A Gram-positive, rod-shaped bacterium commonly found in soil. Known for its ability to form endospores, making it a robust probiotic.",
    "typical_properties": "Specification: 95%-99% (likely spore count/viability). Off-white to tan powder.",
    "packing": "No information available",
    "food_idustry": "Probiotic dietary supplements for gut health. Used in animal feed as a probiotic to improve gut health and nutrient absorption. Used in the production of Natto (fermented soybeans).",
    "pharmaceutical_industry": "Probiotic preparations. Source of enzymes (e.g., amylase, protease) for various applications.",
    "other_industries": "Production of industrial enzymes, agricultural biofertilizer/biopesticide."
  },
  {
    "name": "Bacillus licheniformis",
    "cas_no": "N/A (organism)",
    "cins_no": "",
    "molecular_formula": "N/A (organism)",
    "discription": "A Gram-positive, thermophilic bacterium found in soil and on bird feathers. Known for producing various enzymes and antimicrobial substances.",
    "typical_properties": "Specification: 95%-99% (likely spore count/viability). Off-white to tan powder.",
    "packing": "No information available",
    "food_idustry": "Used as a probiotic in animal feed to enhance gut health, nutrient utilization, and disease resistance. Source of industrial enzymes (e.g., proteases for detergents, alpha-amylase for starch processing).",
    "pharmaceutical_industry": "Source of bacitracin (antibiotic). Probiotic applications.",
    "other_industries": "Enzyme production (detergents, textiles, food processing), bioremediation."
  },
  {
    "name": "Saccharomyces boulardii",
    "cas_no": "N/A (organism)",
    "cins_no": "",
    "molecular_formula": "N/A (organism)",
    "discription": "A tropical strain of yeast, closely related to Saccharomyces cerevisiae (baker's yeast). It is used as a probiotic to treat and prevent diarrhea.",
    "typical_properties": "Specification: 95%-99% (likely cell count/viability, e.g., CFU/g). Off-white to light tan powder (lyophilized form).",
    "packing": "No information available",
    "food_idustry": "Probiotic dietary supplements.",
    "pharmaceutical_industry": "Well-established probiotic for the prevention and treatment of various forms of diarrhea, including antibiotic-associated diarrhea and traveler's diarrhea. May help with Clostridium difficile infection.",
    "other_industries": ""
  },
  {
    "name": "Bacillus coagulans",
    "cas_no": "N/A (organism)",
    "cins_no": "",
    "molecular_formula": "N/A (organism)",
    "discription": "A lactic acid-forming, spore-forming Gram-positive bacterium. Its spore-forming ability makes it stable in various conditions, suitable for probiotics.",
    "typical_properties": "Specification: 95%-99% (likely spore count/viability). Off-white powder.",
    "packing": "No information available",
    "food_idustry": "Probiotic dietary supplements for digestive health, immune support. Used in some functional food products due to its stability. Animal feed probiotic.",
    "pharmaceutical_industry": "Probiotic preparations for irritable bowel syndrome (IBS), diarrhea, and other digestive issues.",
    "other_industries": ""
  },
  {
    "name": "xylo-oligosaccharides",
    "cas_no": "87-99-0 (Xylitol, a related sugar alcohol, not XOS itself); specific XOS structures have different CAS.",
    "cins_no": "",
    "molecular_formula": "Polymers of xylose, (C5H8O4)n",
    "discription": "Non-digestible oligosaccharides composed of xylose units. They are prebiotic fibers that promote the growth of beneficial gut bacteria.",
    "typical_properties": "Specification: 95%-99% (XOS content). White to light yellow powder. Soluble in water. Slightly sweet.",
    "packing": "No information available",
    "food_idustry": "Prebiotic dietary supplements, functional food ingredient (e.g., dairy products, beverages, bakery goods) to improve gut health. Animal feed additive to promote beneficial gut flora.",
    "pharmaceutical_industry": "Investigated for improving gut microbiota, reducing constipation, and potential metabolic benefits.",
    "other_industries": ""
  },
  {
    "name": "chito-oligosaccharides",
    "cas_no": "148411-57-8 (generic for Chitosan oligosaccharide)",
    "cins_no": "",
    "molecular_formula": "Oligomers of D-glucosamine (deacetylated) and N-acetyl-D-glucosamine",
    "discription": "Oligomers derived from the depolymerization of chitosan or chitin. They are water-soluble and have various biological activities.",
    "typical_properties": "Specification: 95%-99% (COS content). White to light yellow powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (prebiotic, antioxidant, immune support). Functional food ingredient. Animal feed additive for growth promotion and immune enhancement.",
    "pharmaceutical_industry": "Investigated for anti-inflammatory, antimicrobial, antioxidant, and anti-tumor properties. Potential in drug delivery and wound healing.",
    "other_industries": "Agriculture (plant elicitor, biopesticide), cosmetics."
  },
  {
    "name": "isomalto-oligosaccharides",
    "cas_no": "499-40-1 (Isomaltose); 9004-54-0 (general dextran which can be a source or related). IMO mixture has no single CAS.",
    "cins_no": "",
    "molecular_formula": "Mixture of glucose oligomers with α-(1→6) linkages",
    "discription": "A mixture of short-chain carbohydrates that are partially digestible. They function as prebiotics and have a mildly sweet taste.",
    "typical_properties": "Specification: 95%-99% (IMO content). White powder or viscous syrup. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Prebiotic dietary supplements, functional food ingredient (e.g., health bars, beverages, dairy products) as a low-calorie sweetener and fiber source. Animal feed.",
    "pharmaceutical_industry": "Used to promote gut health by stimulating beneficial bacteria.",
    "other_industries": ""
  },
  {
    "name": "fructo-oligosaccharides",
    "cas_no": "308066-66-2 (generic for FOS)",
    "cins_no": "",
    "molecular_formula": "Polymers of fructose, (C6H10O5)n",
    "discription": "Non-digestible carbohydrates composed of short chains of fructose molecules. They are well-known prebiotics that stimulate the growth of beneficial gut bacteria like Bifidobacteria.",
    "typical_properties": "Specification: 95%-99% (FOS content). White powder or syrup. Soluble in water. Sweet taste.",
    "packing": "No information available",
    "food_idustry": "Widely used as a prebiotic dietary supplement and functional food ingredient (e.g., infant formulas, dairy products, cereals, beverages) for gut health. Animal feed additive.",
    "pharmaceutical_industry": "Used to improve bowel regularity, enhance mineral absorption, and support gut microbiota.",
    "other_industries": ""
  },
  {
    "name": "manno-oligosaccharides",
    "cas_no": "Mixture, specific structures vary. No single CAS for general MOS.",
    "cins_no": "",
    "molecular_formula": "Polymers of mannose",
    "discription": "Complex carbohydrates derived from the cell walls of Saccharomyces cerevisiae yeast. They act as prebiotics and can bind to pathogens, preventing their attachment to the intestinal wall.",
    "typical_properties": "Specification: 95%-99% (MOS content or related active components like beta-glucans). Light tan to brown powder. Dispersible in water.",
    "packing": "No information available",
    "food_idustry": "Primarily used as an animal feed additive (especially poultry, swine, aquaculture) to improve gut health, immune response, and growth performance. Limited use in human dietary supplements.",
    "pharmaceutical_industry": "Veterinary applications for gut health.",
    "other_industries": ""
  },
  {
    "name": "ethoxyquinoline",
    "cas_no": "91-53-2",
    "cins_no": "E324",
    "molecular_formula": "C14H19NO",
    "discription": "A quinoline-based antioxidant primarily used to prevent scald (a storage disorder) in pears and apples, and as a preservative in animal feeds and spices to prevent rancidity and loss of fat-soluble vitamins.",
    "typical_properties": "Specification: 95%-99%. Dark amber to brown viscous liquid or solid. Insoluble in water, soluble in organic solvents.",
    "packing": "No information available",
    "food_idustry": "Permitted as an antioxidant (E324) in certain animal feeds (e.g., fish meal, poultry feed) and in some spices (e.g., chili powder, paprika) to prevent lipid peroxidation and vitamin degradation. Its use in human food is controversial and restricted in some regions.",
    "pharmaceutical_industry": "Not typically used in pharmaceuticals.",
    "other_industries": "Rubber industry (antidegradant)."
  },
  {
    "name": "butylated hydroxyanisole BHA",
    "cas_no": "25013-16-5 (mixture of isomers); 121-00-6 (3-tert-butyl-4-hydroxyanisole); 88-32-4 (2-tert-butyl-4-hydroxyanisole)",
    "cins_no": "E320",
    "molecular_formula": "C11H16O2",
    "discription": "A synthetic antioxidant consisting of a mixture of two isomeric organic compounds. It is used to prevent oxidative rancidity in foods containing fats and oils.",
    "typical_properties": "Specification: 95%-99%. White or slightly yellow waxy solid with a faint characteristic odor. Insoluble in water, soluble in fats, oils, and organic solvents.",
    "packing": "No information available",
    "food_idustry": "Widely used antioxidant (E320) in fatty foods, oils, shortenings, cereals, chewing gum, potato chips, and packaging materials to extend shelf life.",
    "pharmaceutical_industry": "Used as an antioxidant in pharmaceutical preparations, particularly those containing fats or oils.",
    "other_industries": "Cosmetics, animal feed, petroleum products, rubber."
  },
  {
    "name": "Butylated hydroxytoluene BHT",
    "cas_no": "128-37-0",
    "cins_no": "E321",
    "molecular_formula": "C15H24O",
    "discription": "A synthetic phenolic antioxidant used to prevent autoxidation in products containing fats and oils, thus extending their shelf life.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder or solid with a faint characteristic odor. Insoluble in water, soluble in oils and organic solvents.",
    "packing": "No information available",
    "food_idustry": "Common antioxidant (E321) in a wide range of foods including processed fats and oils, cereals, snack foods, baked goods, and animal feeds.",
    "pharmaceutical_industry": "Used as an antioxidant in pharmaceutical products, especially oil-based formulations.",
    "other_industries": "Cosmetics, plastics, rubber, petroleum products (jet fuels, lubricating oils)."
  },
  {
    "name": "Propyl gallate",
    "cas_no": "121-79-9",
    "cins_no": "E310",
    "molecular_formula": "C10H12O5",
    "discription": "An ester of gallic acid and propanol. It is used as a synthetic antioxidant in foods, particularly to protect oils and fats from oxidation.",
    "typical_properties": "Specification: 95%-99%. White to creamy-white crystalline powder, odorless or with a slight characteristic odor. Slightly soluble in water, soluble in alcohol and oils.",
    "packing": "No information available",
    "food_idustry": "Antioxidant (E310) in edible oils, fats, margarines, baked goods, snack foods, and chewing gum. Often used in combination with BHA and BHT.",
    "pharmaceutical_industry": "Antioxidant in pharmaceutical formulations.",
    "other_industries": "Cosmetics, lubricating oils."
  },
  {
    "name": "Sodium glutamate",
    "cas_no": "142-47-2 (Monosodium L-glutamate, MSG); 6106-04-3 (MSG monohydrate)",
    "cins_no": "E621",
    "molecular_formula": "C5H8NNaO4",
    "discription": "The sodium salt of glutamic acid, one of the most abundant naturally occurring non-essential amino acids. It is widely used as a flavor enhancer to provide an umami taste.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder or crystals. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Flavor enhancer (E621) in a vast array of processed foods, including soups, sauces, snack foods, processed meats, and ready-to-eat meals.",
    "pharmaceutical_industry": "Limited use, sometimes as a component in nutritional therapies under medical supervision.",
    "other_industries": ""
  },
  {
    "name": "Citrate",
    "cas_no": "Varies depending on the salt (e.g., Sodium citrate: 68-04-2, Potassium citrate: 866-84-2, Calcium citrate: 813-94-5)",
    "cins_no": "E330 (Citric acid), E331 (Sodium citrates), E332 (Potassium citrates), E333 (Calcium citrates)",
    "molecular_formula": "C6H5O7^3- (Citrate ion)",
    "discription": "Refers to salts or esters of citric acid. Citrates are widely used in food as acidulants, flavorings, preservatives, and sequestrants (chelating agents).",
    "typical_properties": "Specification: 95%-99% (for a specific citrate salt). Typically white crystalline powders. Solubility varies with the cation.",
    "packing": "No information available",
    "food_idustry": "Used as acidulants, emulsifiers, sequestrants, and flavor enhancers in beverages, dairy products (cheese), jams, desserts, and processed foods. (E330-E333).",
    "pharmaceutical_industry": "Anticoagulant (sodium citrate for blood collection), buffering agents, effervescent formulations, mineral supplements (e.g., calcium citrate, potassium citrate for kidney stones).",
    "other_industries": "Cleaning agents, cosmetics, metal finishing."
  },
  {
    "name": "Silymarin (Milk thistle extract )",
    "cas_no": "65666-07-1 (Silymarin complex); 22888-70-6 (Silybin, main component)",
    "cins_no": "",
    "molecular_formula": "Mixture, Silybin: C25H22O10",
    "discription": "A standardized extract from the seeds of milk thistle (Silybum marianum), containing a complex of flavonolignans, with silybin (or silibinin) being the major active component. Known for hepatoprotective properties.",
    "typical_properties": "Specification: UV80% HPLC20 (Indicates 80% total flavonolignans by UV, with specific components like Silybin at 20% by HPLC). Yellowish to brownish powder. Poorly soluble in water, soluble in organic solvents.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for liver health, detoxification, and antioxidant support. Functional food ingredient.",
    "pharmaceutical_industry": "Used in the treatment of liver diseases (e.g., alcoholic liver disease, viral hepatitis, toxin-induced liver damage). Investigated for anti-cancer and other properties.",
    "other_industries": ""
  },
  {
    "name": "Monensin",
    "cas_no": "17090-79-8 (Monensin A); 22373-78-0 (Monensin sodium)",
    "cins_no": "",
    "molecular_formula": "C36H62O11 (Monensin A)",
    "discription": "A polyether ionophore antibiotic produced by Streptomyces cinnamonensis. Used in veterinary medicine as a coccidiostat and to improve feed efficiency in ruminants.",
    "typical_properties": "Specification: 8-98% (Typically supplied as a premix or technical grade). White to off-white crystalline powder. Poorly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Animal feed additive for cattle (improves feed efficiency, growth promotion, bloat prevention) and poultry (coccidiostat). Not for human consumption.",
    "pharmaceutical_industry": "Veterinary medicine only.",
    "other_industries": ""
  },
  {
    "name": "Ascorbic acid",
    "cas_no": "50-81-7",
    "cins_no": "E300",
    "molecular_formula": "C6H8O6",
    "discription": "The chemical name for Vitamin C, a water-soluble vitamin and antioxidant essential for various biological functions including collagen synthesis and immune support.",
    "typical_properties": "Specification: 97% Granukation(SFC-97) (Likely refers to 97% purity, granulated form, possibly 'Sodium Free Coating' or similar grade). White or slightly yellow crystals or powder. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Antioxidant (E300), nutrient supplement, dough improver, color stabilizer in beverages, fruits, meats. Dietary supplements.",
    "pharmaceutical_industry": "Prevention and treatment of scurvy. Component of multivitamin and immune-support supplements.",
    "other_industries": "Cosmetics, photography."
  },
  {
    "name": "Vitamin K2 Vitamin K2 natural",
    "cas_no": "MK-4: 863-61-6; MK-7: 2124-57-4 (or 27670-94-6)",
    "cins_no": "",
    "molecular_formula": "C31H40O2 (MK-4); C46H64O2 (MK-7)",
    "discription": "A group of fat-soluble vitamins called menaquinones (MK-n), essential for blood clotting and bone metabolism (directing calcium to bones). MK-7 and MK-4 are common forms.",
    "typical_properties": "Specification: MK7 1% / 2000ppm. Yellow crystalline powder or oil. Insoluble in water, soluble in fats.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for bone and cardiovascular health. Fortification of some foods (e.g., dairy, oils). Animal feed.",
    "pharmaceutical_industry": "Used in supplements to support bone density and cardiovascular health. Investigated for osteoporosis.",
    "other_industries": ""
  },
  {
    "name": "N-Acetyl L-Carnitine HCL",
    "cas_no": "5080-50-2",
    "cins_no": "",
    "molecular_formula": "C9H18ClNO4",
    "discription": "An acetylated form of L-carnitine, an amino acid derivative. It plays a role in energy metabolism by transporting fatty acids into mitochondria and has neuroprotective properties.",
    "typical_properties": "Specification: 95%-99%. White crystalline powder, hygroscopic. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for cognitive function, nerve health, energy production, and male fertility.",
    "pharmaceutical_industry": "Investigated and used for various neurological conditions (e.g., diabetic neuropathy, Alzheimer's disease, depression) and age-related decline.",
    "other_industries": ""
  },
  {
    "name": "Tricreatine Malate",
    "cas_no": "No single CAS for the compound; Creatine Monohydrate: 6020-87-7; Malic Acid: 6915-15-7 / 97-67-6 (L-Malic)",
    "cins_no": "",
    "molecular_formula": "Typically C16H29N9O11 (3 creatine molecules + 1 malic acid, approximate)",
    "discription": "A compound formed by bonding three creatine molecules with one molecule of malic acid. Claimed to offer better solubility and absorption than creatine monohydrate.",
    "typical_properties": "Specification: Malate (Likely refers to a specific malate content or ratio). White crystalline powder. More soluble in water than creatine monohydrate.",
    "packing": "No information available",
    "food_idustry": "Sports nutrition supplement used to enhance athletic performance, muscle strength, and power.",
    "pharmaceutical_industry": "Not a standard pharmaceutical; creatine itself has been studied for muscle disorders.",
    "other_industries": ""
  },
  {
    "name": "Magnesium bisglysinate",
    "cas_no": "14783-68-7 (Magnesium glycinate); 35947-07-0 (Magnesium bisglycinate chelate)",
    "cins_no": "",
    "molecular_formula": "C4H8MgN2O4",
    "discription": "A chelated form of magnesium where magnesium is bound to two glycine molecules. It is known for high bioavailability and good tolerability.",
    "typical_properties": "Specification: 20%mg (Likely refers to 20% elemental magnesium content by weight). White powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplement for magnesium repletion, often preferred for its gentleness on the stomach. Used for muscle relaxation, sleep support, and stress relief.",
    "pharmaceutical_industry": "Used as a source of magnesium to treat or prevent deficiency.",
    "other_industries": ""
  },
  {
    "name": "Spirulina Powder",
    "cas_no": "724424-92-4 (General for Spirulina extract); specific compounds within have their own.",
    "cins_no": "",
    "molecular_formula": "N/A (Complex biomass)",
    "discription": "A biomass of cyanobacteria (blue-green algae), typically from Arthrospira platensis or Arthrospira maxima. Rich in protein, vitamins, minerals, and antioxidants like phycocyanin.",
    "typical_properties": "Specification: Powder. Dark green to blue-green powder with a characteristic seaweed-like odor. Forms a suspension in water.",
    "packing": "No information available",
    "food_idustry": "Popular dietary supplement (superfood) for its nutritional content and antioxidant properties. Used as a food ingredient in smoothies, health bars. Natural food colorant. Animal feed and aquaculture feed additive.",
    "pharmaceutical_industry": "Investigated for various health benefits including immune modulation, anti-inflammatory effects, and lipid-lowering potential.",
    "other_industries": "Cosmetics."
  },
  {
    "name": "BCAA Fermentation",
    "cas_no": "L-Leucine: 61-90-5; L-Isoleucine: 73-32-5; L-Valine: 72-18-4",
    "cins_no": "",
    "molecular_formula": "Mixture (C6H13NO2, C6H13NO2, C5H11NO2)",
    "discription": "Branched-Chain Amino Acids (Leucine, Isoleucine, Valine) produced through a fermentation process rather than extraction from protein sources. Often supplied in specific ratios.",
    "typical_properties": "Specification: 02:01:01 (Commonly refers to a 2:1:1 ratio of Leucine:Isoleucine:Valine). White crystalline powder.",
    "packing": "No information available",
    "food_idustry": "Widely used in sports nutrition supplements to promote muscle protein synthesis, reduce muscle breakdown, and aid recovery. Functional food ingredient.",
    "pharmaceutical_industry": "Used in medical nutrition for patients with liver disease, catabolic states, or requiring enhanced muscle repair.",
    "other_industries": ""
  },
  {
    "name": "Gamma-Aminobutyric Acid (GABA)",
    "cas_no": "56-12-2",
    "cins_no": "",
    "molecular_formula": "C4H9NO2",
    "discription": "The chief inhibitory neurotransmitter in the mammalian central nervous system. As a supplement, it is used for its purported calming and relaxing effects.",
    "typical_properties": "Specification: GABA (likely refers to high purity GABA). White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for stress reduction, anxiety relief, mood improvement, and sleep aid. Functional food ingredient in some relaxation-promoting products.",
    "pharmaceutical_industry": "GABA analogs (e.g., gabapentin, pregabalin) are used as medications, but GABA itself has limited blood-brain barrier permeability. Investigated for various neurological applications.",
    "other_industries": ""
  },
  {
    "name": "Seaweed Oil Powder",
    "cas_no": "Varies based on specific algal source and oil composition (e.g., DHA-rich algal oil has specific identifiers).",
    "cins_no": "",
    "molecular_formula": "N/A (Complex mixture of lipids, encapsulated)",
    "discription": "An oil extracted from marine microalgae, often rich in omega-3 fatty acids like Docosahexaenoic Acid (DHA) and/or Eicosapentaenoic Acid (EPA). The powder form is typically an encapsulated oil.",
    "typical_properties": "Specification: 20%DHA (Indicates 20% DHA content by weight of the oil or powder). Off-white to yellowish powder. Dispersible in water (if encapsulated).",
    "packing": "No information available",
    "food_idustry": "Vegetarian/vegan source of DHA/EPA for dietary supplements and food fortification (e.g., infant formulas, dairy products, beverages) for brain, eye, and heart health. Animal feed, especially aquaculture.",
    "pharmaceutical_industry": "Source of DHA/EPA for pharmaceutical-grade omega-3 supplements.",
    "other_industries": ""
  },
  {
    "name": "L-Glutathione Reduced",
    "cas_no": "70-18-8",
    "cins_no": "",
    "molecular_formula": "C10H17N3O6S",
    "discription": "A tripeptide (glutamate-cysteine-glycine) and a major endogenous antioxidant in cells. The 'reduced' form (GSH) is the active antioxidant form.",
    "typical_properties": "Specification: 98% - 101% (Synthesis) (Indicates high purity, likely produced by chemical synthesis or fermentation). White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements for antioxidant support, detoxification, immune function, and skin health (lightening).",
    "pharmaceutical_industry": "Used for treating acetaminophen poisoning, liver diseases, and conditions associated with oxidative stress. Investigated for numerous other applications.",
    "other_industries": "Cosmetics (skin lightening, antioxidant)."
  },
  {
    "name": "L-Citrulline",
    "cas_no": "372-75-8",
    "cins_no": "",
    "molecular_formula": "C6H13N3O3",
    "discription": "A non-essential amino acid that plays a role in the urea cycle and is a precursor to L-arginine, thereby involved in nitric oxide production.",
    "typical_properties": "Specification: 98% - 101% (Synthesis). White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Popular sports nutrition supplement for improving athletic performance, reducing fatigue, and enhancing blood flow (often as L-Citrulline Malate). Dietary supplements.",
    "pharmaceutical_industry": "Investigated for cardiovascular health, erectile dysfunction, and conditions benefiting from enhanced nitric oxide production.",
    "other_industries": ""
  },
  {
    "name": "Beta Alanine",
    "cas_no": "107-95-9",
    "cins_no": "",
    "molecular_formula": "C3H7NO2",
    "discription": "A naturally occurring beta-amino acid. It is a precursor to carnosine, a dipeptide found in muscle tissue that buffers acid and may reduce fatigue.",
    "typical_properties": "Specification: Beta Alanine 99%. White crystalline powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Widely used sports nutrition supplement to increase muscle carnosine levels, thereby improving high-intensity exercise performance and delaying muscle fatigue.",
    "pharmaceutical_industry": "Not a primary pharmaceutical, but carnosine (which it helps synthesize) is studied for various health benefits.",
    "other_industries": ""
  },
  {
    "name": "Vitamin A Acetate powder",
    "cas_no": "127-47-9 (Retinyl acetate)",
    "cins_no": "",
    "molecular_formula": "C22H32O2",
    "discription": "The acetate ester of retinol (Vitamin A), a fat-soluble vitamin essential for vision, immune function, reproduction, and cellular communication. Powder form is usually stabilized.",
    "typical_properties": "Specification: 1000-500000IU/g. Light yellow to yellow crystalline powder. Insoluble in water, soluble in fats and organic solvents. Sensitive to light and air.",
    "packing": "No information available",
    "food_idustry": "Food fortification (e.g., margarine, dairy products, cereals), dietary supplements. Major animal feed additive for all species to ensure adequate Vitamin A status.",
    "pharmaceutical_industry": "Treatment and prevention of Vitamin A deficiency. Component of multivitamin preparations. Topical forms used for skin conditions (e.g., acne, photoaging).",
    "other_industries": "Cosmetics (anti-aging)."
  },
  {
    "name": "D-Calcium Pantothenate",
    "cas_no": "137-08-6",
    "cins_no": "",
    "molecular_formula": "(C9H16NO5)2Ca",
    "discription": "The calcium salt of the D-isomer of pantothenic acid (Vitamin B5), which is the biologically active form. Used in supplements and feeds as a stable source of Vitamin B5.",
    "typical_properties": "Specification: 98-102%. White, slightly hygroscopic powder. Odorless and has a slightly bitter taste. Freely soluble in water.",
    "packing": "No information available",
    "food_idustry": "Common form of Vitamin B5 used in dietary supplements, food fortification, and extensively in animal feed for metabolism, growth, and overall health.",
    "pharmaceutical_industry": "Component of multivitamin preparations and B-complex vitamins. Used to treat pantothenic acid deficiency.",
    "other_industries": ""
  },
  {
    "name": "Chitosan Oligosaccharide",
    "cas_no": "148411-57-8 (generic for Chitosan oligosaccharide)",
    "cins_no": "",
    "molecular_formula": "Oligomers of D-glucosamine and N-acetyl-D-glucosamine",
    "discription": "Short-chain polymers derived from chitosan (which comes from chitin). They are water-soluble and possess various biological activities, including prebiotic and immunomodulatory effects.",
    "typical_properties": "Specification: CS/SL 10% (Possibly refers to 10% content of a specific grade or form, 'CS' for Chitosan, 'SL' for soluble/short length). White to light yellow powder. Soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplements (prebiotic, antioxidant). Functional food ingredient. Animal feed additive for growth promotion and disease resistance.",
    "pharmaceutical_industry": "Investigated for anti-inflammatory, antimicrobial, antioxidant, and anti-tumor activities. Potential applications in drug delivery and wound healing.",
    "other_industries": "Agriculture (plant growth promoter, biopesticide), cosmetics."
  },
  {
    "name": "Chitosan / chitin",
    "cas_no": "Chitosan: 9012-76-4; Chitin: 1398-61-4",
    "cins_no": "",
    "molecular_formula": "Chitosan: (C6H11NO4)n; Chitin: (C8H13NO5)n",
    "discription": "Chitin is a natural polysaccharide found in crustacean shells and fungal cell walls. Chitosan is its deacetylated derivative. 'SPK/NYK/GYK/DZK/NMK' likely refer to specific product grades or types based on source, deacetylation degree, or particle size.",
    "typical_properties": "Specification: SPK/NYK/GYK/DZK/NMK. Chitin: White amorphous solid. Chitosan: White to off-white flakes/powder. Chitin is insoluble in water and most organic solvents; Chitosan is insoluble in water but soluble in dilute acids.",
    "packing": "No information available",
    "food_idustry": "Chitosan: Dietary supplements (fat binder), food preservative, clarifying agent. Animal feed.",
    "pharmaceutical_industry": "Chitosan: Drug delivery, wound dressings, hemostatic agents. Chitin: Surgical sutures, wound healing materials.",
    "other_industries": "Water treatment, cosmetics, agriculture, textiles."
  },
  {
    "name": "5-HTP",
    "cas_no": "56-69-9 (L-5-Hydroxytryptophan); 4350-09-8 (DL-5-Hydroxytryptophan)",
    "cins_no": "",
    "molecular_formula": "C11H12N2O3",
    "discription": "5-Hydroxytryptophan is an amino acid precursor to the neurotransmitter serotonin and the hormone melatonin. It is extracted from the seeds of the Griffonia simplicifolia plant.",
    "typical_properties": "Specification: 10-99%. White to off-white crystalline powder. Sparingly soluble in water.",
    "packing": "No information available",
    "food_idustry": "Dietary supplement used to support mood, sleep, appetite control, and reduce anxiety by increasing serotonin levels.",
    "pharmaceutical_industry": "Investigated and sometimes used for depression, anxiety, insomnia, fibromyalgia, and migraine headaches. Its efficacy and safety require careful consideration.",
    "other_industries": ""
  }
]